import 'package:flutter/material.dart';


var AzkarElmasa = [
  {
    "zekr": "أَمْسَيْـنا وَأَمْسـى المُـلْكُ لله وَالحَمدُ لله ، لا إلهَ إلاّ اللّهُ وَحدَهُ لا شَريكَ لهُ، لهُ المُـلكُ ولهُ الحَمْـد، وهُوَ على كلّ شَيءٍ قدير ، رَبِّ أسْـأَلُـكَ خَـيرَ ما في هـذا اليوم وَخَـيرَ ما بَعْـدَه ، وَأَعـوذُ بِكَ مِنْ شَـرِّ ما في هـذا اليوم وَشَرِّ ما بَعْـدَه، رَبِّ أَعـوذُبِكَ مِنَ الْكَسَـلِ وَسـوءِ الْكِـبَر ، رَبِّ أَعـوذُ بِكَ مِنْ عَـذابٍ في النّـارِ وَعَـذابٍ في القَـبْر",
    "repeat": 1,
    "bless": ""
  },
  {
    "zekr": "اللّهـمَّ أَنْتَ رَبِّـي لا إلهَ إلاّ أَنْتَ ، خَلَقْتَنـي وَأَنا عَبْـدُك ، وَأَنا عَلـى عَهْـدِكَ وَوَعْـدِكَ ما اسْتَـطَعْـت ، أَعـوذُبِكَ مِنْ شَـرِّ ما صَنَـعْت ، أَبـوءُ لَـكَ بِنِعْـمَتِـكَ عَلَـيَّ وَأَبـوءُ بِذَنْـبي فَاغْفـِرْ لي فَإِنَّـهُ لا يَغْـفِرُ الذُّنـوبَ إِلاّ أَنْتَ .",
    "repeat": 1,
    "bless": "من قالها موقنا بها حين يمسى ومات من ليلته دخل الجنة وكذلك حين يصبح."
  },
  {
    "zekr": "رَضيـتُ بِاللهِ رَبَّـاً وَبِالإسْلامِ ديـناً وَبِمُحَـمَّدٍ صلى الله عليه وسلم نَبِيّـاً.",
    "repeat": 3,
    "bless": "من قالها حين يصبح وحين يمسى كان حقا على الله أن يرضيه يوم القيامة."
  },
  {
    "zekr": "اللّهُـمَّ إِنِّـي أَمسيتُ أُشْـهِدُك ، وَأُشْـهِدُ حَمَلَـةَ عَـرْشِـك ، وَمَلَائِكَتَكَ ، وَجَمـيعَ خَلْـقِك ، أَنَّـكَ أَنْـتَ اللهُ لا إلهَ إلاّ أَنْـتَ وَحْـدَكَ لا شَريكَ لَـك ، وَأَنَّ ُ مُحَمّـداً عَبْـدُكَ وَرَسـولُـك.",
    "repeat": 4,
    "bless": "من قالها أعتقه الله من النار."
  },
  {
    "zekr": "اللّهُـمَّ ما أَمسى بي مِـنْ نِعْـمَةٍ أَو بِأَحَـدٍ مِـنْ خَلْـقِك ، فَمِـنْكَ وَحْـدَكَ لا شريكَ لَـك ، فَلَـكَ الْحَمْـدُ وَلَـكَ الشُّكْـر.",
    "repeat": 1,
    "bless": "من قالها حين يصبح أدى شكر يومه."
  },
  {
    "zekr": "حَسْبِـيَ اللّهُ لا إلهَ إلاّ هُوَ عَلَـيهِ تَوَكَّـلتُ وَهُوَ رَبُّ العَرْشِ العَظـيم.",
    "repeat": 7,
    "bless": "من قالها كفاه الله ما أهمه من أمر الدنيا والأخرة."
  },
  {
    "zekr": "بِسـمِ اللهِ الذي لا يَضُـرُّ مَعَ اسمِـهِ شَيءٌ في الأرْضِ وَلا في السّمـاءِ وَهـوَ السّمـيعُ العَلـيم.",
    "repeat": 3,
    "bless": "لم يضره من الله شيء."
  },
  {
    "zekr": "اللّهُـمَّ بِكَ أَمْسَيْـنا وَبِكَ أَصْـبَحْنا ، وَبِكَ نَحْـيا وَبِكَ نَمُـوتُ وَإِلَـيْكَ النُّـشُور.",
    "repeat": 1,
    "bless": ""
  },
  {
    "zekr": "أَمْسَيْـنا عَلَى فِطْرَةِ الإسْلاَمِ، وَعَلَى كَلِمَةِ الإِخْلاَصِ، وَعَلَى دِينِ نَبِيِّنَا مُحَمَّدٍ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، وَعَلَى مِلَّةِ أَبِينَا إبْرَاهِيمَ حَنِيفاً مُسْلِماً وَمَا كَانَ مِنَ المُشْرِكِينَ.",
    "repeat": 1,
    "bless": ""
  },
  {
    "zekr": "سُبْحـانَ اللهِ وَبِحَمْـدِهِ عَدَدَ خَلْـقِه ، وَرِضـا نَفْسِـه ، وَزِنَـةَ عَـرْشِـه ، وَمِـدادَ كَلِمـاتِـه.",
    "repeat": 3,
    "bless": ""
  },
  {
    "zekr": "اللّهُـمَّ عافِـني في بَدَنـي ، اللّهُـمَّ عافِـني في سَمْـعي ، اللّهُـمَّ عافِـني في بَصَـري ، لا إلهَ إلاّ أَنْـتَ.",
    "repeat": 3,
    "bless": ""
  },
  {
    "zekr": "اللّهُـمَّ إِنّـي أَعـوذُ بِكَ مِنَ الْكُـفر ، وَالفَـقْر ، وَأَعـوذُ بِكَ مِنْ عَذابِ القَـبْر ، لا إلهَ إلاّ أَنْـتَ.",
    "repeat": 3,
    "bless": ""
  },
  {
    "zekr": "اللّهُـمَّ إِنِّـي أسْـأَلُـكَ العَـفْوَ وَالعـافِـيةَ في الدُّنْـيا وَالآخِـرَة ، اللّهُـمَّ إِنِّـي أسْـأَلُـكَ العَـفْوَ وَالعـافِـيةَ في ديني وَدُنْـيايَ وَأهْـلي وَمالـي ، اللّهُـمَّ اسْتُـرْ عـوْراتي وَآمِـنْ رَوْعاتـي ، اللّهُـمَّ احْفَظْـني مِن بَـينِ يَدَيَّ وَمِن خَلْفـي وَعَن يَمـيني وَعَن شِمـالي ، وَمِن فَوْقـي ، وَأَعـوذُ بِعَظَمَـتِكَ أَن أُغْـتالَ مِن تَحْتـي.",
    "repeat": 1,
    "bless": ""
  },
  {
    "zekr": "يَا حَيُّ يَا قيُّومُ بِرَحْمَتِكَ أسْتَغِيثُ أصْلِحْ لِي شَأنِي كُلَّهُ وَلاَ تَكِلْنِي إلَى نَفْسِي طَـرْفَةَ عَيْنٍ.",
    "repeat": 3,
    "bless": ""
  },
  {
    "zekr": "أَمْسَيْنا وَأَمْسَى المُـلكُ للهِ رَبِّ العـالَمـين ، اللّهُـمَّ إِنِّـي أسْـأَلُـكَ خَـيْرَ هـذا الـيَوْم ، فَـتْحَهُ ، وَنَصْـرَهُ ، وَنـورَهُ وَبَـرَكَتَـهُ ، وَهُـداهُ ، وَأَعـوذُ بِـكَ مِـنْ شَـرِّ ما فـيهِ وَشَـرِّ ما بَعْـدَه.",
    "repeat": 1,
    "bless": ""
  },
  {
    "zekr": "اللّهُـمَّ عالِـمَ الغَـيْبِ وَالشّـهادَةِ فاطِـرَ السّماواتِ وَالأرْضِ رَبَّ كـلِّ شَـيءٍ وَمَليـكَه ، أَشْهَـدُ أَنْ لا إِلـهَ إِلاّ أَنْت ، أَعـوذُ بِكَ مِن شَـرِّ نَفْسـي وَمِن شَـرِّ الشَّيْـطانِ وَشِرْكِهِ ، وَأَنْ أَقْتَـرِفَ عَلـى نَفْسـي سوءاً أَوْ أَجُـرَّهُ إِلـى مُسْـلِم.",
    "repeat": 1,
    "bless": ""
  },
  {
    "zekr": "أَعـوذُ بِكَلِمـاتِ اللّهِ التّـامّـاتِ مِنْ شَـرِّ ما خَلَـق.",
    "repeat": 3,
    "bless": ""
  },
  {
    "zekr": "اللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ وَآلِ مُحَمَّدٍ، كَمَا صَلَّيْتَ عَلَى آلِ إِبْرَاهِيمَ،إِنَّكَ حَمِيدٌ مَجِيدٌ، اللَّهُمَّ بَارِكْ عَلَى مُحَمَّدٍ وَآلِ مُحَمَّدٍ، كَمَا بَارَكْتَ عَلَى آلِ إِبْرَاهِيمَ، إِنَّكَ حَمِيدٌ مَجِيدٌ.",
    "repeat": 10,
    "bless": "من صلى على حين يصبح وحين يمسى ادركته شفاعتى يوم القيامة."
  },
  {
    "zekr": "اللَّهُمَّ إِنَّا نَعُوذُ بِكَ مِنْ أَنْ نُشْرِكَ بِكَ شَيْئًا نَعْلَمُهُ ، وَنَسْتَغْفِرُكَ لِمَا لَا نَعْلَمُهُ.",
    "repeat": 3,
    "bless": ""
  },
  {
    "zekr": "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ الْهَمِّ وَالْحَزَنِ، وَأَعُوذُ بِكَ مِنْ الْعَجْزِ وَالْكَسَلِ، وَأَعُوذُ بِكَ مِنْ الْجُبْنِ وَالْبُخْلِ، وَأَعُوذُ بِكَ مِنْ غَلَبَةِ الدَّيْنِ، وَقَهْرِ الرِّجَالِ.",
    "repeat": 3,
    "bless": ""
  },
  {
    "zekr": "أسْتَغْفِرُ اللهَ العَظِيمَ الَّذِي لاَ إلَهَ إلاَّ هُوَ، الحَيُّ القَيُّومُ، وَأتُوبُ إلَيهِ.",
    "repeat": 3,
    "bless": ""
  },
  {
    "zekr": "يَا رَبِّ , لَكَ الْحَمْدُ كَمَا يَنْبَغِي لِجَلَالِ وَجْهِكَ , وَلِعَظِيمِ سُلْطَانِكَ.",
    "repeat": 3,
    "bless": ""
  },
  {
    "zekr": "اللَّهُمَّ أَنْتَ رَبِّي لا إِلَهَ إِلا أَنْتَ ، عَلَيْكَ تَوَكَّلْتُ ، وَأَنْتَ رَبُّ الْعَرْشِ الْعَظِيمِ , مَا شَاءَ اللَّهُ كَانَ ، وَمَا لَمْ يَشَأْ لَمْ يَكُنْ ، وَلا حَوْلَ وَلا قُوَّةَ إِلا بِاللَّهِ الْعَلِيِّ الْعَظِيمِ , أَعْلَمُ أَنَّ اللَّهَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ ، وَأَنَّ اللَّهَ قَدْ أَحَاطَ بِكُلِّ شَيْءٍ عِلْمًا , اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ شَرِّ نَفْسِي ، وَمِنْ شَرِّ كُلِّ دَابَّةٍ أَنْتَ آخِذٌ بِنَاصِيَتِهَا ، إِنَّ رَبِّي عَلَى صِرَاطٍ مُسْتَقِيمٍ.",
    "repeat": 1,
    "bless": ""
  },
  {
    "zekr": "لَا إلَه إلّا اللهُ وَحْدَهُ لَا شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءِ قَدِيرِ.",
    "repeat": 100,
    "bless": "كانت له عدل عشر رقاب، وكتبت له مئة حسنة، ومحيت عنه مئة سيئة، وكانت له حرزا من الشيطان."
  },
  {
    "zekr": "سُبْحـانَ اللهِ وَبِحَمْـدِهِ.",
    "repeat": 100,
    "bless": "حُطَّتْ خَطَايَاهُ وَإِنْ كَانَتْ مِثْلَ زَبَدِ الْبَحْرِ. لَمْ يَأْتِ أَحَدٌ يَوْمَ الْقِيَامَةِ بِأَفْضَلَ مِمَّا جَاءَ بِهِ إِلَّا أَحَدٌ قَالَ مِثْلَ مَا قَالَ أَوْ زَادَ عَلَيْهِ."
  }
];

var AzkarElsabah = [
  {
    "zekr": "أَعُوذُ بِاللهِ مِنْ الشَّيْطَانِ الرَّجِيمِ 'الله لا إلـه إلا هو الحي القيوم لا تأخذه سنة ولا نوم له ما في السماوات وما في الأرض من ذا الذي يشفع عنده إلا بإذنه يعلم ما بين أيديهم وما خلفهم ولا يحيطون بشيء من علمه إلا بما شاء وسع كرسيه السماوات والأرض ولا يؤوده حفظهما وهو العلي العظيم' -آية الكرسي,البقرة ,255.",
    "repeat": 1,
    "bless": "من قالها حين يصبح أجير من الجن حتى يمسى ومن قالها حين يمسى أجير من الجن حتى يصبح."
  },
  {
    "zekr": "بِسْمِ اللهِ الرَّحْمنِ الرَّحِيم قُلْ هُوَ ٱللَّهُ أَحَدٌ، ٱللَّهُ ٱلصَّمَدُ، لَمْ يَلِدْ وَلَمْ يُولَدْ، وَلَمْ يَكُن لَّهُۥ كُفُوًا أَحَدٌۢ.",
    "repeat": 3,
    "bless": "من قالها حين يصبح وحين يمسى كفته من كل شىء (الإخلاص والمعوذتين)."
  },
  {
    "zekr": "بِسْمِ اللهِ الرَّحْمنِ الرَّحِيم قُلْ أَعُوذُ بِرَبِّ ٱلْفَلَقِ، مِن شَرِّ مَا خَلَقَ، وَمِن شَرِّ غَاسِقٍ إِذَا وَقَبَ، وَمِن شَرِّ ٱلنَّفَّٰثَٰتِ فِى ٱلْعُقَدِ، وَمِن شَرِّ حَاسِدٍ إِذَا حَسَدَ.",
    "repeat": 3,
    "bless": "من قالها حين يصبح وحين يمسى كفته من كل شىء (الإخلاص والمعوذتين)."
  },
  {
    "zekr": " بِسْمِ اللهِ الرَّحْمنِ الرَّحِيم قُلْ أَعُوذُ بِرَبِّ ٱلنَّاسِ، مَلِكِ ٱلنَّاسِ، إِلَٰهِ ٱلنَّاسِ، مِن شَرِّ ٱلْوَسْوَاسِ ٱلْخَنَّاسِ، ٱلَّذِى يُوَسْوِسُ فِى صُدُورِ ٱلنَّاسِ، مِنَ ٱلْجِنَّةِ وَٱلنَّاسِ.",
    "repeat": 3,
    "bless": "من قالها حين يصبح وحين يمسى كفته من كل شىء (الإخلاص والمعوذتين)."
  },
  {
    "zekr": "أَصْـبَحْنا وَأَصْـبَحَ المُـلْكُ لله وَالحَمدُ لله ، لا إلهَ إلاّ اللّهُ وَحدَهُ لا شَريكَ لهُ، لهُ المُـلكُ ولهُ الحَمْـد، وهُوَ على كلّ شَيءٍ قدير ، رَبِّ أسْـأَلُـكَ خَـيرَ ما في هـذا اليوم وَخَـيرَ ما بَعْـدَه ، وَأَعـوذُ بِكَ مِنْ شَـرِّ ما في هـذا اليوم وَشَرِّ ما بَعْـدَه، رَبِّ أَعـوذُبِكَ مِنَ الْكَسَـلِ وَسـوءِ الْكِـبَر ، رَبِّ أَعـوذُ بِكَ مِنْ عَـذابٍ في النّـارِ وَعَـذابٍ في القَـبْر.",
    "repeat": 1,
    "bless": ""
  },
  {
    "zekr": "اللّهـمَّ أَنْتَ رَبِّـي لا إلهَ إلاّ أَنْتَ ، خَلَقْتَنـي وَأَنا عَبْـدُك ، وَأَنا عَلـى عَهْـدِكَ وَوَعْـدِكَ ما اسْتَـطَعْـت ، أَعـوذُبِكَ مِنْ شَـرِّ ما صَنَـعْت ، أَبـوءُ لَـكَ بِنِعْـمَتِـكَ عَلَـيَّ وَأَبـوءُ بِذَنْـبي فَاغْفـِرْ لي فَإِنَّـهُ لا يَغْـفِرُ الذُّنـوبَ إِلاّ أَنْتَ .",
    "repeat": 1,
    "bless": "من قالها موقنا بها حين يمسى ومات من ليلته دخل الجنة وكذلك حين يصبح."
  },
  {
    "zekr": "رَضيـتُ بِاللهِ رَبَّـاً وَبِالإسْلامِ ديـناً وَبِمُحَـمَّدٍ صلى الله عليه وسلم نَبِيّـاً.",
    "repeat": 3,
    "bless": "من قالها حين يصبح وحين يمسى كان حقا على الله أن يرضيه يوم القيامة."
  },
  {
    "zekr": "اللّهُـمَّ إِنِّـي أَصْبَـحْتُ أُشْـهِدُك ، وَأُشْـهِدُ حَمَلَـةَ عَـرْشِـك ، وَمَلَائِكَتَكَ ، وَجَمـيعَ خَلْـقِك ، أَنَّـكَ أَنْـتَ اللهُ لا إلهَ إلاّ أَنْـتَ وَحْـدَكَ لا شَريكَ لَـك ، وَأَنَّ ُ مُحَمّـداً عَبْـدُكَ وَرَسـولُـك.",
    "repeat": 4,
    "bless": "من قالها أعتقه الله من النار."
  },
  {
    "zekr": "اللّهُـمَّ ما أَصْبَـَحَ بي مِـنْ نِعْـمَةٍ أَو بِأَحَـدٍ مِـنْ خَلْـقِك ، فَمِـنْكَ وَحْـدَكَ لا شريكَ لَـك ، فَلَـكَ الْحَمْـدُ وَلَـكَ الشُّكْـر.",
    "repeat": 1,
    "bless": "من قالها حين يصبح أدى شكر يومه."
  },
  {
    "zekr": "حَسْبِـيَ اللّهُ لا إلهَ إلاّ هُوَ عَلَـيهِ تَوَكَّـلتُ وَهُوَ رَبُّ العَرْشِ العَظـيم.",
    "repeat": 7,
    "bless": "من قالها كفاه الله ما أهمه من أمر الدنيا والأخرة."
  },
  {
    "zekr": "بِسـمِ اللهِ الذي لا يَضُـرُّ مَعَ اسمِـهِ شَيءٌ في الأرْضِ وَلا في السّمـاءِ وَهـوَ السّمـيعُ العَلـيم.",
    "repeat": 3,
    "bless": "لم يضره من الله شيء."
  },
  {
    "zekr": "اللّهُـمَّ بِكَ أَصْـبَحْنا وَبِكَ أَمْسَـينا ، وَبِكَ نَحْـيا وَبِكَ نَمُـوتُ وَإِلَـيْكَ النُّـشُور.",
    "repeat": 1,
    "bless": ""
  },
  {
    "zekr": "أَصْبَـحْـنا عَلَى فِطْرَةِ الإسْلاَمِ، وَعَلَى كَلِمَةِ الإِخْلاَصِ، وَعَلَى دِينِ نَبِيِّنَا مُحَمَّدٍ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، وَعَلَى مِلَّةِ أَبِينَا إبْرَاهِيمَ حَنِيفاً مُسْلِماً وَمَا كَانَ مِنَ المُشْرِكِينَ.",
    "repeat": 1,
    "bless": ""
  },
  {
    "zekr": "سُبْحـانَ اللهِ وَبِحَمْـدِهِ عَدَدَ خَلْـقِه ، وَرِضـا نَفْسِـه ، وَزِنَـةَ عَـرْشِـه ، وَمِـدادَ كَلِمـاتِـه.",
    "repeat": 3,
    "bless": ""
  },
  {
    "zekr": "اللّهُـمَّ عافِـني في بَدَنـي ، اللّهُـمَّ عافِـني في سَمْـعي ، اللّهُـمَّ عافِـني في بَصَـري ، لا إلهَ إلاّ أَنْـتَ.",
    "repeat": 3,
    "bless": ""
  },
  {
    "zekr": "اللّهُـمَّ إِنّـي أَعـوذُ بِكَ مِنَ الْكُـفر ، وَالفَـقْر ، وَأَعـوذُ بِكَ مِنْ عَذابِ القَـبْر ، لا إلهَ إلاّ أَنْـتَ.",
    "repeat": 3,
    "bless": ""
  },
  {
    "zekr": "اللّهُـمَّ إِنِّـي أسْـأَلُـكَ العَـفْوَ وَالعـافِـيةَ في الدُّنْـيا وَالآخِـرَة ، اللّهُـمَّ إِنِّـي أسْـأَلُـكَ العَـفْوَ وَالعـافِـيةَ في ديني وَدُنْـيايَ وَأهْـلي وَمالـي ، اللّهُـمَّ اسْتُـرْ عـوْراتي وَآمِـنْ رَوْعاتـي ، اللّهُـمَّ احْفَظْـني مِن بَـينِ يَدَيَّ وَمِن خَلْفـي وَعَن يَمـيني وَعَن شِمـالي ، وَمِن فَوْقـي ، وَأَعـوذُ بِعَظَمَـتِكَ أَن أُغْـتالَ مِن تَحْتـي.",
    "repeat": 1,
    "bless": ""
  },
  {
    "zekr": "يَا حَيُّ يَا قيُّومُ بِرَحْمَتِكَ أسْتَغِيثُ أصْلِحْ لِي شَأنِي كُلَّهُ وَلاَ تَكِلْنِي إلَى نَفْسِي طَـرْفَةَ عَيْنٍ.",
    "repeat": 3,
    "bless": ""
  },
  {
    "zekr": "أَصْبَـحْـنا وَأَصْبَـحْ المُـلكُ للهِ رَبِّ العـالَمـين ، اللّهُـمَّ إِنِّـي أسْـأَلُـكَ خَـيْرَ هـذا الـيَوْم ، فَـتْحَهُ ، وَنَصْـرَهُ ، وَنـورَهُ وَبَـرَكَتَـهُ ، وَهُـداهُ ، وَأَعـوذُ بِـكَ مِـنْ شَـرِّ ما فـيهِ وَشَـرِّ ما بَعْـدَه.",
    "repeat": 1,
    "bless": ""
  },
  {
    "zekr": "اللّهُـمَّ عالِـمَ الغَـيْبِ وَالشّـهادَةِ فاطِـرَ السّماواتِ وَالأرْضِ رَبَّ كـلِّ شَـيءٍ وَمَليـكَه ، أَشْهَـدُ أَنْ لا إِلـهَ إِلاّ أَنْت ، أَعـوذُ بِكَ مِن شَـرِّ نَفْسـي وَمِن شَـرِّ الشَّيْـطانِ وَشِرْكِهِ ، وَأَنْ أَقْتَـرِفَ عَلـى نَفْسـي سوءاً أَوْ أَجُـرَّهُ إِلـى مُسْـلِم.",
    "repeat": 1,
    "bless": ""
  },
  {
    "zekr": "أَعـوذُ بِكَلِمـاتِ اللّهِ التّـامّـاتِ مِنْ شَـرِّ ما خَلَـق.",
    "repeat": 3,
    "bless": ""
  },
  {
    "zekr": "اللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ وَآلِ مُحَمَّدٍ، كَمَا صَلَّيْتَ عَلَى آلِ إِبْرَاهِيمَ،إِنَّكَ حَمِيدٌ مَجِيدٌ، اللَّهُمَّ بَارِكْ عَلَى مُحَمَّدٍ وَآلِ مُحَمَّدٍ، كَمَا بَارَكْتَ عَلَى آلِ إِبْرَاهِيمَ، إِنَّكَ حَمِيدٌ مَجِيدٌ.",
    "repeat": 10,
    "bless": "من صلى على حين يصبح وحين يمسى ادركته شفاعتى يوم القيامة."
  },
  {
    "zekr": "اللَّهُمَّ إِنَّا نَعُوذُ بِكَ مِنْ أَنْ نُشْرِكَ بِكَ شَيْئًا نَعْلَمُهُ ، وَنَسْتَغْفِرُكَ لِمَا لَا نَعْلَمُهُ.",
    "repeat": 3,
    "bless": ""
  },
  {
    "zekr": "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ الْهَمِّ وَالْحَزَنِ، وَأَعُوذُ بِكَ مِنْ الْعَجْزِ وَالْكَسَلِ، وَأَعُوذُ بِكَ مِنْ الْجُبْنِ وَالْبُخْلِ، وَأَعُوذُ بِكَ مِنْ غَلَبَةِ الدَّيْنِ، وَقَهْرِ الرِّجَالِ.",
    "repeat": 3,
    "bless": ""
  },
  {
    "zekr": "أسْتَغْفِرُ اللهَ العَظِيمَ الَّذِي لاَ إلَهَ إلاَّ هُوَ، الحَيُّ القَيُّومُ، وَأتُوبُ إلَيهِ.",
    "repeat": 3,
    "bless": ""
  },
  {
    "zekr": "يَا رَبِّ , لَكَ الْحَمْدُ كَمَا يَنْبَغِي لِجَلَالِ وَجْهِكَ , وَلِعَظِيمِ سُلْطَانِكَ.",
    "repeat": 3,
    "bless": ""
  },
  {
    "zekr": "اللَّهُمَّ إِنِّي أَسْأَلُكَ عِلْمًا نَافِعًا، وَرِزْقًا طَيِّبًا، وَعَمَلًا مُتَقَبَّلًا.",
    "repeat": 1,
    "bless": ""
  },
  {
    "zekr": "اللَّهُمَّ أَنْتَ رَبِّي لا إِلَهَ إِلا أَنْتَ ، عَلَيْكَ تَوَكَّلْتُ ، وَأَنْتَ رَبُّ الْعَرْشِ الْعَظِيمِ , مَا شَاءَ اللَّهُ كَانَ ، وَمَا لَمْ يَشَأْ لَمْ يَكُنْ ، وَلا حَوْلَ وَلا قُوَّةَ إِلا بِاللَّهِ الْعَلِيِّ الْعَظِيمِ , أَعْلَمُ أَنَّ اللَّهَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ ، وَأَنَّ اللَّهَ قَدْ أَحَاطَ بِكُلِّ شَيْءٍ عِلْمًا , اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ شَرِّ نَفْسِي ، وَمِنْ شَرِّ كُلِّ دَابَّةٍ أَنْتَ آخِذٌ بِنَاصِيَتِهَا ، إِنَّ رَبِّي عَلَى صِرَاطٍ مُسْتَقِيمٍ.",
    "repeat": 1,
    "bless": ""
  },
  {
    "zekr": "لَا إلَه إلّا اللهُ وَحْدَهُ لَا شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءِ قَدِيرِ.",
    "repeat": 100,
    "bless": "كانت له عدل عشر رقاب، وكتبت له مئة حسنة، ومحيت عنه مئة سيئة، وكانت له حرزا من الشيطان."
  },
  {
    "zekr": "سُبْحـانَ اللهِ وَبِحَمْـدِهِ.",
    "repeat": 100,
    "bless": "حُطَّتْ خَطَايَاهُ وَإِنْ كَانَتْ مِثْلَ زَبَدِ الْبَحْرِ. لَمْ يَأْتِ أَحَدٌ يَوْمَ الْقِيَامَةِ بِأَفْضَلَ مِمَّا جَاءَ بِهِ إِلَّا أَحَدٌ قَالَ مِثْلَ مَا قَالَ أَوْ زَادَ عَلَيْهِ."
  },
  {
    "zekr": "أسْتَغْفِرُ اللهَ وَأتُوبُ إلَيْهِ",
    "repeat": 100,
    "bless": "مائة حسنة، ومُحيت عنه مائة سيئة، وكانت له حرزاً من الشيطان حتى يمسى."
  },
];


var AzkarList=[
  {
    "zkr":"دعاء لبس الثوب",
    "num": "مرة",
    "subtitile":"الحمدُ للهِ الّذي كَساني هذا (الثّوب) وَرَزَقَنيه مِنْ غَـيـْرِ حَولٍ مِنّي وَلا قـوّة. ",
  },
  {
    "zkr":"دعاء لبس الثوب الجديد",
    "num": "مرة",
    "subtitile":"اللهم لك الحمد أنت كسوتنيه، أسألك من خيره ",
  },


  {
    "zkr":"دعاء قضاء الدين",
    "num": "مرة",
    "subtitile":"اللهم اكفنى بحلالك عن حرامك وأغننى بفضلك عمن سواك ",
  },
  {
    "zkr":"دعاء الريح",
    "num": "مرة",
    "subtitile":"اللهم إنى أسألك خيرها، وخير ما فيها، وخير ما أرسلت به، وأعوذ بك من شرها، وشر ما فيها وشر ما أرسلت به. ",
  },
  {
    "zkr":"دعاء الرعـد",
    "num": "مرة",
    "subtitile":"سبحان الله الذي يسبح الرعد بحمده والملائكة من خيفته ",
  },
  {
    "zkr":"دعاء زيارة القبور",
    "num": "مرة",
    "subtitile":"السلام عليكم أهل الديار من المؤمنين والمسلمين، وإنا إن شاء الله بكم لاحقون ويرحم الله المستقدمين منا والمستأخرين، أسأل الله لنا ولكم العافية. ",
  },
  {
    "zkr":"دعاء نزول االمطر",
    "num": "مرة",
    "subtitile":"اللهم صيباَ نافعاَ ",
  },

  {
    "zkr":"دعاء السفر",
    "num": "مرة",
    "subtitile":"اللهم إنا نسألك في سفرنا هذا البر والتقوى، ومن العمل ماترضى ، اللهم هون علينا سفرنا هـذا واطوِ عنا بعده، اللهم أنت الصاحب في السفر، والخليفة في الأهل، اللهم إني أعوذ بك من وعثاء السفر وكآبة المنظر وسوء المنقلب في المال والأهل.",
  },
  {
    "zkr":"دعاء المسافر للمقيم",
    "num": "مرة",
    "subtitile":"استودعكم الله الذي لا تضيع ودائعه ",
  },
  {
    "zkr":"دعاء المقيم للمسافر",
    "num": "مرة",
    "subtitile":"أستودع ُ الله دينك وأمانتك ، وخواتيم عملك زودك الله التقوى، وغفر ذنبك، ويسر لك الخير حيث ما كنت ",
  },
  {
    "zkr":"دعـــاء النـــزول في مكــان",
    "num": "مرة",
    "subtitile":"أعوذ بكلمات الله التامات من شر ما خلق ",
  },
  {
    "zkr":"الدعاء بين السجدتين",
    "num": "مرة",
    "subtitile":"رب اغفر لي رب اغفر لي اللهم اغفر لي ، وارحمني واهدني واجبرني وعافني وارزقني وارفعني ",
  },
  {
    "zkr":"دعـاء من استصعب عليه أمر",
    "num": "مرة",
    "subtitile":"اللهم لاسهل إلا ماجعلته سهلا وأنت تجعل الحزن إذا شئت سهلا ",
  },
  {
    "zkr":"دعـاء الخوف من الشــرك",
    "num": "مرة",
    "subtitile":"اللهم إني أ عوذ بك أن أشرك بك وأنا أعلم ، وأستغفرك لما لا أعلم ",
  },
  {
    "zkr":"ما يقال في المجلس",
    "num": "100 مرة",
    "subtitile":"رب اغفر لي وتب عليّ إنك أنت التواب الغفور \n (100 مرة قبل أن يقوم) ",
  },
  {
    "zkr":"كفارة المجلس",
    "num": "مرة",
    "subtitile":"سبحانك اللهم وبحمدك ، أشهد أن لا إله إلا أنت أستغفرك وأتوب إليك ",
  },
  {
    "zkr":"دعاء من رأى مبتلى",
    "num": "مرة",
    "subtitile":"الحمد لله الذي عافاني مما ابتلا به وفضلني على كثير ممن خلق تفضيلاً ",
  },
  {
    "zkr":"دعـاء الغـضـب",
    "num": "مرة",
    "subtitile":"أعوذ بالله من الشيطان الرجيـم ",
  },
  {
    "zkr":"الدعاء للمتزوج",
    "num": "مرة",
    "subtitile":"بارك الله لك ، وبارك عليك ، وجمع بينكما في خير ",
  },
  {
    "zkr":"دعاء المتزوج لنفسه",
    "num": "مرة",
    "subtitile":"اللهم إني أسألك خيرها وخير ماجبلتها عليه وأعوذ بك من شرها وشر ماجبلتها عليه ، وإذا اشترى بعيراً فليأخذ بذروة سنامه وليقل مثل ذلك ",
  },
  {
    "zkr":"الدعاء قبل الجماع",
    "num": "مرة",
    "subtitile":"بسم الله ـ اللهم جنبنا الشيطان، وجنب الشيطان مارزقتنا ",
  },
  {
    "zkr":"دعاء العطاس",
    "num": "مرة",
    "subtitile":"إذا عطـس أحـدكم فليقل : الحمـد لله ، وليقل له أخـوه ، أو صاحبه : يرحمـك الله فـإذا قال له : يرحمك الله ، فليقل : يهديكم الله ويصلح بالكم. ",
  },
  {
    "zkr":"الدعاء عند افطار الصائم",
    "num": "مرة",
    "subtitile":"ذهب الضمـأ ، وأبتلت العروق ، وثبت الأجر إن شاء الله ",
  },
  {
    "zkr":"الدعاء إذا أفطر عند أهل بيت",
    "num": "مرة",
    "subtitile":"أفطر عندكم الصائمون ، وأكل طعامكم الأبرار ، وصلت عليكم الملائكة ",
  },
  {
    "zkr":"دعاء رؤية الهلال",
    "num": "مرة",
    "subtitile":"الله أكبر ، اللهم أهله علينا بالأمن ، والإيمان والسلامة ، والإسلام ، والتوفيق لما تحب وترضى ربنا وربك الله. ",
  },
  {
    "zkr":"دعاء من أصيب بمصيبة",
    "num": "مرة",
    "subtitile":"إنا لله وإنا إليه راجعون اللهم أجرني في مصيبتي واخلف لي خيرا منها ",
  },
  {
    "zkr":"الدعاء للمريض في عيادته",
    "num": "مرة",
    "subtitile":"لابأس طهور إن شاء الله مامن عبد مسلم يعود مريضاً لم يحضر أجله فيقول سبع مرات : أسأل الله العظيم رب العرش العظيم أن يشفيك إلا عوفي. ",
  },
  {
    "zkr":"دعاء المريض الذي يئس من حياته",
    "num": "مرة",
    "subtitile":"اللهم اغفر لي وارحمني والحقني بالرفيق الأعلى ",
  },
  {
    "zkr":"ما يعوذ به الأولاد",
    "num": "مرة",
    "subtitile":"أعيذكما بكلمات الله التامة من كل شيطان وهامة ، ومن كل عين لامة ",
  },
  {
    "zkr":"دعاء لقاء العدو وذي السلطان",
    "num": "مرة",
    "subtitile":"حسـبنا الله ونعـم الـوكـيل \n اللهم إنا نجعلك في نحورهم ونعوذ بك من شرورهم \n اللهم أنت عضدي ، وأنت نصيري ، بك أجول وبك أصول وبك أقاتل",
  },

  {
    "zkr":"دعـاء سجود التلاوة",
    "num": "مرة",
    "subtitile":"سجد وجهي للذي خلقه ،وشق سمعه وبصره بحوله وقوته ( فتبارك الله احسن الخالقين ) ",
  },
  {
    "zkr":"دعـــــاء الاستفــتــــاح",
    "num": "مرة",
    "subtitile":"اللهم باعد بيني وبين خطاياي كما باعدت بين المشرق والغرب ، اللهم نقني من خطاياي كما ينقى الثوب الأبيض من الدنس، اللهم اغسلني من خطاياي بالثلج والماء والبرد. \n سبحانك اللهم وبحمدك وتبارك اسمك وتعالى جدُّك ولاإله غيرك.",
  },
  {
    "zkr":"دعاء دخول السوق",
    "num": "مرة",
    "subtitile":"لا إله إلا الله وحده لا شريك له، له الملك وله الحمد يحيي ويميت وهو حي لا يموت بيده الخير وهو على كل شيء قدير (كتب الله له ألف ألف حسنة ومحا عنه ألف ألف سيئة ورفع له ألف الف درجة وفي رواية: وبنى له بيتا في الجنة).",
  },
  {
    "zkr":"عنــــد فعــــل الذنب أو ارتكاب المعصية",
    "num": "مرة",
    "subtitile":"عنــــد فعــــل الذنب أو ارتكاب المعصية",
  },

  {
    "zkr":"سيد الاستغفار",
    "num": "مرة",
    "subtitile":"اللهم أنت ربي لا إله إلا أنت ، خلقتني وأنا عبدك وأنا على عهدك ووعدك ما استطعت أعوذ بك من شر ما صنعت، أبوئ لك بنعمتك على وأبوئ بذنبي ، فاغفر لي فانه لا يغفر الذنوب إلا أنت.",
  },
  {
    "zkr":"الدعـــاء إذا أحسست بوجع في جسدك",
    "num": "مرة",
    "subtitile":"ضع يدك على الذي تألَّم من جسدك وقل: بسم الله ،ثلاثاً ،وقل سبع مرات: أعوذُ بالله وقُدْرَتِهِ من شَرِّ مَا أَجِدُ واُحَاذِرُ. ",
  },
  {
    "zkr":"مايقول ويفعل من أذنب ذنباً",
    "num": "مرة",
    "subtitile":"مامن عبد يذنب ذنباً فيحسـن الطهور ثم يقوم فيصلي ركعتين ، ثم يستغــفــر الله إلا غفر له ",
  },
];
var TasabyhList=[
  {
    "tasbyh":"سُبْحَانَ اللَّهِ",
    "num":"100 مرة",
    "subtitile":"يكتب له ألف حسنة أو يحط عنه ألف خطيئة.",
  },
  {
    "tasbyh":"سُبْحَانَ اللَّهِ وَبِحَمْدِهِ ",
    "num":"100 مرة",
    "subtitile":"حُطَّتْ خَطَايَاهُ وَإِنْ كَانَتْ مِثْلَ زَبَدِ الْبَحْرِ. لَمْ يَأْتِ أَحَدٌ يَوْمَ الْقِيَامَةِ بِأَفْضَلَ مِمَّا جَاءَ بِهِ إِلَّا أَحَدٌ قَالَ مِثْلَ مَا قَالَ أَوْ زَادَ عَلَيْهِ.",
  },
  {
    "tasbyh":"سُبْحَانَ اللَّهِ وَالْحَمْدُ لِلَّهِ ",
    "num":"100 مرة",
    "subtitile":"تَمْلَآَنِ مَا بَيْنَ السَّمَاوَاتِ وَالْأَرْضِ.",
  },
  {
    "tasbyh":"سُبْحَانَ اللهِ العَظِيمِ وَبِحَمْدِهِ ",
    "num":"100 مرة",
    "subtitile":"غرست له نخلة في الجنة (أى عدد).",
  },
  {
    "tasbyh":"سُبْحَانَ اللَّهِ وَبِحَمْدِهِ ، سُبْحَانَ اللَّهِ الْعَظِيمِ ",
    "num":"100 مرة",
    "subtitile":"ثقيلتان في الميزان حبيبتان إلى الرحمن (أى عدد).",
  },
  {
    "tasbyh":"لَا إلَه إلّا اللهُ وَحْدَهُ لَا شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلُّ شَيْءِ قَدِيرِ. ",
    "num":"100 مرة",
    "subtitile":"كانت له عدل عشر رقاب، وكتبت له مئة حسنة، ومحيت عنه مئة سيئة، وكانت له حرزا من الشيطان.",
  },
  {
    "tasbyh":"لا حَوْلَ وَلا قُوَّةَ إِلا بِاللَّهِ ",
    "num":"100 مرة",
    "subtitile":"كنز من كنوز الجنة (أى عدد).",
  },
  {
    "tasbyh":"الْحَمْدُ للّهِ رَبِّ الْعَالَمِينَ ",
    "num":"100 مرة",
    "subtitile":"تملأ ميزان العبد بالحسنات.",
  },
  {
    "tasbyh":"الْلَّهُم صَلِّ وَسَلِم وَبَارِك عَلَى سَيِّدِنَا مُحَمَّد ",
    "num":"100 مرة",
    "subtitile":"من صلى على حين يصبح وحين يمسى ادركته شفاعتى يوم القيامة.",
  },
  {
    "tasbyh":"أستغفر الله ",
    "num":"100 مرة",
    "subtitile":"لفعل الرسول صلى الله عليه وسلم.",
  },
  {
    "tasbyh":"سُبْحَانَ الْلَّهِ، وَالْحَمْدُ لِلَّهِ، وَلَا إِلَهَ إِلَّا الْلَّهُ، وَالْلَّهُ أَكْبَرُ ",
    "num":"100 مرة",
    "subtitile":"أنهن أحب الكلام الى الله، ومكفرات للذنوب، وغرس الجنة، وجنة لقائلهن من النار، وأحب الى النبي ﷺ مما طلعت عليه الشمس، والْبَاقِيَاتُ الْصَّالِحَات.",
  },
  {
    "tasbyh":"لَا إِلَهَ إِلَّا اللَّهُ ",
    "num":"100 مرة",
    "subtitile":"أفضل الذكر لا إله إلاّ الله.",
  },
  {
    "tasbyh":"الْلَّهُ أَكْبَرُ ",
    "num":"100 مرة",
    "subtitile":"من قال الله أكبر كتبت له عشرون حسنة وحطت عنه عشرون سيئة. الله أكبر من كل شيء.",
  },
  {
    "tasbyh":"سُبْحَانَ اللَّهِ ، وَالْحَمْدُ لِلَّهِ ، وَلا إِلَهَ إِلا اللَّهُ ، وَاللَّهُ أَكْبَرُ ، اللَّهُمَّ اغْفِرْ لِي ، اللَّهُمَّ ارْحَمْنِي ، اللَّهُمَّ ارْزُقْنِي. ",
    "num":"100 مرة",
    "subtitile":"خير الدنيا والآخرة ",
  },
  {
    "tasbyh":"الْحَمْدُ لِلَّهِ حَمْدًا كَثِيرًا طَيِّبًا مُبَارَكًا فِيهِ. ",
    "num":"100 مرة",
    "subtitile":"قَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ‏‏لَقَدْ رَأَيْتُ اثْنَيْ عَشَرَ مَلَكًا يَبْتَدِرُونَهَا، أَيُّهُمْ يَرْفَعُهَا‏.",
  },
  {
    "tasbyh":"اللَّهُ أَكْبَرُ كَبِيرًا ، وَالْحَمْدُ لِلَّهِ كَثِيرًا ، وَسُبْحَانَ اللَّهِ بُكْرَةً وَأَصِيلاً. ",
    "num":"100 مرة",
    "subtitile":"قَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَجِبْتُ لَهَا ، فُتِحَتْ لَهَا أَبْوَابُ السَّمَاءِ.",
  },
  {
    "tasbyh":"اللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ وَعَلَى آلِ مُحَمَّدٍ كَمَا صَلَّيْتَ عَلَى إِبْرَاهِيمَ , وَعَلَى آلِ إِبْرَاهِيمَ إِنَّكَ حَمِيدٌ مَجِيدٌ ",
    "num":"100 مرة",
    "subtitile":"في كل مره تحط عنه عشر خطايا ويرفع له عشر درجات ويصلي الله عليه عشرا وتعرض على الرسول ﷺ .",
  },
  {
    "tasbyh":"اللَّهُمَّ بَارِكْ عَلَى مُحَمَّدٍ وَعَلَى آلِ مُحَمَّدٍ كَمَا بَارَكْتَ عَلَى إِبْرَاهِيمَ وَعَلَى آلِ إِبْرَاهِيمَ إِنَّكَ حَمِيدٌ مَجِيدٌ. ",
    "num":"100 مرة",
    "subtitile":"في كل مره تحط عنه عشر خطايا ويرفع له عشر درجات ويصلي الله عليه عشرا وتعرض على الرسول ﷺ .",
  },
];

var AhadesList=[
  {
    "hokm" :"باب حكم الزكاة",
    "color": Colors.deepPurpleAccent.withOpacity(0.7),
    "hades1":"عن ابن عمر رضي الله عنهما، قال: قال رسول الله صلى الله عليه وسلم: (بني الإسلام على خمس: شهادة أن لا إله إلا الله، وأن محمداً عبده ورسوله، وإقام الصلاة، وإيتاء الزكاة، وحج البيت، وصوم رمضان) [رواه البخاري].",
    "hades2":"عن أبي الدرداء رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: (خمس من جاء بهن مع إيمان دخل الجنة: من حافظ على الصلوات الخمس، على وضوئهن وركوعهن وسجودهن ومواقيتهن، وصام رمضان، وحج البيت إن استطاع إليه سبيلاً، وأعطى الزكاة طيبة بها نفسه) الحديث. [رواه الطبراني في الكبير بإسناد جيد].",
    "hades3":"عن عبد الله بن مسعود رضي الله عنه عن رسول الله صلى الله عليه وسلم قال: (ما من أحد لا يؤدي زكاة ماله إلا مثل له يوم القيامة شجاعاً أقرع حتى يطوَّق به عنقه) ثم قرأ علينا النبي صلى الله عليه وسلم مصداقه من كتاب الله {وَلا يَحْسَبَنَّ الَّذِينَ يَبْخَلُونَ بِمَا آتَاهُمُ اللَّهُ مِنْ فَضْلِهِ هُوَ خَيْراً لَهُمْ بَلْ هُوَ شَرٌّ لَهُمْ سَيُطَوَّقُونَ مَا بَخِلُوا بِهِ يَوْمَ الْقِيَامَةِ} [آل عمران:180]  رواه ابن ماجه واللفظ له والنسائي بإسناد صحيح وابن خزيمة في صحيحه.",
    "hades4":"عن علي رضي الله عنه قال: (لعن رسول الله صلى الله عليه وسلم آكل الربا، وموكله، وشاهده، وكاتبه، والواشمة، والمستوشمة، ومانع الصدقة، والمحلل والمحلل له). صحيح الترغيب والترهيب.",
  },
  {
    "hokm" :"باب وجوب الصيام",
    "color": Colors.deepPurple.withOpacity(0.7),
    "hades1": "عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: (من صام رمضان إيماناً واحتساباً، غُفر له ما تقدم من ذنبه) رواه الشيخان.",
    "hades2": "عن أبي أيوب الأنصاري رضي الله عنه أن رسول الله صلى الله عليه وسلم قال: (من صام رمضان ثم أتبعه ستاً من شوال، كان كصيام الدهر) رواه مسلم.",
    "hades3": "عن حذيفة بن اليمان رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: (فتنة الرجل في أهله وماله وولده وجاره، تكّفرها الصلاة، والصوم، والصدقة، والأمر والنهي) متفق عليه.",
    "hades4": "عن أبي هريرة رضي الله عنه أن رسول الله صلى الله عليه وسلم قال: (قال الله عزوجل: كل عمل بن آدم له إلا الصيام؛ فإنه لي وأنا أجزي به، والصيام جنّة، وإذا كان يوم صوم أحدكم فلا يرفث، ولا يصخب، فإن سابّه أحد أو قاتله فليقل: إني امرؤ صائم، والذي نفس محمد بيده لخلوف فم الصائم أطيب عند الله من ريح المسك، للصائم فرحتان يفرحهما: إذا أفطر فرح، وإذا لقي ربه فرح بصومه) رواه البخاري ومسلم.",

  },
  {
    "hokm" :"باب وجوب الفضل",
    "color": Color(0xff453658),
    "hades1":"جاء من حديث عبد الله بن عمرو بن العاص رضي الله عنهما أنه سمع النبي - صلى الله عليه وسلم -يقول إذا سمعتم المؤذن فقولوا مثل ما يقول ثم صلوا علي فإنه من صلى علي صلاة صلى الله عليه بها عشرا ثم سلوا الله لي الوسيلة فإنها منزلة في الجنة لا تنبغي إلا لعبد من عباد الله وأرجو أن أكون أنا هو فمن سأل لي الوسيلة حلت له الشفاعة رواه مسلم (384).",
    "hades2":"جاء من حديث أنس بن مالك رضي الله عنه قال قال رسول الله - صلى الله عليه وسلم -من صلى علي صلاة واحدة صلى الله عليه عشر صلوات وحطت عنه عشر خطيئات ورفعت له عشر درجات. \n♦ رواه الإمام أحمد (11587) والنسائي (1297) - واللفظ له - بإسناد حسن.",
    "hades3":"روى مسلم والترمذي وأبو داود وغيرهم عن عبد الله بن عمرو بن العاص رضي الله عنهما في حديث متابعة المؤذن قوله صلى الله عليه وسلم: ثم صلوا علي، فإنه من صلى علي صلاة صلى الله عليه بها عشرا.",
    "hades4":"ذكره صاحب الكنز وعزاه لأبي الشيخ، كما ذكرت، وذكره ابن القيم في جلاء الأفهام في الصلاة على خير الأنام صلى الله عليه وسلم بلفظ: من صلى علي في يوم ألف مرة لم يمت حتى يرى مقعده في الجنة.",

  },
  {
    "color": Colors.indigo.withOpacity(0.7),
    "hokm" :"باب امر الصائم",
    "hades1":"عن أبي هريرة رضي الله عنه عن النبي صلى الله عليه وسلم قال: (من قام ليلة القدر إيماناً واحتساباً، غُفر له ما تقدم من ذنبه) متفق عليه.",
    "hades2":"عن أبي هريرة رضي الله عنه أن رسول الله صلى الله عليه وسلم قال: (إذا جاء رمضان فُتّحت أبواب الجنة، وغُلّقت أبواب النار، وصُفّدت الشياطين) رواه مسلم.",
    "hades3":"عن سهل بن سعد رضي الله عنه أن النبي صلى الله عليه وسلم قال: (في الجنّة ثمانية أبواب، فيها باب يُسمى الريّان، لا يدخله إلا الصائمون) رواه البخاري، وزاد النسائي: (فإذا دخل آخرهم أُغلق، من دخل فيه شرب، ومن شرب لم يظمأ أبداً).",
    "hades4":"عن علي بن أبي طالب رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: (إن في الجنة غرفاً تُرى ظهورها من بطونها، وبطونها من ظهورها)، فقام أعرابي فقال: لمن هي يا رسول الله؟ قال: (لمن أطاب الكلام، وأطعم الطعام، وأدام الصيام، وصلى لله بالليل والناس نيام) رواه الترمذي.",


  },
  {
    "color": Colors.deepPurpleAccent.withOpacity(0.7),
    "hokm" :"باب في مسائل في الصوم",
    "hades1":"رواه البخاري في (الصوم) باب قول النبي:  إذا رأيتم الهلال فصوموا  برقم 1907، ومسلم في (الصيام) باب وجوب صوم رمضان لرؤية الهلال برقم 1080. ",
    "hades2":"رواه البخاري في (الصوم) باب قول النبي صلى الله عليه وسلم: لا نكتب ولا نحسب برقم 1913، ومسلم في (الصيام) باب وجوب صوم رمضان لرؤية الهلال برقم 1080.",
    "hades3":"",
    "hades4":"",



  },
  {
    "color": Colors.deepPurple.withOpacity(0.7),
    "hokm" :"باب بيان فضل الاشهر الحرم",
    "hades1":"روى البخاري ومسلم في صحيحيهما من حديث أبي بكرة رضي الله عنه أن النبي صلى الله عليه وسلم قال: إِنَّ الزَّمَانَ قَدِ اسْتَدَارَ كَهَيْئَتِهِ يَوْمَ خَلَقَ اللَّهُ السَّمَاوَاتِ وَالأَرْضَ، السَّنَةُ اثْنَا عَشَرَ شَهْرًا، مِنْهَا أَرْبَعَةٌ حُرُمٌ، ثَلَاثَةٌ مُتَوَالِيَاتٌ: ذُو الْقَعْدَةِ، وَذُو الْحِجَّةِ، وَالْمُحَرَّمُ، وَرَجَبٌ شَهْرُ مُضَرَ الَّذِي بَيْنَ جُمَادَى وَشَعْبَانَ[1].",
    "hades2":"",
    "hades3":"",
    "hades4":"",


  },
  {
    "color": Color(0xff453658),
    "hokm" :"باب فضل صوم العشر الاوائل من ذي الحجه",
    "hades1":"قال رسول الله -صلى الله عليه وسلم- في فضل العمل في العشر الأوائل:“ما العَمَلُ في أيَّامٍ أفْضَلَ منها في هذِه؟ قالوا: ولَا الجِهَادُ؟ قَالَ: ولَا الجِهَادُ، إلَّا رَجُلٌ خَرَجَ يُخَاطِرُ بنَفْسِهِ ومَالِهِ، فَلَمْ يَرْجِعْ بشيءٍ“.",
    "hades2":"وعن رسول الله -صلى الله عليه وسلم- قال:“ما من أيامٍ أعظمُ عندَ اللهِ ولا أحبَّ إليه العملُ فيهنَّ من هذهِ الأيامِ العشرِ فأكثروا فِيهنَّ من التهليلِ والتكبيرِ والتحميدِ“.",
    "hades3":"عن ابن عباس رضي الله عنهما قال: قال رسول الله صلى الله عليه وسلم“ما من أيام، العمل الصالح فيها أحب إلى الله، من هذه الأيام، يعني أيام العشر.قالوا: يا رسول الله، ولا الجهاد في سبيل الله؟ قال: ولا الجهاد في سبيل الله،إلا رجل خرج بنفسه، وماله، فلم يرجع من ذلك بشيء”",
    "hades4":"وعن أنس بن مالك قال: “كان يقال في أيام العشر: بكل يوم ألف يوم ويوم عرفة بعشرة آلاف يوم”يعني في الفضل. رواه البيهقي والأصبهاني.",


  },
  {
    "color": Colors.indigo.withOpacity(0.7),
    "hokm" :"باب فضل صوم عرفه و عاشوراء",
    "hades1":"حديث عروة عن عائشة رضي الله عنها أن قريشا كانت تصوم عاشوراء في الجاهلية ثم أمر رسول الله صلى الله عليه وسلم بصيامه حتى فرض رمضان فقال رسول الله صلى الله عليه وسلم :  من شاء فليصمه ومن شاء فليفطره",
    "hades2":"ديث ابن عمر رضي الله عنه أن النبي صلى الله عليه وسلم قال في عاشوراء :  من شاء صام ومن لم يشأ لم يصمه ",
    "hades3":"حديث الزهري عن حميد بن عبدالرحمن أنه سمع معاوية رضي الله عنهما عام حجّ على المنبر يقول : ( يا أهل المدينة أين علماؤكم ؟ سمعت رسول الله صلى الله عليه وسلم يقول:  هذا يوم عاشوراء ولم يكتب الله عليكم صيامه وأنا صائم فمن شاء فليصم ومن شاء فليفطر)",
    "hades4":"حديث سعيد بن جبير عن ابن عباس رضي الله عنهما قال : قدم النبي صلى الله عليه وسلم المدينة فرأى اليهود تصوم يوم عاشوراء فقال :  ما هذا ؟  قالوا : هذا يوم صالح نجى الله فيه بني إسرائيل من عدوهم فصامه موسى قال :  فأنا أحق بموسى منكم  فصامه وأمر بصيامه.",


  },
  {
    "color": Colors.deepPurpleAccent.withOpacity(0.7),
    "hokm" :"باب استحباب صوم سته ايام من شوال",
    "hades1":"فعن أبي أيوب الأنصاري رضي الله عنه وأرضاه عن النبي صلى الله عليه وسلم قال: «مَنْ صامَ رمضانَ ثُمَّ أَتْبَعَهُ ستًّا مِنْ شوَّالٍ كانَ كصيامِ الدَّهْرِ» (رواه مسلم؛ برقم: [1164]، وأحمد، وأبو داود، والترمذي).",
    "hades2":"",
    "hades3":"",
    "hades4":"",


  },
  {
    "color": Colors.deepPurple.withOpacity(0.7),
    "hokm" :"باب صوم الاتنين والخميس",
    "hades1":"عن عائشة ـ رضي الله عنها ـ أن النبي صلى الله عليه وسلم كان يتحرى صيام الإثنين والخميس، حديث صحيح: رواه ابن ماجة والترمذي والنسائي.",
    "hades2":"قول رسول الله صلى الله عليه وسلم: من صام يومًا في سبيل الله؛ باعد الله منه جهنم مسيرة مائة عام، السلسلة الصحيحة (6 / 2565)",
    "hades3":"يقول رسول الله صلى الله عليه وسلم : من صام يومًا في سبيل الله ؛ جعل الله بينه وبين النار خندقًا كما بين السماء والأرض، حسن: السلسلة الصحيحة ( 2 / 563 )",
    "hades4":"يقول رسول الله صلى الله عليه وسلم : الصيام والقرآن يشفعان للعبد يوم القيامة، يقول الصيام: أي رب منعته الطعام والشهوة؛ فشفعني فيه، ويقول القرآن: منعته النوم بالليل، فشفعني فيه، قال: فيشفعان، إسناده صحيح: رواه أحمد ( 2/174 )",


  },
  {
    "color": Color(0xff453658),
    "hokm" :"باب استحياب صوم ثلاثة ايام من كل شهر",
    "hades1":"وعنْ أَبي ذَرٍّ ، قَالَ: قالَ رسولُ اللَّهِ ﷺ: إِذا صُمْتَ مِنَ الشَّهْرِ ثَلاثًا، فَصُمْ ثَلاثَ عَشْرَةَ، وَأَرْبعَ عَشْرَةَ، وخَمْسَ عَشْرَةَ  رواه الترمِذيُّ",
    "hades2":"قال: حديثٌ حسنٌ.6/1263-وعنْ قتادَةَ بن مِلحَانَ ، قَالَ: كانَ رَسولُ اللَّهِ ﷺ يأْمُرُنَا بِصِيَامِ أَيَّامِ البيضِ: ثَلاثَ عشْرَةَ، وأَرْبَعَ عَشْرَةَ، وَخَمْسَ عَشْرَةَ. رواهُ أَبُو داودَ.",
    "hades3":"وعنْ ابنِ عبَّاسٍ رَضِيَ اللَّه عَنْهُمَا، قال: كانَ رسولُ اللَّهِ ﷺ لاَ يُفْطِرُ أَيَّامَ البِيضِ في حَضَرٍ وَلا سَفَرٍ. رواهُ النسَائي بإِسنادٍ حَسنٍ.",
    "hades4":"وعنْ مُعاذةَ العَدَوِيَّةِ أَنَّها سَأَلَتْ عائشةَ رضيَ اللَّه عَنْهَا: أَكانَ رَسُولُ اللَّهِ ﷺ يصومُ مِن كُلِّ شَهرٍ ثلاثةَ أَيَّامٍ؟ قَالَت: نَعَمْ. فَقُلْتُ: منْ أَيِّ الشَّهْر كَانَ يَصُومُ؟ قَالَتْ: لَمْ يَكُن يُبَالي مِنْ أَيِّ الشَّهْرِ يَصُومُ. رواهُ مسلمٌ.",


  },
  {
    "color": Colors.indigo.withOpacity(0.7),
    "hokm" :"باب فضل من افطر صائما",
    "hades1":"عنْ زَيدِ بنِ خالدٍ الجُهَنيِّ  عَن النَّبِيِّ ﷺ قالَ: مَنْ فَطَّرَ صَائمًا، كانَ لَهُ مِثْلُ أَجْرِهِ غَيْرَ أَنَّهُ لاَ يَنْقُصُ مِنْ أجْر الصَّائمِ شيءٍ.رواه الترمذي ",
    "hades2":"قالَ: حديثٌ حسنٌ صحيحٌ.2/1266- وعَنْ أُمِّ عمَارَةَ الأَنْصارِيَّةِ رَضِيَ اللَّه عَنْها، أَنَّ النبيَّ ﷺ دخَلَ عَلَيْها، فقدَّمَتْ إِلَيْهِ طَعَامًا، فَقالَ: كُلِي فَقالَت: إِنِّي صائمةٌ، فقالَ رسولُ اللَّهِ ﷺ: إِنَّ الصَّائمَ تُصلِّي عَلَيْهِ المَلائِكَةُ إِذا أُكِلَ عِنْدَهُ حتَّى يَفْرَغُوا وَرُبَّما قَالَ:حَتَّى يَشْبَعُوا رواهُ الترمذيُّ،",
    "hades3":" وعَنْ أَنسٍ ، أَنَّ النبيَّ ﷺ جَاءَ إِلى سَعْدِ بْنِ عُبَادَةَ ، فَجَاءَ بِخُبْزٍ وَزَيْتٍ، فَأَكَلَ، ثُمَّ قالَ النبيُّ ﷺ: أَفْطَرَ عِندكُمْ الصَّائمونَ، وأَكَلَ طَعَامَكُمْ الأَبْرَارُ وَصَلَّتْ عَلَيْكُمُ المَلائِكَةُ.رواهُ أَبُو داود بإِسنادٍ صحيحٍ.",
    "hades4":"",


  },
  {
    "color": Colors.deepPurpleAccent.withOpacity(0.7),
    "hokm" :"باب وجوب الحج وفضله",
    "hades1":"عن أبي هريرة رضي الله عنه قال: (سُئِلَ النبيُّ صلَّى اللهُ عليه وسلَّم: أيُّ الأعمالِ أفضلُ؟ قال: إيمانٌ باللهِ ورسولِه. قِيلَ: ثم ماذا؟ قال جهادٌ في سبيلِ اللهِ. قِيلَ: ثم ماذا؟ قال: حجٌّ مَبرورٌ)",
    "hades2":"ن أبي هُريرة رضي الله عنه، قال: سَمعتُ النبيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يقولُ: (مَن حجَّ للهِ، فلم يَرفُث، ولم يَفسُقْ، رجَع كيوم ولدَته أمُّه)",
    "hades3":"قَالَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: (جِهادُ الكبيرِ، والصَّغيرِ والضَّعيفِ والمرأةِ: الحجُّ والعُمرةُ).[",
    "hades4":"عَنْ أم المؤمنين عائشة رضي الله عنها قالت: (يا رسولَ اللهِ، نرى الجهادَ أفضلَ العملِ، أفلا نجاهِدُ؟ قال: لا، لكنَّ أفضلَ الجهادِ حجٌّ مبرورٌ)",


  },
  {
    "color": Colors.deepPurple.withOpacity(0.7),
    "hokm" :"باب فضل الجهاد",
    "hades1":"عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: تضمن الله لمن خرج في سبيله لا يخرجه إلا جهاداً في سبيلي، وإيماناً بي، وتصديقاً برسلي فهو على ضامن أن أدخله الجنة، أو أرجعه إلى مسكنه الذي خرج منه نائلاً ما نال من أجر أو غنيمة، والذي نفس محمد بيده: ما من كلم يكلم في سبيل الله إلا جاء يوم القيامد كهيئته حين كلم لونه لون الدم، وريحه مسك، والذي نفس محمد بيده لولا أن يشق على المسلمين ما قعدت خلاف سرية تغزو في سبيل الله أبداً، ولكن لا أجد سعة فأحملهم ولا يجدون سعة، ويشق عليهم أن يتخلفوا عني، والذي نفس محمد بيده لوددت أني أغزو في سبيل الله فأقتل، ثم أغزو فأقتل، ثم أغزو فأقتل",
    "hades2":"عن أبي مالك الأشعري رضي الله عنه أن رسول الله صلى الله عليه وسلم: من فصل في سبيل الله فمات أو قتل فهو شهيد، أو وقصه فرسه أو بعيره، أو لدغته هامة، أو مات على فراشه أو بأي حتف شاء الله، فإنه شهيد، وإن له الجنة",
    "hades3":"عن ابن عمر رضي الله عنهما عن النبي صلى الله عليه وسلم فيما يحكيه عن ربه قال: أيما عبد من عبادي خرج مجاهداً في سبيل الله ابتغاء مرضاتي ضمنت له أن أرجعه، إن أرجعته بما أصاب من أجر أو غنيمة، وإن قبضته غفرت له ورحمته",
    "hades4":"وعن عائشة رضي الله عنها قالت: سمعت رسول الله صلى الله عليه وسلم يقول: ما خالط قلب امرئ رهج في سبيل الله إلا حرم الله عليه النار",


  },
  {
    "color": Color(0xff453658),
    "hokm" :"باب اتيان الصلاة بالسكينه و الوقار",
    "hades1":"عَنْ أَبِي رَافِعٍ قَالَ: كَانَ رَسُولُ اللَّهِ r إِذَا صَلَّى الْعَصْرَ ذَهَبَ إِلَى بَنِي عَبْدِ الْأَشْهَلِ فَيَتَحَدَّثُ عِنْدَهُمْ حَتَّى يَنْحَدِرَ لِلْمَغْرِبِ قَالَ أَبُو رَافِعٍ: فَبَيْنَمَا النَّبِيُّ r يُسْرِعُ إِلَى الْمَغْرِبِ مَرَرْنَا بِالْبَقِيعِ. وذكر الحديث([20]).اعترض عليه: أنه محمولٌ على أنه إسراع خفيف لا يُخِلُّ بالخشوع المطلوب في المشي إلى الصلاة([21])",
    "hades2":"2.    قد ثبت عن بعض أصحاب النبي r أنهم كانوا يسعون إذا خافوا فوت التحريمة، وطمعوا في إدراكها([22]).فعَنْ نَافِعٍ؛ أَنَّ عَبْدَ اللهِ بْنَ عُمَرَ سَمِعَ الْإِقَامَةَ وَهُوَ بِالْبَقِيعِ، فَأَسْرَعَ الْمَشْيَ إِلَى الْمَسْجِدِ([23]).اعترض عليه: إن ابن عُمَرَ لَمْ يَزِدْ عَلَى هَيْئَةِ مِشْيَتِهِ الْمَعْهُودَةِ؛ لَأَنَّهُ كَانَ مِنْ عَادَتِهِ الْإِسْرَاعُ فِي الْمَشْيِ وَيَقُولُ هُوَ أَبْعَدُ مِنَ الزَّهْوِ.ورده ابن عبد البر بقوله: وَهَذَا عِنْدِي خِلَافُ ظَاهِرِ الْحَدِيثِ عَنْهُ؛",
    "hades3":" عَنْ أَبِي هُرَيْرَةَ tعَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ: «إِذَا سَمِعْتُمْ الْإِقَامَةَ فَامْشُوا إِلَى الصَّلَاةِ, وَعَلَيْكُمْ السَّكِينَةُ وَالْوَقَارُ, وَلَا تُسْرِعُوا, فَمَا أَدْرَكْتُمْ فَصَلُّوا, وَمَا فَاتَكُمْ فَأَتِمُّوا»",
    "hades4":" وعن عَبْدَ الْعَزِيزِ بْنِ أَبِي بَكَرَةَ، يُحَدِّثُ أَنَّ أَبَا بَكْرَةَ، جَاءَ وَالنَّبِيُّ صلى الله عليه وسلم رَاكِعٌ، فَسَمِعَ النَّبِيُّ صلى الله عليه وسلم صَوْتَ نَعْلِ أَبِي بَكَرَةَ وَهُوَ يَحْضُرُ، يُرِيدُ أَنْ يُدْرِكَ الرَّكْعَةَ، فَلَمَّا انْصَرَفَ النَّبِيُّ صلى الله عليه وسلم قَالَ: «مَنِ السَّاعِي؟» قَالَ أَبُو بَكَرَةَ: أَنَا، قَالَ: «زَادَكَ اللَّهُ حِرْصًا، وَلَا تَعُدْ»",


  },
  {
    "color": Colors.indigo.withOpacity(0.7),
    "hokm" :"باب فضل العبادة في الهرج",
    "hades1":"رَوى مُسْلمٌ عن مَعْقِلِ بنِ يَسار رضي الله عنه أن رسولَ اللهِ صلَّى الله عليه وسلَّم قال (العِبادَةُ في الهَرْجِ كَهِجْرَةٍ إليَّ).",
    "hades2":"",
    "hades3":"",
    "hades4":"",


  },
  {
    "color": Colors.deepPurpleAccent.withOpacity(0.7),
    "hokm" :"باب الاستخارة",
    "hades1":"عن جابر بن عبد الله رضي الله عنهما قال: كان رسول الله صلى الله عليه وسلم يعلمنا الاستخارة في الأمور كما يعلمنا السورة من القرآن، يقول: (إذا هم أحدكم بالأمر، فليركع ركعتين من غير الفريضة، ثم ليقل: اللهم إني أستخيرك بعلمك، وأستقدرك بقدرتك، وأسألك من فضلك العظيم، فإنك تقدر ولا أقدر، وتعلم ولا أعلم، وأنت علام الغيوب. اللهم إن كنت تعلم أن هذا الأمر خير لي، في ديني ومعاشي وعاقبة أمري، أو قال: عاجل أمري وآجله، فاقدره لي ويسره لي، ثم بارك لي فيه، وإن كنت تعلم أن هذا الأمر شر لي، في ديني ومعاشي وعاقبة أمري، أوقال: في عاجل أمري وآجله، فاصرفه عني واصرفني عنه، واقدر لي الخير حيث كان، ثم أرضني به. قال: ويسمي حاجته).حديث حسن",
    "hades2":"حدثنا أبو محمد بن حيان ، ثنا أبو مسلم نوح بن منصور ، ثنا محمد بن عبد الله بن المبارك المخرمي ، ثنا أسود بن سالم ، ثنا مبارك بن سعيد ، عن سفيان بن سعيد ، عن زبيد ، عن مرة ، عن عبد الله ، في الاستخارة :  اللهم إني أستخيرك بعلمك  . الحديث *إسناد مقبول من أجل نوح بن منصور و هو مقبول",
    "hades3":"",
    "hades4":"",


  },
  {
    "color": Colors.deepPurple.withOpacity(0.7),
    "hokm" :"باب استحباب سجود الشكر",
    "hades1":"رواه  أبو داود في سننه عن النبي صلى الله عليه وسلم قَالَ: (إنِّي سَأَلتُ رَبِّي وَشَفَعتُ لأُمَّتِي، فَأَعطَانِي ثُلُثَ أُمَّتِي فَخَرَرتُ سَاجِدًا شُكرًا لِرَبِّي، ثُمَّ رَفَعتُ رَأسِي فَسَأَلْتُ رَبِّي لأُمَّتِي فَأَعطَانِي ثُلُثَ أُمَّتِي فَخَرَرتُ سَاجِدًا لِرَبِّي شُكرًا، ثُمَّ رَفَعتُ رَأسِي، فَسَأَلتُ رَبِّي لأُمَّتِي فَأَعطَانِي الثُّلُثَ الآخِرَ فَخَرَرتُ سَاجِدًا لِرَبِّي)",
    "hades2":"عن أبِي بكرة، عن النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: أَنَّهُ كَانَ إِذَا جَاءَهُ أَمْرُ سُرُورٍ أَوْ بُشِّرَ بِهِ خَرَّ سَاجِدًا شَاكِرًا لِلَّهِ",
    "hades3":"عن عَبد الرَّحمنِ بنِ كَعبِ بنِ مالكٍ عن أَبِيهِ، قَالَ: لَمَّا تَابَ اللَّهُ عَلَيْهِ خَرَّ سَاجِدًا",
    "hades4":"",


  },
  {
    "color": Color(0xff453658),
    "hokm" :"باب فضل قيام الليل",
    "hades1":"عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: (أفضل الصيام، بعد رمضان، شهر الله المحرم، وأفضل الصلاة، بعد الفريضة، صلاة الليل) [12] . قال النووي: فيه دليل لما اتفق العلماء عليه أن تطوع الليل أفضل من تطوع النهار",
    "hades2":"وعن ابن عمر رضي الله عنهما أنه قال: كان الرجل في حياة النبي صلى الله عليه وسلم إذا رأى رؤيا قصها على رسول الله صلى الله عليه وسلم، فتمنَّيت أن أرى رؤيا فأقصها على رسول الله صلى الله عليه وسلم، وكنت غلاماً شاباً، وكنت أنامُ في المسجد على عهد رسول الله صلى الله عليه وسلم، فرأيت في النوم كأن ملكين أخذاني، فذهبا بي إلى النار، فإذا هي مطوية كطي البئر، وإذا لها قرنان، وإذا فيها أُناسٌ قد عرفتهم، فجعلت أقول: أعوذ بالله من النار، قال: فلقينا ملك آخر فقال لي: لم تُرَع. فقصصتها على حفصة، فقصتها حفصة على رسول الله صلى الله عليه وسلم فقال: (نِعْم الرجل عبد الله لو كان يُصلي من الليل، فكان بعدُ لا ينام من الليل إلا قليل)",
    "hades3":"قال ابن حجر: شاهد الترجمة قوله: (نِعْم الرجل عبد الله لو كان يصلي من الليل) فمقتضاه أن من كان يصلي من الليل يوصف بكونه نعم الرجل[15] . وقال أيضاً: وفي الحديث تنبيه على أن قيام الليل مما يُتقى به النار",
    "hades4":"وعن أبي هريرة رضي الله عنه أن رسول الله صلى الله عليه وسلم قال: (يعقد الشيطان على قافية رأس أحدكم إذا هو نام ثلاث عُقدٍ، يضرب على مكان كل عقدة: عليك ليلٌ طويل فارقد، فإن استيقظ فذكر الله انحلت عقدةٌ، فإن توضأ انحلت عقدة، فإن صلى انحلت عقدةٌ، فأصبح نشيطاً طيب النفس، وإلا أصبح خبيث النفس كسلان)",


  },
  {
    "color": Colors.indigo.withOpacity(0.7),
    "hokm" :"باب الذكر في السجود",
    "hades1":"عن عائشة رضي الله عنها أنها قالت:  كان النبي صلى الله عليه وسلم يكثر أن يقول في ركوعه وسجوده: سبحانك اللهم ربنا وبحمدك اللهم اغفر لي يتأول القرآن",
    "hades2":"وعن محمد بن مسلمة رصي الله عنه: أن رسول الله صلى الله عليه وسلم كان إذا قام يصلي تطوعا يقول إذا ركع: اللهم لك ركعت وبك آمنت ولك أسلمت وعليك توكلت، أنت ربي خشع جميع سمعي وبصري ولحمي ودمي ومخي وعصبي لله رب العالمين. النسائي قال الشيخ الألباني: صحيح",
    "hades3":"وفي صحيح مسلم عن حذيفة رضي الله عنه وذكر صفة صلاة النبي صلى الله عليه وسلم بالليل وذكر ركوعه فقال: ثم ركع فجعل يقول: سبحان ربي العظيم. ثم قال سمع الله لمن حمده ثم قام طويلا قريبا مما ركع ثم سجد فقال سبحان ربي الأعلى فكان سجوده قريبا من قيامه. انتهى. وهو جزء من حديث طويل.",
    "hades4":"وفي مسلم أيضا:عن أبي هريرة :  أن رسول الله صلى الله عليه وسلم كان يقول في سجوده اللهم اغفر لي ذنبي كله دقه وجله وأوله وآخره وعلانيته وسره",


  },
  {
    "color": Colors.deepPurpleAccent.withOpacity(0.7),
    "hokm" :"باب فضل الاحسان الي المملوك",
    "hades1":"عن أبي هريرة - رضي الله عنه - عن النبي - صلى الله عليه وسلم - قال: «إذا أتى أحدكم خادمه بطعامه، فإن لم يجلسه معه، فليناوله لقمة أو لقمتين أو أكلة أو أكلتين؛ فإنه ولي علاجه» . رواه البخاري.",
    "hades2":"عن المعرور بن سويد قال: رأيت أبا ذر - رضي الله عنه -، وعليه حلة وعلى غلامه مثلها، فسألته عن ذلك، فذكر أنه ساب رجلا على عهد رسول الله - صلى الله عليه وسلم - فعيره بأمه، فقال النبي - صلى الله عليه وسلم -: «إنك امرؤ فيك جاهلية هم إخوانكم وخولكم جعلهم الله تحت أيديكم، فمن كان أخوه تحت يده، فليطعمه مما يأكل، وليلبسه مما يلبس، ولا تكلفوهم ما يغلبهم، فإن كلفتموهم فأعينوهم» . متفق عليه.",
    "hades3":"",
    "hades4":"",


  },
  {
    "color": Colors.deepPurple.withOpacity(0.7),
    "hokm" :"باب فضل السماحه في البيع و الشراء",
    "hades1":"يأتي في حديث جمل عمر ، وجمل جابر رضي الله عنهما ، أو يُوكل ذلك إلى أحدٍ من أصحابه ، كما في عُرْوَةَ بْنِ أَبِي الْجَعْدِ الْبَارِقِيِّ قَالَ : أَعْطَاهُ النَّبِيُّ صلى الله عليه وسلم دِينَاراً يَشْتَرِي بِهِ أُضْحِيَةً - أَوْ شَاةً - فَاشْتَرَى شَاتَيْنِ ، فَبَاعَ إِحْدَاهُمَا بِدِينَارٍ ، فَأَتَاهُ بِشَاةٍ وَدِينَارٍ ، فَدَعَا لَهُ بِالْبَرَكَةِ فِي بَيْعِهِ ، فَكَانَ لَوِ اشْتَرَى تُرَابًا لَرَبِحَ فِيهِ .رواه الترمذي( 1258 ) وأبو داود ( 3384 ) وابن ماجه ( 2402 ) ، وصححه الألباني في  صحيح الترمذي ",
    "hades2":"عن حَكِيمِ بْنِ حِزَامٍ رَضِيَ اللَّهُ عَنْهُ قَالَ : قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ : ( الْبَيِّعَانِ بِالْخِيَارِ مَا لَمْ يَتَفَرَّقَا ، فَإِنْ صَدَقَا وَبَيَّنَا بُورِكَ لَهُمَا فِي بَيْعِهِمَا ، وَإِنْ كَتَمَا وَكَذَبَا مُحِقَتْ بَرَكَةُ بَيْعِهِمَا ) .رواه البخاري ( 1973 ) ومسلم ( 1532 ) .",
    "hades3":"عَنْ إِسْمَاعِيلَ بْنِ عُبَيْدِ بْنِ رِفَاعَةَ عَنْ أَبِيهِ عَنْ جَدِّهِ أَنَّهُ خَرَجَ مَعَ النَّبِيِّ صلى الله عليه وسلم إِلَى الْمُصَلَّى ، فَرَأَى النَّاسَ يَتَبَايَعُونَ فَقَالَ : ( يَا مَعْشَرَ التُّجَّارِ ) ، فَاسْتَجَابُوا لِرَسُولِ اللَّهِ صلى الله عليه وسلم وَرَفَعُوا أَعْنَاقَهُمْ وَأَبْصَارَهُمْ إِلَيْهِ فَقَالَ : ( إِنَّ التُّجَّارَ يُبْعَثُونَ يَوْمَ الْقِيَامَةِ فُجَّاراً ، إِلاَّ مَنِ اتَّقَى اللَّهَ وَبَرَّ وَصَدَقَ ) .رواه الترمذي ( 1210 ) وابن ماجه ( 2146 ) ، وصححه الألباني في  صحيح الترغيب  ( 1785 ) .",
    "hades4":"وعَنْ قَيْسِ بْنِ أَبِي غَرَزَةَ قال : كان صلى الله عليه وسلم  يقول : ( يَا مَعْشَرَ التُّجَّارِ إِنَّ الْبَيْعَ يَحْضُرُهُ اللَّغْوُ وَالْحَلِفُ ، فَشُوبُوهُ بِالصَّدَقَةِ )",


  },
  {
    "color": Color(0xff453658),
    "hokm" :"باب فضل الاسلام والامر بافشائه",
    "hades1":"وعن عبد الله بن عمرو بن العاص رضي الله عنهما أن رجلا سأل رسول الله صلى الله عليه وسلم‏:‏ أي الإسلام خير‏؟‏ قال‏:‏ ‏‏تطعم الطعام، وتقرأ السلام على من عرفت ومن لم =.‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏‏.‏",
    "hades2":"وعن أبي هريرة رضي الله عنه عن البني صلى الله عليه وسلم قال‏:‏ لما خلق الله تعالى آدم عليه السلام قال‏:‏ اذهب فسلم على أولئك -نفر من الملائكة جلوس- فاستمع ما يحيونك، فإنه تحيتك وتحية ذريتك‏.‏ فقال‏:‏ السلام عليكم فقالوا‏:‏ السلام عليك ورحمة الله، فزادوه‏:‏ ورحمة  ‏(‏‏(‏متفق عليه‏)‏‏)‏‏.‏",
    "hades3":"وعن أبي عمارة البراء بن عازب رضي الله عنهما قال‏:‏ أمرنا رسول الله صلى الله عليه وسلم بسبع‏:‏ بعيادة المريض، واتباع الجنائز، وتشميت العاطس، ونصر الضعيف، وعون المظلوم، وإفشاء السلام وإبرار المقسم‏.‏ ‏(‏‏(‏متفق عليه هذا لفظ إحدى روايات البخاري‏)‏‏)‏‏.‏",
    "hades4":"وعن أبي هريرة رضي الله عنه قال‏:‏ قال رسول الله صلى الله عليه وسلم ‏:‏ ‏لا تدخلوا الجنة حتى تؤمنوا ولا تؤمنوا حتى تحابوا أولا أدلكم على شيء إذا فعلتموه تحاببتم‏؟‏ أفشوا السلام بينكم‏‏ ‏(‏‏(‏رواه مسلم ‏)‏‏)‏‏.‏",


  },
  {
    "color": Colors.indigo.withOpacity(0.7),
    "hokm" :"باب كيفية السلام",
    "hades1":"عن عِمران بن حصين رضي الله عنهما قَالَ: جاءَ رجُلٌ إِلَى النَّبيِّ ﷺ فَقَالَ: السَّلامُ عَلَيكُم، فَرَدَّ عَلَيْهِ، ثُمَّ جَلَسَ، فَقَالَ النبيُّ ﷺ: عَشْرٌ، ثُمَّ جَاءَ آخَرُ فَقَالَ: السَّلامُ عَلَيكُم وَرَحْمَةُ اللهِ، فَرَدَّ عليهِ، فَجَلَسَ، فَقَالَ: عِشْرون، ثُمَّ جَاءَ آخَرُ فَقَالَ: السَّلامُ عَلَيكُم وَرَحْمَةُ الله وَبَرَكَاتُه، فَرَدَّ عليهِ، فَجَلَسَ، فَقَالَ: ثَلاثُونَ رواه أَبُو داود، والترمذي وقال: حديث حسن.",
    "hades2":"وعن عائشةَ رضي الله عنها قالتْ: قَالَ لي رسولُ الله ﷺ: هَذَا جِبرِيلُ يَقْرَأُ عَلَيْكِ السَّلامَ، قالَتْ: قُلْتُ: وَعَلَيْه السَّلامُ ورحْمَةُ اللهِ وَبَرَكَاتُهُ. متفقٌ عَلَيْهِ.",
    "hades3":"وعن أنسٍ : أن النَّبيَّ ﷺ كَانَ إِذَا تَكَلَّمَ بِكَلمةٍ أعَادهَا ثَلاثًا حتَّى تُفْهَم عَنْهُ، وَإِذَا أتَى عَلَى قوْمٍ فَسَلَّمَ عَلَيهم سَلَّم عَلَيهم ثَلاثًا. رواه البخاري",
    "hades4":"",


  },
  {
    "color": Colors.deepPurpleAccent.withOpacity(0.7),
    "hokm" :"باب اداب السلام",
    "hades1":"وعن عبد الله بن عمرو بن العاص رضي الله عنهما أن رجلا سأل رسول الله صلى الله عليه وسلم‏:‏ أي الإسلام خير‏؟‏ قال‏:‏ ‏‏تطعم الطعام، وتقرأ السلام على من عرفت ومن لم تعرف‏‏‏.‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏‏.‏",
    "hades2":"وعن أبي هريرة رضي الله عنه عن البني صلى الله عليه وسلم قال‏:‏ لما خلق الله تعالى آدم عليه السلام قال‏:‏ اذهب فسلم على أولئك -نفر من الملائكة جلوس- فاستمع ما يحيونك، فإنه تحيتك وتحية ذريتك‏.‏ فقال‏:‏ السلام عليكم فقالوا‏:‏ السلام عليك ورحمة الله، فزادوه‏:‏ ورحمة الله‏‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏‏.‏",
    "hades3":"وعن أبي هريرة رضي الله عنه عن البني صلى الله عليه وسلم قال‏:‏ لما خلق الله تعالى آدم عليه السلام قال‏:‏ اذهب فسلم على أولئك -نفر من الملائكة جلوس- فاستمع ما يحيونك، فإنه تحيتك وتحية ذريتك‏.‏ فقال‏:‏ السلام عليكم فقالوا‏:‏ السلام عليك ورحمة الله، فزادوه‏:‏ ورحمة  ‏(‏‏(‏متفق عليه‏)‏‏)‏‏.‏",
    "hades4":"وعن أبي هريرة رضي الله عنه قال‏:‏ قال رسول الله صلى الله عليه وسلم ‏:‏ ‏‏لا تدخلوا الجنة حتى تؤمنوا ولا تؤمنوا حتى تحابوا أولا أدلكم على شيء إذا فعلتموه تحاببتم‏؟‏ أفشوا السلام بينكم‏‏ ‏(‏‏(‏رواه مسلم ‏)‏‏)‏‏.‏",


  },
  {
    "color": Colors.deepPurple.withOpacity(0.7),
    "hokm" :"باب تعظيم حرمات المسلمين",
    "hades1":"عن أبي رقية تميم بن أوس الداري رضي الله عنه أن النبي صلى الله عليه وسلم قال‏:‏ ‏‏ الدين النصيحة‏‏ قلنا‏:‏ لمن‏؟‏ قال‏:‏ لله ولكتابه ولرسوله ولأئمة المسلمين وعامتهم ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.‏",
    "hades2":"عن جرير بن عبد الله رضي الله عنه قال‏:‏ بايعت رسول الله صلى الله عليه وسلم على إقام الصلاة، وإيتاء الزكاة، والنصح لكل مسلم‏.‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏ ‏.‏",
    "hades3":"عن أنس رضي الله عنه عن النبي صلى الله عليه وسلم قال‏:‏ “لا يؤمن أحدكم حتى يحب لأخيه ما يحب لنفسه‏(‏‏(‏متفق عليه‏)‏‏)‏ ",
    "hades4":"",


  },
  {
    "color": Color(0xff453658),
    "hokm" :"باب ستر عورات المسلمين",
    "hades1":"عن ابن عباس رضي الله عنهما، عن النبي صلَّى الله عليْه وسلَّم: ((مَن ستَر عورةَ أخيه المسلمِ، سَتَرَ اللهُ عورتَه يومَ القيامة، ومَن كشفَ عورةَ أخيه المسلم، كشفَ اللهُ عورتَه حتى يفضحه بها في بيته))",
    "hades2":"حديث أبي بَرْزَةَ رضِي الله عنه، عن النبي صلَّى الله عليْه وسلَّم؛ أنه قال: ((يا معشر مَن أسلم بلسانه ولم يُفْضِ الإيمانُ إلى قلبه، لا تؤذوا المسلمين، ولا تُعَيِّروهم، ولا تتَّبعوا عوراتهم؛ فإنه مَن يتبع عثراتِ أخيه المسلمِ يتبع اللهُ عورتَه، ومَن يتبع اللهُ عورتَه يفضحه ولو في جوف رَحْلِه))",
    "hades3":"",
    "hades4":"",


  },
  {
    "color": Colors.indigo.withOpacity(0.7),
    "hokm" :"باب الاصلاح بين الناس",
    "hades1":"",
    "hades2":"",
    "hades3":"",
    "hades4":"",


  },
  {
    "color": Colors.deepPurpleAccent.withOpacity(0.7),
    "hokm" :"باب فضل ضعفة المسلمين", "hades1":"",
    "hades2":"روى الإمام أحمد في مسنده من حديث أبي الدرداء رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: أَلَا أُخْبِرُكُمْ بِأَفْضَلَ مِنْ دَرَجَةِ الصَّلَاةِ وَالصِّيَامِ وَالصَّدَقَةِ؟ قَالُوا: بَلَى، قَالَ: إِصْلَاحُ ذَاتِ الْبَيْنِ، فَإِنَّ فَسَادَ ذَاتِ الْبَيْنِ هِيَ الْحَالِقَةُ [2]. وفي رواية: لَا أَقُولُ تَحْلِقُ الشَّعَرَ وَلَكِنْ تَحْلِقُ الدِّينَ",
    "hades3":"وى البخاري ومسلم في صحيحيهما من حديث أبي هريرة رضي الله عنه أن النبي صلى الله عليه وسلم قال: كُلُّ سُلَامَى مِنَ النَّاسِ عَلَيْهِ صَدَقَةٌ، كُلَّ يَوْمٍ تَطْلُعُ فِيهِ الشَّمْسُ؛ تَعْدِلُ بَيْنَ الِاثْنَيْنِ صَدَقَةٌ، وَتُعِينُ الرَّجُلَ عَلَى دَابَّتِهِ فَتَحْمِلُهُ عَلَيْهَا أَوْ تَرْفَعُ لَهُ عَلَيْهَا مَتَاعَهُ صَدَقَةٌ، وَالْكَلِمَةُ الطَّيِّبَةُ صَدَقَةٌ، وَكُلُّ خُطْوَةٍ تَمْشِيهَا إِلَى الصَّلَاةِ صَدَقَةٌ، وَتُمِيطُ الْأَذَى عَنِ الطَّرِيقِ صَدَقَةٌ",
    "hades4":"وروى البخاري ومسلم في صحيحيهما من حديث عائشة رضي الله عنها قالت: سمع رسول الله صلى الله عليه وسلم صوت خصوم بالباب عالية أصواتهما، وإذا أحدهما يستوضع الآخر ويسترفقه في شيء، وهو يقول: والله لا أفعل، فخرج عليهما رسول الله صلى الله عليه وسلم فقال: أَيْنَ الْمُتَأَلِّي عَلَى اللَّه لَا يَفْعَلُ الْمَعْرُوفَ؟ فَقَالَ: أَنَا يَا رَسُولَ اللَّه، وَلَهُ أَيُّ ذَلِكَ أَحَبَّ",


  },
  {
    "color": Colors.deepPurple.withOpacity(0.7),
    "hokm" :"باب ملاطفة اليتيم والمساكبن",
    "hades1":"عن أبى هريرة رضى الله عنه قال النبى صلى الله علية وسلم قال ليس المسكين الذى ترده التمرة و التمرتان, واللقمة واللقمتان, إنما المسكين الذى يتعفف)) متفق عليه",
    "hades2":"عن أبى هريرة رضى الله عنه قال:عن النبي صلى الله علية وسلم الساعى على الأرملة والمسكين كالمجاهد فى سبيل الله, وأحسبه كالقائم الذى لا يفتر, وكالصائم الذى لا يفطر)) متفق عليه",
    "hades3":"",
    "hades4":"",


  },
  {
    "color": Color(0xff453658),
    "hokm" :"باب الوصية بالنساء",
    "hades1":"قال أبو هريرة رضي الله عنه، عن رسول الله صلى الله عليه وسلم: (مَن كانَ يُؤْمِنُ باللَّهِ واليَومِ الآخِرِ، فلا يُؤْذِي جارَهُ، واسْتَوْصُوا بالنِّساءِ خَيْرًا، فإنَّهُنَّ خُلِقْنَ مِن ضِلَعٍ، وإنَّ أعْوَجَ شيءٍ في الضِّلَعِ أعْلاهُ، فإنْ ذَهَبْتَ تُقِيمُهُ كَسَرْتَهُ، وإنْ تَرَكْتَهُ لَمْ يَزَلْ أعْوَجَ، فاسْتَوْصُوا بالنِّساءِ خَيْرًا)",
    "hades2":"رُوِي عن المقدام بن معد يكرب الكندي، عن رسول الله صلى الله عليه وسلّم أنّه قال: (إنَّ اللهَ يُوصِيكُم بالنساءِ خيرًا، إنَّ اللهَ يُوصِيكُم بالنساءِ خيرًا، فإنهنَّ أمهاتُكم وبناتُكم وخالاتُكم، إنَّ الرجلَ من أهلِ الكتابِ يتزوجُ المرأةَ وما تُعلَّقُ يداها الخيطَ، فما يرغبُ واحدٌ منهما عن صاحبِه حتّى يموتا هَرمًا)",
    "hades3":"عن أبيّ بن كعب، أنّ رسول الله صلى الله عليه وسلّم قال: (ألا واستَوْصُوا بالنِّساءِ خَيرًا؛ فإنَّهُنَّ عَوَانٍ عندَكُم، ليس تَمْلِكون مِنهُنَّ شيئًا غيرَ ذلكَ، إلَّا أنْ يأتِينَ بفاحشةٍ مُبَيِّنةٍ، فإنْ فَعَلْنَ فاهجُروهُنَّ في المَضاجعِ، واضرِبوهُنَّ ضربًا غيرَ مُبَرِّحٍ، فإنْ أَطَعْنَكُم فلا تَبْغوا عليهِنَّ سبيلًا. ألَا إنَّ لكُم على نسائِكُم حقًّا، ولهُنَّ عليكُم حقًّا؛ فأمَّا حقُّكُم على نسائِكُم فلا يُوطِئْنَ فُرُشَكُم مَن تَكرَهون، ولا يَأْذَنَّ في بُيوتِكُم لمَن تَكرَهون، ألَا وإنَّ حقَّهُنَّ عليكُم أنْ تُحْسِنوا إليهِنَّ في كِسْوَتِهِنَّ وطَعامِهِنَّ)",
    "hades4":"",


  },
  {
    "color": Colors.indigo.withOpacity(0.7),
    "hokm" :"باب حق الزواج علي المراة",
    "hades1":"( لو كنت آمرا أحدا أن يسجد لغير الله ، لأمرت المرأة أن تسجد لزوجها ، والذي نفس محمد بيده لا تؤدي المرأة حق ربها حتى تؤدي حق زوجها ، ولو سألها نفسها وهي على قتب لم تمنعه ) السلسلة الصحيحة 1203",
    "hades2":"( لا يصلح لبشر أن يسجد لبشر ، ولو صلح أن يسجد بشر لبشر لأمرت المرأة أن تسجد لزوجها من عظم حقه عليها ، والذي نفسي بيده لو أن من قدمه إلى مفرق رأسه قرحة تنبجس بالقيح والصديد ثم أقبلت تلحسه ما أدت حقه ) صحيح الجامع 7725",
    "hades3":"( ألا أخبركم بنسائكم من أهل الجنة الودود الولود العؤود على زوجها التي إذا آذت أو أوذيت جاءت حتى تأخذ بيد زوجها ثم تقول والله لا أذوق غمضا حتى ترضى ) صحيح الجامع 2604 والعؤود هي التي تعود على زوجها بالنفع",
    "hades4":"",


  },
];

var MalomatList=[
  {
    "title":"تشمل المذاهب الإسلامية: المذهب الحنفي، والمذهب المالكي، والمذهب الحنبلي، والمذهب الشافعي.",

    "color": Colors.deepPurpleAccent.withOpacity(0.7),

  },
  {
    "title":"خُلق سيدنا آدم عليه السلام في يوم الجمعة، وأكبر أولاده قابيل.",

    "color": Colors.deepPurple.withOpacity(0.7),

  },
  {
    "title":"يعتبر أول رسول يُبعث إلى الأرض نوح عليه السلام، وهو يُلقب بشيخ المرسلين.",

    "color": Color(0xff453658),

  },
  {
    "title":"يعتبر القرآن الكريم كلام الله عز وجل المنزل على النبي محمد عليه الصلاة والسلام والمنقول إلينا بالتواتر، وهو يبدأ بسورة الفاتحة ويُختم بسورة الناس، وعدد سوره ١١٤ سورة.",

    "color": Colors.indigo.withOpacity(0.7),
  },
  {
    "title":"يعتبر النبي إدريس عليه السلام أول من خط بالقلم.",

    "color": Colors.deepPurpleAccent.withOpacity(0.7),

  },
  {
    "title":"كان قوم سيدنا شعيب هم أصحاب الأيكة.",

    "color": Colors.deepPurple.withOpacity(0.7),

  },
  {
    "title":"نزلت السور المكية القرآنية على النبي محمد صلى الله عليه وسلم قبل الهجرة إلى المدينة، وتحدثت عن بيان العقيدة.",

    "color": Color(0xff453658),

  },
  {
    "title":"نزلت السور المدنية القرآنية على النبي محمد صلى الله عليه وسلم بعد الهجرة، وتحدثت عن التشريع، وبيان أحكام الحرام والحلال.",

    "color": Colors.indigo.withOpacity(0.7),
  },
  {
    "title":"لُقّب النبي موسى عليه السلام بكليم الله، والنبي داود عليه السلام بخليفة الله، والنبي إبراهيم عليه السلام بخليل الله، والنبي محمد عليه الصلاة والسلام بحبيب الله.",

    "color": Colors.deepPurpleAccent.withOpacity(0.7),

  },
  {
    "title":"يعتبر الصيام هو الامتناع عن الشراب والأكل وكلّ ما يعتبر من المفطرات من طلوع الفجر إلى غروب الشمس، وحكمه فريضة على جميع المسلمين، فقال الله تعالى: ﴿يَا أَيُّهَا الَّذِينَ آمَنُوا كُتِبَ عَلَيْكُمُ الصِّيَامُ كَمَا كُتِبَ عَلَى الَّذِينَ مِن قَبْلِكُمْ لَعَلَّكُمْ تَتَّقُونَ﴾ [البقرة: 183].",

    "color": Colors.deepPurple.withOpacity(0.7),

  },
  {
    "title":"كُتب التاريخ الهجري على يد عمر بن الخطاب.",

    "color": Color(0xff453658),

  },
  {
    "title":"يعتبر هؤلاء الصحابة رضوان الله عليهم من الأوائل في الإسلام: أول مؤذن بلال بن رباح، وأول خليفة الصحابي أبو بكر الصديق، وأول سفير مصعب بن عمير، وأول مولود للمسلمين المهاجرين في أرض المدينة المنورة عبد الله بن الزبير، وأول فدائي الإمام علي بن أبي طالب.",

    "color": Colors.indigo.withOpacity(0.7),
  },
  {
    "title":"احتفل المسلمون لأول مرة في عيد الفطر وعيد الأضحى في العام الثاني للهجرة.",

    "color": Colors.deepPurpleAccent.withOpacity(0.7),

  },
  {
    "title":"الملائكة الموكلون بفتنة القبر هم منكر ونكير .",

    "color": Colors.deepPurple.withOpacity(0.7),

  },
  {
    "title":"اول عاصمة للدولة الاسلامية هي المدينه المنورة .",

    "color": Color(0xff453658),

  },
  {
    "title":"اسد الله الغالب هو علي بن ابي طالب .",

    "color": Colors.indigo.withOpacity(0.7),
  },
  {
    "title":"اخر المخلوقات موتآ هو ملك الموت .",

    "color": Colors.deepPurpleAccent.withOpacity(0.7),

  },
  {
    "title":"نام أهل الكهف مدة 309 سنة .",

    "color": Colors.deepPurple.withOpacity(0.7),

  },
  {
    "title":"اول ناس يدخلون الجنه هم الفقراء والمساكين .",

    "color": Color(0xff453658),

  },
  {
    "title":"انبياء العرب هم شعيب ومحمد وصالح وهود عليهم السلام .",

    "color": Colors.indigo.withOpacity(0.7),
  },
  {
    "title":"اول من جاهد في سبيل الله هو ادريس عليه السلام .",

    "color": Colors.deepPurpleAccent.withOpacity(0.7),

  },
  {
    "title":".  الحج الاصغر هو العمرة .",

    "color": Colors.deepPurple.withOpacity(0.7),

  },
  {
    "title":". تقع الاعراف بين الجنة والنار .",

    "color": Color(0xff453658),

  },
  {
    "title":"النبي الذي امن به جميع قومه هو يونس عليه السلام .",

    "color": Colors.indigo.withOpacity(0.7),
  },
  {
    "title":"اول صلاة صلاها الرسول عليه الصلاة والسلام هي صلاة الظهر .",

    "color": Colors.deepPurpleAccent.withOpacity(0.7),

  },
  {
    "title":"اسم الجبل التي استقرت عليه سفينه نوح عليه السلام في تركيا هو جبل الجودي .",

    "color": Colors.deepPurple.withOpacity(0.7),

  },
  {
    "title":"السورة التي تسمي عروس القران هي سورة الرحمن .",

    "color": Color(0xff453658),

  },
  {
    "title":". الذي كان تستحي منه الملائكه في السماء هو عثمان بن عفان رضي الله عنه .",

    "color": Colors.indigo.withOpacity(0.7),
  },
  {
    "title":"اول من اذن في السماء هو جبريل عليه السلام .",

    "color": Colors.deepPurpleAccent.withOpacity(0.7),

  },
  {
    "title":"اعظم اية في القران هي اية الكرسي .",

    "color": Colors.deepPurple.withOpacity(0.7),

  },
  {
    "title":"اول مولود في الاسلام قبل الهجرة عبد الله بن عمر بن الخطاب .",

    "color": Color(0xff453658),

  },
  {
    "title":"قابيل قتل اخيه هابيل بفك حمار ",

    "color": Colors.indigo.withOpacity(0.7),
  },
  {
    "title":"اذا كان الانسان يريد البركة فليكثر من الصلاة على النبي صلي الله عليه وسلام .",

    "color": Colors.deepPurpleAccent.withOpacity(0.7),

  },

];

var AdayaList=[
  {
    "title":"آدم علية السلام.",
    "subtitle" :"رَبَّنَا ظَلَمْنَا أَنفُسَنَا وَإِن لَّمْ تَغْفِرْ لَنَا وَتَرْحَمْنَا لَنَكُونَنَّ مِنَ الْخَاسِرِينَ",
    "color": Colors.deepPurpleAccent.withOpacity(0.7),

  },
  {
    "title":"نوح علية السلام.",
    "subtitle" :"رَّبِّ اغْفِرْ لِي وَلِوَالِدَيَّ وَلِمَن دَخَلَ بَيْتِيَ مُؤْمِنًا وَلِلْمُؤْمِنِينَ وَالْمُؤْمِنَاتِ وَلَا تَزِدِ الظَّالِمِينَ إِلَّا تَبَارًا .   رَبِّ إِنِّي أَعُوذُ بِكَ أَنْ أَسْأَلَكَ مَا لَيْسَ لِي بِهِ عِلْمٌ وَإِلاَّ تَغْفِرْ لِي وَتَرْحَمْنِي أَكُن مِّنَ الْخَاسِرِينَ َ",
    "color": Colors.deepPurple.withOpacity(0.7),

  },
  {
    "title":"إبراهيم علية السلام.",
    "subtitle" :"رَبَّنَا تَقَبَّلْ مِنَّا إِنَّكَ أَنْتَ السَّمِيعُ الْعَلِيمُ (127) رَبَّنَا وَاجْعَلْنَا مُسْلِمَيْنِ لَكَ وَمِنْ ذُرِّيَّتِنَا أُمَّةً مُسْلِمَةً لَكَ وَأَرِنَا مَنَاسِكَنَا وَتُبْ عَلَيْنَا إِنَّكَ أَنْتَ التَّوَّابُ الرَّحِيمُ (128) ",
    "color": Color(0xff453658),

  },
  {
    "title":"هود علية السلام.",
    "subtitle" :"إِنِّي تَوَكَّلْتُ عَلَى اللَّهِ رَبِّي وَرَبِّكُم ۚ مَّا مِن دَابَّةٍ إِلَّا هُوَ آخِذٌ بِنَاصِيَتِهَا ۚ إِنَّ رَبِّي عَلَىٰ صِرَاطٍ مُّسْتَقِيمٍ",
    "color": Colors.indigo.withOpacity(0.7),

  },
  {
    "title":"لوط علية السلام.",
    "subtitle" :"رَبِّ انْصُرْنِي عَلَى الْقَوْمِ الْمُفْسِدِينَ  \n رَبِّ نَجِّنِي وَأَهْلِي مِمَّا يَعْمَلُونَ",
    "color": Colors.deepPurpleAccent.withOpacity(0.7),

  },
  {
    "title":"يوسف علية السلام.",
    "subtitle" :"فَاطِرَ السَّمَاوَاتِ وَالْأَرْضِ أَنتَ وَلِيِّي فِي الدُّنْيَا وَالْآخِرَةِ ۖ تَوَفَّنِي مُسْلِمًا وَأَلْحِقْنِي بِالصَّالِحِينَ",
    "color": Colors.deepPurple.withOpacity(0.7),

  },
  {
    "title":"شعيب علية السلام.",
    "subtitle" :"وَسِعَ رَبُّنَا كُلَّ شَيْءٍ عِلْماً عَلَى اللّهِ تَوَكَّلْنَا رَبَّنَا افْتَحْ بَيْنَنَا وَبَيْنَ قَوْمِنَا بِالْحَقِّ وَأَنتَ خَيْرُ الْفَاتِحِينَ",
    "color": Color(0xff453658),

  },
  {
    "title":"موسى علية السلام.",
    "subtitle" :"رَبِّ إِنِّي ظَلَمْتُ نَفْسِي فَاغْفِرْ لِ \n رَبِّ بِمَا أَنْعَمْتَ عَلَيَّ فَلَنْ أَكُونَ ظَهِيراً لِّلْمُجْرِمِينَ \n رَبِّ اشْرَحْ لِي صَدْرِي (25) وَيَسِّرْ لِي أَمْرِي (26) وَاحْلُلْ عُقْدَةً مِّن لِّسَانِي (27) يَفْقَهُوا قَوْلِي (28)",
    "color": Colors.indigo.withOpacity(0.7),

  },
  {
    "title":"أيوب علية السلام.",
    "subtitle" :"أَنِّي مَسَّنِيَ الضُّرُّ وَأَنتَ أَرْحَمُ الرَّاحِمِينَ",
    "color": Colors.deepPurpleAccent.withOpacity(0.7),

  },
  {
    "title":"سليمان علية السلام.",
    "subtitle" :"رَبِّ أَوْزِعْنِي أَنْ أَشْكُرَ نِعْمَتَكَ الَّتِي أَنْعَمْتَ عَلَيَّ وَعَلَى وَالِدَيَّ وَأَنْ أَعْمَلَ صَالِحًا تَرْضَاهُ وَأَدْخِلْنِي بِرَحْمَتِكَ فِي عِبَادِكَ الصَّالِحِينَ",
    "color": Colors.deepPurple.withOpacity(0.7),

  },
  {
    "title":"يونس علية السلام.",
    "subtitle" :"لَّا إِلَهَ إِلَّا أَنتَ سُبْحَانَكَ إِنِّي كُنتُ مِنَ الظَّالِمِينَ",
    "color": Color(0xff453658),

  },
  {
    "title":"زكريا علية السلام.",
    "subtitle" :"رَبِّ هَبْ لِي مِن لَّدُنْكَ ذُرِّيَّةً طَيِّبَةً إِنَّكَ سَمِيعُ الدُّعَاء \n رَبِّ لَا تَذَرْنِي فَرْداً وَأَنتَ خَيْرُ الْوَارِثِينَ",
    "color": Colors.indigo.withOpacity(0.7),

  },
  {
    "title":"يعقوب علية السلام.",
    "subtitle" :"إِنَّمَا أَشْكُو بَثِّي وَحُزْنِي إِلَى اللَّهِ",
    "color": Colors.deepPurpleAccent.withOpacity(0.7),

  },
  {
    "title":"أدعية النبي محمد",
    "subtitle" :"اللَّهُمَّ آتِنَا في الدُّنْيَا حَسَنَةً وفي الآخِرَةِ حَسَنَةً، وَقِنَا عَذَابَ النَّارِ اللَّهُمَّ إنِّي أَسْأَلُكَ الهُدَى وَالتُّقَى، وَالْعَفَافَ وَالْغِنَى اللَّهُمَّ اغْفِرْ لي وَارْحَمْنِي وَاهْدِنِي وَارْزُقْنِي",
    "color": Colors.deepPurple.withOpacity(0.7),
  },

];
var StoryList=[
  {
    "nabi" :"ادم عليه السلام",
    "color": Colors.deepPurpleAccent.withOpacity(0.7),
    "part1":"آدم عليه السلام \n  هو أول نبي من أنبياء الله تعالى، وأبو البشر، خلقه الله -تعالى- بيديه، وعلّمه الأسماء كلها، ثم أمر الملائكة بالسجود له، وبعدها عاش آدم -عليه السلام- في الجنة، وخلق الله -تعالى- له زوجته حواء، وأباح لهما كل ثمار الجنة ونعيمها إلا شجرة واحدة، فوسوس لهما الشيطان فأكلا منها، فأنزلهما الله -تعالى- إلى الأرض وأمرهما بعبادته وحده لا شريك له ودعوة البشر إلى ذلك.",
    "part2":"قصة آدم عليه السّلام \n  ورد ذكر قصة آدم -عليه السلام- في العديد من سور القرآن الكريم، حيث ذُكرت في سبعة مواضع في سورة البقرة، والأعراف، والحجر، والإسراء، والكهف، وطه، وص، وقد وردت أحداث القصة بدرجات متفاوتة من القِصر، والطول، والإيجاز، والإسهاب، والتفصيل، والاختصار، ولكن عند تجميع الأحداث تتشكل قصة مترابطة لا انقطاع فيها ولا اختلال، حيث تبدأ القصة بالحديث عن إرهاصات خلق الكائن الجديد وهو آدم عليه السلام، وبيان نوع المادة التي سيُخلق منها، ثم الاحتفاء به وأمر الملائكة بالسجود له، وبيان سجود الملائكة -عليهم السلام- له ورفض إبليس للأمر الإلهي، وتستمر الأحداث بالتسلسل إلى أن تنتهي بخروج آدم من الجنة وهبوطه إلى الأرض، وفيما يأتي تفصيل لقصة آدم عليه السلام.",
    "part3":"خلق آدم عليه السلام  \n  سبق خلق آدم -عليه السلام- إخبار الله -تعالى- ملائكته -عليهم السلام- بأنه سيخلق بشراً، وأنّ هذا المخلوق الجديد سيسكن الأرض، ويكون على رأس ذرية يخلف بعضهم بعضاً، فتساءلت الملائكة عن الحكمة من خلق آدم عليه السلام، فبيّن الله -تعالى- في القرآن الكريم استفسار الملائكة، حيث قال: (إِذْ قَالَ رَبُّكَ لِلْمَلَائِكَةِ إِنِّي جَاعِلٌ فِي الْأَرْضِ خَلِيفَةً ۖ قَالُوا أَتَجْعَلُ فِيهَا مَن يُفْسِدُ فِيهَا وَيَسْفِكُ الدِّمَاءَ وَنَحْنُ نُسَبِّحُ بِحَمْدِكَ وَنُقَدِّسُ لَكَ)،[٣] والظاهر من توقع الملائكة بأنّ ذرية آدم ستسفك الدماء وتُفسد في الأرض؛ لأنّ لديهم من الإلهام والبصيرة ما يكشف لهم شيئاً من فطرة المخلوق، أو أنّ لهم تجربة سابقة في الأرض، بالإضافة إلى أنّ فطرة الملائكة التي جُبلت على الخير المطلق لا تتصور غايةً للوجود إلا تسبيح الله -تعالى- وتقديسه، وذلك متحقق بوجودهم، وبعد ما أبداه الملائكة عليهم السلام من الحيرة بعد معرفة خبر خلق آدم، جاء الرد من رب العالمين حيث قال: (إِنِّي أَعْلَمُ مَا لَا تَعْلَمُونَ).[٣][١] ثم بيّن الله -تعالى- للملائكة أنه سيخلق آدم -عليه السلام- من طين، وأنّه سينفخ فيه من روحه، وأمرهم بالسجود تكريماً له عند خلقه، وبعدها جُمع من تراب الأرض الأحمر، والأصفر، والأبيض، والأسود، ثم مُزج التراب بالماء فأصبح صلصالاً من حمأ مسنون، ثم تعفن الطين وانبعثت منه رائحة، ممّا جعل إبليس يتعجب ويتساءل ماذا سيكون هذا الطين، ثم جاء اليوم المُرتقب حيث سوّى الله -تعالى- آدم بيديه، ثم نفخ فيه من روحه فتمّ بذلك خلقه، ودبّت فيه الروح، وفي تلك اللحظة سجد الملائكة كما أمرهم ربهم -عز وجل- إلا إبليس الذي أعمى الكِبر والغرور بصيرته، فرفض السجود لآدم، فوبّخ الله -تعالى- إبليس، حيث قال له: (قَالَ يَا إِبْلِيسُ مَا مَنَعَكَ أَن تَسْجُدَ لِمَا خَلَقْتُ بِيَدَيَّ ۖ أَسْتَكْبَرْتَ أَمْ كُنتَ مِنَ الْعَالِينَ)،[٤][١] ولم يرتدع إبليس بعِظم الذنب الذي ارتكبه بعصيان أمر الله تعالى، بل أصرّ واستكبر وردّ بمنطق الحسد والكبر قائلاً: (قَالَ أَنَا خَيْرٌ مِّنْهُ خَلَقْتَنِي مِن نَّارٍ وَخَلَقْتَهُ مِن طِينٍ)،[٥] في تلك اللحظة صدر أمر الله -تعالى- بلعنة إبليس وطرده من رحمة الله -تعالى- إلى يوم القيامة، حيث قال تعالى: (قَالَ فَاخْرُجْ مِنْهَا فَإِنَّكَ رَجِيمٌ* وَإِنَّ عَلَيْكَ لَعْنَتِي إِلَى يَوْمِ الدِّينِ)،[٦] هناك امتلأ قلب إبليس بالحقد على آدم وذريته، وأصبح همّه الانتقام منه، فطلب من الله -تعالى- تأخيره إلى يوم القيامة، وشاءت حكمة الله -تعالى- إجابته فيما طلب، فأفصح إبليس عن هدفه في الانتقام حيث قال: (فَبِعِزَّتِكَ لَأُغْوِيَنَّهُمْ أَجْمَعِينَ* إِلَّا عِبَادَكَ مِنْهُمُ الْمُخْلَصِينَ)،[٧] ثم أسكن الله -تعالى- آدم -عليه السلام- الجنة وخلق له زوجته حواء.",
    "part4":"خروج آدم من الجنّة واستخلافه في الأرض  \n  بعد خلق الله -تعالى- لحواء زوجةً لآدم عليه السلام، وبعد إسكانهما الجنة يتنعّمان فيها بنعيم كثير، أمر الله -تعالى- آدم وزوجته بعدم تناول فاكهة شجرة واحدة في الجنة، والاستمتاع بكلّ ما تبقّى من النعيم، ففي الجنة أصناف لا تُعدّ من الطعام، وشراب لذيذ متى ما عطش آدم -عليه السلام- شرب منه، ولا حرّ فيها ولا شمس، وحذّر الله -تعالى- آدم -عليه السلام- من اتباع وساوس إبليس وأوامره، فقال -تعالى- في مُحكم كتابه الكريم: (فَقُلْنَا يَا آدَمُ إِنَّ هَٰذَا عَدُوٌّ لَّكَ وَلِزَوْجِكَ فَلَا يُخْرِجَنَّكُمَا مِنَ الْجَنَّةِ فَتَشْقَى)[٨] فإبليس طُرد من الجنة وبالتأكيد لن يُريد لآدم -عليه السلام- إلا الشرّ، وقد سبق أن توعّد إبليس بإغواء آدم -عليه السلام- وذريته حتى يحشرهم الله يوم القيامة.[٩] وذات يوم وسوس إبليس لآدم -عليه السلام- ليأكل من ثمر هذه الشجرة، وكانت الوسوسة قائمة على إقناع آدم -عليه السلام- بأنّ تناول ثمار هذه الشجرة سيجعله خالداً مع مُلكٍ لا ينفد ولا يبلى، وعلى الرغم من عبادة آدم -عليه السلام- لله تعالى، إلا أنّه ضعف لوسوسة الشيطان آنذاك وامتثل لأمره، فأكل من الشجرة، ومصداق ذلك ما جاء في قول الله تعالى: (فَوَسْوَسَ إِلَيْهِ الشَّيْطَانُ قَالَ يَا آدَمُ هَلْ أَدُلُّكَ عَلَىٰ شَجَرَةِ الْخُلْدِ وَمُلْكٍ لَّا يَبْلَىٰ* فَأَكَلَا مِنْهَا فَبَدَتْ لَهُمَا سَوْآتُهُمَا وَطَفِقَا يَخْصِفَانِ عَلَيْهِمَا مِن وَرَقِ الْجَنَّةِ ۚ وَعَصَىٰ آدَمُ رَبَّهُ فَغَوَىٰ).[١٠][٩] ويجدر بالذكر أنّ هذا الأمر قد كتبه الله -تعالى- على آدم -عليه السلام- قبل خلقه، ولكنّ قيامه بذلك كان تخييراً لا تسييراً، وكان الردّ من الله -عزّ وجلّ- أن يُخرج آدم -عليه السلام- وزوجته من الجنة، ويُنزلهما إلى الأرض، حيث الحياة الدنيا، حياة الشقاء والكدح والعمل، يسعى الإنسان فيها ليحصل على الرزق، ويتعب ويشقى ليعيش فيها، وكما هو معلوم فإنّ هذه الحياة حياة النِّزاع مع الشيطان ومحاربة الهوى والشهوات، فالإنسان في الدنيا مُخيّر أن يسير أحد في أحد طريقين؛ إمّا طريق الخير والفلاح وإمّا طريق الشر والخسران.",
  },
  {
    "nabi" :"شيث ابن ادم عليه السلام",
    "color": Colors.deepPurple.withOpacity(0.7),
    "part1":"النبي شيث -عليه السلام- \n النبي شيث نبيٌّ من أنبياء الله -عليهم السلام- هو ابنُ سيِّدنا آدم عليه السلام، ثالثُ أبناء آدم وحواء -عليهما السلام-، وهو أخو قابيل وهابيل، فبعدَ أن قتل قابيل أخاه هابيل، قال تعالى: فطوَّعتْ له نفسُه قتلَ أخيه فقتَلَه فأصبَحَ مِن الخَاسِرين [١]، رزقَ اللهُ آدمَ وحواء ولدهما شيث تعويضًا لهما وجبرًا لقلبيهما بعد معاناتهما التي عانوها في مقتل ولدهما هابيل على يدِ أخيه قابيل، وفي هذا المقال حديثٌ عن نبيِّ الله شيث -عليه السلام- وذكرُ بعض ما تضمَّنَته قصته من عِبر.",
    "part2":"قصة النبي شيث -عليه السلام- \n  هو نبيٌّ من أنبياء الله بعد آدم وقبل إدريس -عليهم السلام أجمعين-، ومعنى اسم شيث: هو هبةُ الله أو أعطيةُ الله أو البديل لأنَّ الله بعدَ أن قتلَ قابيل أخاه هابيل رزقَ آدمَ -عليه السلام- هذا الولدَ الصالحَ تعويضًا له فسُمِّيَ بذلك، وقد كان بارًّا بوالديه كثيرًا فعلَّمه آدمُ ما كان لديه من علم، لأنَّ سيدنا آدم -عليه السلام- علَّمه الله تعالى من علمِه قبل أن ينزلَه إلى الأرض، قال تعالى: وعلَّم آدمَ الأسماءَ كلَّها [٢]، وعندما حضرت الوفاةُ آدم -عليه السلام- أوصى ولده شيث بأمرِ قومه وأن لا يخبرَ أخاه قابيل عن ذلك لأنَّه كان حسودًا. وتوفيَ آدم ودفنته الملائكة وتولَّى -عليه السلام- أمرَ قومه بعد وفاة أبيه، وبعد سنة توفِّيت حواء ودفنها بالطريقة نفسها التي دَفَنَت الملائكة بها أباه، وقد وردَ في الحديث الطويل الذي رواه أبو ذر الغفاري أنَّ رسول الله -صلَّى الله عليه وسلم- قال فيه: أُنزِل على شيث خمسونَ صَحيفة [٣]، وقيلَ إنَّه بنى الكعبة بالحجارة والطين وبقيَ يحجُّ ويعتمر في مكة حتى مات",
    "part3":"النبي شيث وأول حادثة زنا \n  عندما تولَّى شيث بن آدم -عليهما السلام- أمرَ قومِه بعد وفاة أبيه، منعَ قومه من الاختلاط بقومِ أخيه قابيل، فقد سكنَ هو وقومه في الجبال، أمَّا قابيل وقومه فقد سكنوا السهول، إلا أنَّ أحدَ الرجال تسلَّلَ وخالف أوامرَ سيِّده فنزلَ ورآى النساء وجمالهنَّ بعكس رجال السهول الذين لا يملكون جمالًا ورآى ما عليه القوم من لهوٍ وملاهي، فرجعَ وأخبرَ عددًا من رجال قومِه الذين يسكنون في الجبال التزامًا بأوامر نبيِّ الله -عليه السلام- وقد كانوا أجمل من رجال قوم قابيل لأنَّهم يسكنون الجبال بعكس نسائهم فنزلوا وخالفوا أمرَهُ أيضًا، فافتتنوا بالنساء وفُتنت بهم نساءُ قومِ قابيلَ ووقعت الفحشاء بينهم في ذلك الوقت، وكانت أوَّلُ حادثة زنا في تاريخ البشرية",
    "part4":"",
  },
  {
    "nabi" :"ادريس عليه السلام",
    "color": Color(0xff453658),
    "part1":"النبي إدريس عليه السلام \n إدريس عليه السلام واحدٌ من الأنبياء الذين جاء القرآن الكريم على ذِكرهم في أكثر من موضع، وقد تعدّدت الروايات في نسبه -عليه السلام- وأرجحُها أنّه إدريس بن يرد بن مهلاييل، ويُعرف أيضًا باسم أخَنوخ، ووجه تسميته إدريسًا أن الاسم مأخوذٌ من الدَّرس والدِّراسة لكثرة دراسته وتفكره وتأمله في الصحف المُنزلة على آدم وشيث -عليهما السلام- وقيل عن إدريس إنّه أول من خطَّ وخاط، أيْ: خطَّ بالقلم وخاط الثياب كما جاء في الحديث الذي صحّحه ابن حبان وضعفه الألباني؛ نظرًا لأنّ الأخبار الواردة عنه -عليه السلام- كافّة من الإسرائيليّات التي يُستأنس بها لكن لا بُمكن الجزم بثبوتها.",
    "part2":"قصة النبي إدريس عليه السلام \n اختلفَ العلماء في مكان ولادة إدريس، فقيل في بابل من أرض العراق وهو الأرجح، وقيل في مصر، وهو ثالث أنبياء البشريّة بعد آدم وشيث -عليهما السلام-، وكانت بداية ارتباطه بالإيمان الربانيّ أنّه أخذَ بالعلم المُنزل على شيث بن آدم دراسةً وتعلُّمًا وتطبيقًا حتى سُمّي إدريسًا وبقي على حاله تلك حتى آتاه الله النبوة، فصدع بنبوته وحثّ الناس على الإلتزام بشريعتيْ آدم وشيث -عليهما السلام-، فاتّبعه رهطٌ قليلٌ وخالفه وعصاه غالبيّة الناس، ممّا حدا به إلى اتخاذ قرار الرحيل عن بابل هو ومن معه -وقد استثقَلوا أمر الرحيل- ثمّ خرجوا جميعًا من بابل إلى مصر ووقَفَ -عليه السلام- على نهر النيل مُسبحًا، وهناك استقرّ بهم المقام وأخذ إدريس في دعوة الناس إلى الإيمان بالله تعالى والأخذ بمكارم الأخلاق والصلاة والصوم والذِّكر والطهارة من النجاسات وتحريم المُسكِرات والتزود بالعمل الصالح للآخرة، وإليه يُنسب الفضلُ في بناء المدن وتنظيمها على أسسٍ ثابتةٍ؛ فأنشئت في زمانه مائة وثمانٍ وثمانين مدينةً. وقد اختلفَ أهل التفسير في وفاة إدريس -عليه السلام- بسببِ ما ورد في قوله تعالى عنه: وَرَفَعْنَاهُ مَكَانًا عَلِيًّا [١]، فقال المفسّرون المقصود بالرفع هو الرفع الحسيّ الحقيقيّ إلى السماء الرابعة وهو أرجحُ الأقوال، وإن لم يُجزَم به لورود ذلك في حديث الإسراء، حيث مرّ به الرسول -صلى الله عليه وسلم- وهو في السماء الرابعة لكن رؤية الرسول له روحًا لا جسدًا.",
    "part3":"",
    "part4":"",

  },
  {
    "color": Colors.indigo.withOpacity(0.7),
    "nabi" :"نوح عليه السلام",
    "part1":"قصة سيّدنا نوح \n  بعث الله -تعالى- نوحاً -عليه السلام- إلى قومه بعد أن ظهرت فيهم الضلالات، والجحود بالله، فكان أوّل رسول يرسله الله إلى الناس في الأرض، وقد جاء عن ابن جبير، وغيره أنّ قوم نوح كان اسمهم بنو راسب،[١] وقد كانت بداية عهد قوم نوح بالجحود بالله حينما عبدوا أصناماً كان قد بناها مَن قبلهم من الأجيال لرجال صالحين منهم؛ تخليداً لذكراهم بعد مماتهم، وقد بَقِيت تلك النُّصُب فترة من الزمن لا تُعبَد، حتى إذا هلك ذلك الجِيل، وذهب العلم، اتّخذ الناس تلك التماثيل أصناماً يعبدونها من دون الله -تعالى-، قال -عزّ وجلّ-: (وَقَالُوا لَا تَذَرُنَّ آلِهَتَكُمْ وَلَا تَذَرُنَّ وَدًّا وَلَا سُوَاعًا وَلَا يَغُوثَ وَيَعُوقَ وَنَسْرًا )،[٢] فبعث الله فيهم نوحاً نبيا ورسولا",
    "part2":"دعوة سيّدنا نوح \n  بدأ نوح -عليه السلام- بعثته بدعوة قومه إلى الإيمان، والتوحيد، وإفراد العبادة لله -تعالى- وحده، وذكر لهم فائدة اتِّباع أمره، وطاعته في غفران ذنوبهم، قال -تعالى- على لسان نبيّه: (يَغْفِرْ لَكُم مِّن ذُنُوبِكُمْ)،[٤] وترك معاقبتهم، وإمهالهم إن هم آمنوا بالله ورسوله إلى أن يحين أجلهم الذي كتبه الله لهم، قال -تعالى-: (وَيُؤَخِّرْكُمْ إِلَىٰ أَجَلٍ مُّسَمًّى)،[٤] وقد دعا نوح -عليه السلام- قومَه باستخدام شتّى الأساليب؛ حتى يؤمنوا بالله، قال -تعالى- على لسان نبيّه الكريم: (قَالَ رَبِّ إِنِّي دَعَوْتُ قَوْمِي لَيْلًا وَنَهَارًا* فَلَمْ يَزِدْهُمْ دُعَائِي إِلَّا فِرَارًا*وَإِنِّي كُلَّمَا دَعَوْتُهُمْ لِتَغْفِرَ لَهُمْ جَعَلُوا أَصَابِعَهُمْ فِي آذَانِهِمْ وَاسْتَغْشَوْا ثِيَابَهُمْ وَأَصَرُّوا وَاسْتَكْبَرُوا اسْتِكْبَارًا)،[٥] وفي هذه الآية وصفٌ لحال قوم نوح حينما كان يدعوهم نبيّهم إلى الإيمان؛ حيث كانوا يَفرّون منه، ويجعلون أصابهم في آذانهم؛ كي لا يسمعوا كلامه، كما أنّهم كانوا يتّغطّون بثيابهم، مُصرِّين على جحودهم، ومُستكبِرين في عنادهم. \n دعا نوح قومه سِرّاً فيما بينه وبينهم، كما دعاهم عَلناً بصوت مرتفع، وأمرهم باستغفار الله -تعالى-، وذكّرهم بعاقبة التائبين المُستغفِرين حينما يرسل الله عليهم السماءَ مُتتابِعةً بالرزق الوفير، ويُمدِدهم بالأموال، والبنين، ويُصيِّر أرضَهم جنّات، وأنهاراً، قال -تعالى-: (ثُمَّ إِنِّي دَعَوْتُهُمْ جِهَارًا*ثُمَّ إِنِّي أَعْلَنتُ لَهُمْ وَأَسْرَرْتُ لَهُمْ إِسْرَارًا*فَقُلْتُ اسْتَغْفِرُوا رَبَّكُمْ إِنَّهُ كَانَ غَفَّارًا*يُرْسِلِ السَّمَاءَ عَلَيْكُم مِّدْرَارًا)،[٧] ثمّ ذكّر نوح قومَه بعظمة الله -تعالى- التي تتجلّى في خَلق الإنسان أطواراً؛ حيث يبتدِئُ خَلقه نُطفةً، ثمّ علقةً، ثمّ مضغةً، ثمّ يخلق الله العظام، ويكسوها اللحمَ، وقد قابل قوم نوح -عليه السلام- دعوته بالعصيان، والمخالفة، والإصرار على ما فيهم من الجحود، والضلالة، ومَكروا لنبيّهم مكراً عظيماً، وحينما استيأس نوح -عليه السلام- من دعوة قومه، دعا عليهم، ومن دعائه ما جاء في قوله -تعالى- على لسان نوح: (وَقَدْ أَضَلُّوا كَثِيرًا وَلَا تَزِدِ الظَّالِمِينَ إِلَّا ضَلَالًا)؛[٨] أي أن يطبع الله على قلوبهم بضلالهم فلا يهتدوا إلى الحقّ، ثمّ قال -تعالى-: (وَقَالَ نُوحٌ رَّبِّ لَا تَذَرْ عَلَى الْأَرْضِ مِنَ الْكَافِرِينَ دَيَّارًا * إِنَّكَ إِن تَذَرْهُمْ يُضِلُّوا عِبَادَكَ وَلَا يَلِدُوا إِلَّا فَاجِرًا كَفَّارًا)؛[٩] أي ربِّ لا تترك الكافرين على هذه الأرض؛ لأنّهم إن تُرِكوا، أضلّوا الناس عن سبيل الحقّ، والهدى، ولا يلدون إلّا الذي لا يؤمن بدينك، و يجحد نعمتك. \n وقد أكّدت قصّة نوح -عليه السلام- على مسألة عدم الانتفاع بمِيزة النَّسب، والرابطة الزوجيّة إذا كان الإنسان كافراً بالله -تعالى-؛ فقد ضرب الله -جلّ وعلا- في كتابه العزيز مَثلاً للذين كفروا، فقال:(ضَرَبَ اللَّـهُ مَثَلًا لِّلَّذِينَ كَفَرُوا امْرَأَتَ نُوحٍ وَامْرَأَتَ لُوطٍ كَانَتَا تَحْتَ عَبْدَيْنِ مِنْ عِبَادِنَا صَالِحَيْنِ فَخَانَتَاهُمَا فَلَمْ يُغْنِيَا عَنْهُمَا مِنَ اللَّـهِ شَيْئًا وَقِيلَ ادْخُلَا النَّارَ مَعَ الدَّاخِلِينَ)؛[١٠] إذ كانت كلٌّ من إمرأة نوح، وإمرأة لوط في عصمة نبيَّين صالحَين من عباد الله، وكانت واعلة زوجة نوح -عليه السلام - تُعين قومها على زوجها؛ حين كانت تتّهمه بالجنون، إلى جانب أنّها لم تؤمن بدعوته؛ فكان ذلك الأمر بمثابة خيانة لزوجها؛ ولذلك استحقّت تلك المرأة العذاب من عند الله -تعالى- مع مَن كَفر من قوم نوح، ولم تنفعها رابطة الزوجية مع رجل كانت مكانته عالية عند ربّه في دَفع العذاب عنها؛ فكلّ إنسان مسؤولٌ أمام ربّه عن نفسه. ",
    "part3":"السفينة معجزة سيدنا نوح \n ُجري الله -تعالى- المعجزات على أيدي أنبيائه، ورُسُله؛ تأييداً لهم في دعواهم أمام أقوامهم؛ والمعجزة هي أمر خارق للعادة، يخترق قوانين الكون، وما أَلِفَته النفوس، وتكون المعجزة مُقترِنة بالتحدّي، وتستحيل معارضتها بالإتيان بمثلها،[١٢] وقد كانت السفينة هي معجزة سيّدنا نوح -عليه السلام-؛ حيث أوحى الله إليه أن يصنعَها، حتى إذا جاء أمر الله، وفار التنّور الذي كان مصنوعاً من حجارة، علماً أنّ الله جعل فوران الماء منه علامة على مجيء أمره، وقد أمر الله نوحاً أن يحمل على السفينة من كلّ شيء حيٍّ زوجَين؛ ذكراً، وأنثى، ولم يثبت عدد الذين حُمِلوا على السفينة في الكتاب، أو السنّة، ثمّ أبحرت سفينة نوح بهم عبر المياه المرتفعة، تدفعها الريح الشديدة مُشكّلة بذلك ما يُشبه الجبال في عُلوّها، وعظمتها، ورُوِي عن ابن كثير أنّ طول الماء بلغ خمسة عشر ذراعاً كما ورد عند أهل الكتاب، بينما ورد في رواية أخرى أنّه بلغَ ثمانين ذراعاً. \n ويُشار إلى أنّ سفينة نوح -عليه السلام- كانت مصنوعة من الأخشاب، قال -تعالى-: (وَحَمَلْنَاهُ عَلَىٰ ذَاتِ أَلْوَاحٍ وَدُسُرٍ)؛[١٥] فقد بدأ نوح -عليه السلام- صناعة السفينة بأمر الله -تعالى- له؛ حيث جلب الأخشاب، وصَنع من مادّتها الألواح، ثمّ وضع الألواح بجانب بعضها البعض، وثبّتها بالدسر؛ أي المسامير، وكان قومه كلّما مَرّوا عليه يسخرون منه؛ لصُنعه السفينة على اليابسة، قال -تعالى-: (وَيَصْنَعُ الْفُلْكَ وَكُلَّمَا مَرَّ عَلَيْهِ مَلَأٌ مِّن قَوْمِهِ سَخِرُوا مِنْهُ ۚ قَالَ إِن تَسْخَرُوا مِنَّا فَإِنَّا نَسْخَرُ مِنكُمْ كَمَا تَسْخَرُونَ)،[١٦] وتجدر الإشارة إلى أنّ زوجة نوح، وابنه كانا ممّن تخلَّف عن ركوب السفينة؛ بسبب كُفرهم، وعصيانهم لنبيّهم؛[١٧] حيث دعا نوح -عليه السلام- ابنه إلى ركوب السفينة قبل أن تُبحر في المياه، وكانت دعوته لابنه؛ لعدم يقينه من كونه أحد الكافرين الذين كتب الله عليهم الغرق في الطوفان؛ ظانّاً بعودته عن الكفر، وقِيل إنّه كان يأمل من ابنه أن يراجع نفسه فيلتحق بالمؤمنين في السفينة، ويترك الكافرين، إلّا أنّه رفض الاستجابة لنداء أبيه بالانضمام إليه، والتجأ إلى المَعزل الذي ظنَّ أنّه سيحميه من الطوفان بعيداً عن أهل الإيمان مُعتقدِاً أنّه سينجو، إلّا أنّه لا عاصم من أمر الله في هذا اليوم العصيب سوى من كَتب الله له النجاة برحمته.",
    "part4":"عقوبة قوم نوح \n كانت عقوبة قوم نوح الذين كفروا الغرقَ بالطوفان؛ بسبب خطاياهم، ثمّ عقوبة النار في الآخرة، قال -تعالى-: (مِّمَّا خَطِيئَاتِهِمْ أُغْرِقُوا فَأُدْخِلُوا نَارًا فَلَمْ يَجِدُوا لَهُم مِّن دُونِ اللَّهِ أَنصَارًا )،[١٩][٦] وبعد أن نجّى الله نوحاً، ومن معه، استوَت سفينته على الجوديّ؛ وهو جبلٌ في الجزيرة كما رُوِي عن مجاهد، ورُوِي عن الضحّاك أنّه جبلٌ في الموصل.",

  },
  {
    "nabi" :"هود عليه السلام ",
    "color": Colors.deepPurpleAccent.withOpacity(0.7),
    "part1":"قصة النبي هود \n عد مضي عهد نوح عليه السلام ومرور اعوام وراء اعوام، كانت لا تزال هناك جماعات قليلة من المؤمنين الذي ورثوا عنه الايمان ومشوا علي طريقة مخلصين، وكانت هذه الجماعات المؤمنة تعيش في سعادة وهناء تشيد البنيات وتحيا بخير وأمان، إلا ان الشيطان جعل يوسوس لضعفاء هذه الجماعة ويقول لهم كذباً : يجب ألا تنسوا آباءكم الذين انجاهم الله من الطوفان لأنهم كانوا قوماً مؤمنين ويجب عليهم أن تخلدوهم وتمجدوهم وذلك بأن تقيموا لهم التماثيل وتقدموا لهم القرابين، حتي لا تكونوا خائنين لعهودهم .وكان هؤلاء الناس الذين وسوس لهم الشيطان هم ابناء عاد ويعرفون بقوم هود عليه السلام، وكانوا يسكنون ما بين اليمن وعمان في المنطقة التي تعرف بالاحقاف، وكانت ارضهم تتفجر بالينابيع والعيون وتزدهر بالزروع والاشجار، وكانوا يتميزون بالقوة والطول الشديد، وبدلاً من ان يعترفوا بفضل الله عليهم ويشكروا نعمته، فقد اغواهم الشيطان واعمي قلوبهم فأطاعوه واقاموا الاصنام والتماثيل ورفعوا الاوثان في ديارهم وعبدوها من دون الله، ولم يكتف قوم عاد بالرجوع الي الوثنيه فقط بل ساروا وراء الفساد والطغيان، حتي انتشر بينهم الظلم وانقلبت حياتهم رأساً علي عقب.",
    "part2":"جهاد هود مع قومه \n ومن رحمة الله سبحانه وتعالي انه اراد ان يظهر لهم طريق النور والايمان ليعودوا الي الحق فأرسل اليهم سيدنا هود عليه السلام رسولاً من انفسهم ليردهم الي طريق الصواب ويعيدهم الي الصراط المستقيم، وكان هود عليه السلام من عائلة متوسطة النسب في عاد ولكنه كان اكرمهم خلقاً وارجحهم عقلاً وكثرهم علماً فاختاره الله سبحانه وتعالي ليكون أميناً علي رسالته ويدعو قومه الي العودة للحق والايمان بالله تعالي وترك عبادة الاوثان .وكان هود عليه السلام يحاول بكل قوته أن يرد هؤلاء القوم عن عبادة الاوثان والاصنام وعن الظلم والمعاصي الي طريق النور والايمان والحق وعبادة الله سبحانه وتعالي وحده لا شريك له، وظل علي ذلك مدة طويلة من الزمن، ولكنهم لم يعودوا الى رشدهم بل قابلوا دعوته بالسخرية والاستهزاز، فتبرأ منهم وانذرهم بعذاب أليم سوف ينزله الله عليهم، لم يستجب القوم لهود عليه السلام واصروا علي عنادهم وطغيانهم، ورغم كل هذا لم تفلح دعوة هود عليه السلام مع قومة فرحوا يسخرون منه ويقولون له : ما هذا العذاب الذي تتوعدنا به والذي تقول إننا سنلفاه ؟ نحن لا نهتم بوعيدك وإن كنت صادقاً فأتنا بما تعدنا فلسنا خائفين من ذلك .",
    "part3":"نهاية قوم عاد \n عرف هود عليه السلام مقدار عنادهم واصرارهم علي الكفر، ومرت فترة علي ذلك انقطع خلالها نزول الامطار فجفت الانهار ويبست الاشجار والزروع، وماتت بعض الحيوانات من شدة العطش ، فأصبحوا ينتظرون هطول المطر بفارغ الصبر، ثم ظهرت في السماء سحابة سوداء فخرجوا من بيتهم فرحين وهم يظنون أن اصنامهم قد استجابت لهم واستبشروا بالامطار التي ستحمل الخير والزرق لهم، فجاءهم هود عليه السلام ينذرهم أن هذه السحب فيها العذاب والانتقام الذي استعجلوه ولكنهم لم يلتقتوا إليه بل سخروا منه، وفجأة رأوا حيواناتهم وامتعتهم تحملها رياح قوة وتقذف بها فامتلئت قلوبهم بالرعب والخوف واسرعوا يحتمون في بيوتهم، فنزل البلاء في ديارهم وتهدمت عليهم وبدأ الموت يحصدهم حصداً حتي لم يتبقي منهم أحداً .",
    "part4":"",
  },
  {
    "nabi" :"صالح عليه السلام",
    "color": Colors.deepPurple.withOpacity(0.7),
    "part1":"صالح -عليه السلام \n هو أحد أنبياء الله الذي أرسل للدعوة إلى توحيد الله وعبادته، وقد ذكرت قصة صالح مع قومه ثمود في سورة الشعراء في القرآن الكريم، ويعتبر قوم ثمود أحد القبائل العربية التي تنحدر من أصل أولاد سام بن نوح.",
    "part2":"قصة صالح مع قومه \n أرسل صالح -عليه السلام- إلى قبيلة ثمود، وهي قبيلة عربية كانت تسكن الحجب ما بين الحجاز وتبوت، وكانوا من عبدة الأصنام، ولا يؤمنون بالله سبحانه وتعالى، وكانوا في ضلال كبير، واجتمع بهم سيدنا صالح -عليه السلام-، ودعاهم إلى عبادة الله وحده وترك عبادة الأصنام، فرفضوا ذلك لأنهم لا يريدون ترك ما عبده آباؤهم وأجدادهم، وأصرّ عليهم وذكر لهم أن يعبدوا رب الناس الذي ينفعهم ويرزقهم، والذي جعلهم خلفاء من بعد قوم عاد، وذكرهم بنعم الله عليهم، فعندها كذبوه واتهموه بالجنون والسحر، فعندها قال لهم بأنه لا يريد منهم سوى الإيمان، وأنه رسولٌ من الله.",
    "part3":"معجزة صالح عليه السلام \n طلب قوم ثمود من سيدنا صالح معجزةً تصدق رسالته وتظهر صدقه، وعندها سألهم صالح عن المعجزة التي يريدونها، فأشاروا إلى صخرة كبيرة قريبة من المكان، وطلبوا من صالح أن يخرج من هذه الصخرة ناقة، وأخذوا يضعون شروطاً تعجيزية في مواصفات الناقة، فذهب صالح بعد ذلك إلى المصلى ودعا الله أن يخرج من الصخرة ناقة. وبعد ذلك خرجت من الصخرة ناقة وفق شروطهم وأمام أعينهم، فتعجب القوم وآمن بعضهم بصالح وهم قلة، والأكثرية استمرت في كفرها، وطلب من قومه أن يتركوا الناقة تشرب من البئر يوماً ثم يشربون منها في اليوم التالي وهكذا، وطلب منهم أن تبقى الناقة بينهم، وأصبحت الناقة تشرب يوماً من البئر، وفي اليوم التالي يأخذ القوم حاجتهم من ماء البئر، واستمروا على هذا الحال وهم يشربون من لبن الناقة.",
    "part4":"هلاك قوم صالح \n في أحد الأيام اجتمع القوم لمناقشة شأن الناقة، فتحاوروا حول قتلها أو إبقائها، ورفض بعضهم قتلها خوفاً من العقاب، وبعد ذلك قرروا نقلها، واجتمع تسعة من الرجال، وقتلوا الناقة ومن ثم قتلوا ولد الناقة، ووصل الخبر إلى صالح -عليه السلام-، وحذرهم من عذاب شديد من الله بعد ثلاثة أيام من معرفته الخبر، وأصبحوا يستهزئون بكلام صالح ولم يصدقوه، فقرروا الانتقام من صالح وقتله، وقد حلّ العذاب بالتسعة الذين قتلوا الناقة بإرسال حجارة عليهم، وذلك قبل أن يهلك الله قومهم. وفي الموعد الذي حدده صالح أي بعد ثلاثة أيام، في أول يوم كانت وجوهم مسفرة، وفي اليوم الثاني كانت وجوههم محمرة، وفي يوم السبت الثالث أصبحت وجوههم مسودة، فلما جاءت صبيحة يوم الأحد جلسوا ينتظرون العذاب المقرر لهم، فعندما خرجت الشمس جاءت صيحة من السماء ورجفة في الأرض من تحتهم، فهلكوا وكان ذلك عقاب عنادهم على الكفر.",

  },
  {
    "nabi" :"ابراهيم عليه السلام",
    "color": Color(0xff453658),
    "part1":"قصّة إبراهيم مع عبدة الأصنام \n كان قوم إبراهيم -عليه السلام- يعبدون الأصنام، وكان أبوه آزر ممّن يصنعونها، فبدأ إبراهيم دعوته بدعوة أبيه، وتذكيره بأنّ هذه الأصنام لا تضرّ، ولا تنفع، وكان يدعو والده باللين، والرِّفق، ولا يخاطبُه إلّا بقوله: يا أبتِ، إلّا أنّ أباه أصّر على موقفه، وطلب من إبراهيم أن يهجره، ويتركه، ثمّ انتقل إبراهيم إلى دعوة قومه؛ فأمرهم أوّلاً بترك عبادة الأصنام، ثمّ حاجَجهم في عبادة الكواكب، وقد ذُكِرت هذه المُحاجَجة في سورة الأنعام؛ حيث سألهم أوّلاً عن الكوكب الذي ظهر له إن كان هو إلهه، ثمّ لمّا غاب الكوكب قال لهم إنّ الإله لا يأفل ولا يغيب، وكرَّر ذلك مع كلٍّ من الشمس، والقمر، إلّا أنّهم أصرّوا على موقفهم.[٣] وقد واصل إبراهيم -عليه السلام دعوته لهم، فلمّا رأى منهم صدوداً أقسم لهم أنّه سيكيد أصنامهم، فلّما خرجوا من القرية أخذ يُكسِّر الأصنام كلّها إلّا كبيرها الذي تَرَكه، فلمّا عاد القوم إلى قريتهم، ورأوا أنّ أصنامهم قد تحطّمت، ذهبوا إلى إبراهيم كي يسألوه عن ذلك، فقال لهم إنّ كبيرَها هو من حطّمها فاسألوه، وإنّها لو كانت تعقل لاستطاعت حماية نفسها من الاعتداء، وعلى الرغم من أنّ صوابهم عاد إليهم في حينها؛ فكبيرها صَنَمٌ لا يسمع، ولا يبصر، إلّا أنّهم عادوا عن رشدهم،[٤] وتجدر الإشارة إلى أنّ إبراهيم -عليه السلام- كان مثالاً للداعية الصابر المُخلِص؛ حيث بذل للدعوة الكثير؛ فناظر قومه، وحاجَجهم، ولمّا لم يجدوا حُجّة، قرّروا أن يكيدوا له؛ وذلك بأن يُلقوه في النار التي جمعوا لها حطباً عظيماً، ثمّ أشعلوها، ولشدّة حرارتها وضعوا إبراهيم -عليه السلام- على منجنيق وقذفوه فيها، فقال -عليه السلام-: حسبي الله ونعم الوكيل، حيث روى البخاري في صحيحه عن ابن عبّاس -رضي الله عنه- أنّه قال: (كانَ آخِرَ قَوْلِ إبْرَاهِيمَ حِينَ أُلْقِيَ في النَّارِ: حَسْبِيَ اللَّهُ ونِعْمَ الوَكِيلُ)،[٥] فأمر الله -تعالى- النار بأن تكون برداً وسلاماً عليه، وأنجاه منها،[٣] قال -تعالى-: (قُلْنَا يَا نَارُ كُونِي بَرْدًا وَسَلَامًا عَلَىٰ إِبْرَاهِيمَ).",
    "part2":"قصّة إبراهيم مع النمرود \n اعتمد إبراهيم -عليه السلام- في نقاشه مع الكفّار أسلوب نقاشٍ يعتمد المناظرةَ؛ حيث ناظر النمرود؛ وهو ملك بابل، وكان جبّاراً مُتمرِّداً مُدَّعِياً للربوبيّة، وقد وردت مناظرته إيّاه في سورة البقرة، حيث قال -تعالى-: (أَلَمْ تَرَ إِلَى الَّذِي حَاجَّ إِبْرَاهِيمَ فِي رَبِّهِ أَنْ آتَاهُ اللَّهُ الْمُلْكَ إِذْ قَالَ إِبْرَاهِيمُ رَبِّيَ الَّذِي يُحْيِي وَيُمِيتُ قَالَ أَنَا أُحْيِي وَأُمِيتُ ۖ قَالَ إِبْرَاهِيمُ فَإِنَّ اللَّهَ يَأْتِي بِالشَّمْسِ مِنَ الْمَشْرِقِ فَأْتِ بِهَا مِنَ الْمَغْرِبِ فَبُهِتَ الَّذِي كَفَرَ ۗ وَاللَّهُ لَا يَهْدِي الْقَوْمَ الظَّالِمِينَ)،[٧] إذ استدلّ إبراهيم -عليه السلام- على وجود الله بالمشاهدات التي حوله من الكون؛ من موت، وحياة، فرَدّ عليه النمرود أنّ بإمكانه أن يأتيَ برجُلَين حُكِم عليهما بالقتل؛ فيقتل أحدهما، ويعفو عن الآخر، فيكون بذلك قد أمات الأول، وأحيا الثاني، وهذا خارج عن مقام المناظرة، إلّا أنّ إبراهيم -عليه السلام- ألجمَه حين ضرب له مثلاً بالشمس التي تُشرق من المشرق، وتحدّاه أن يأتيَ بها من المغرب إن استطاع، ولكنّ النمرود كان أضعف من ذلك، فبُهِت، وسكت. \n قصة إبراهيم مع الملائكة \n وردت قصّة لقاء إبراهيم -عليه السلام- مع الملائكة في القرآن الكريم في عدّة مواضع؛ حيث جاءه الملائكة زائرين مُبشِّرين، ومن حُسن إكرامه للضيف، سارع وجاءهم بطعام يأكلونه، وحين امتنعوا عن الأكل شعر -عليه السلام- بالخوف، والريبة منهم، فأخبروه أنّهم رُسُل الله -تعالى- إلى قوم لوط الذين حقّ عليهم عذاب الله -تعالى-، فراجعهم إبراهيم في ذلك؛ لأنّ فيهم لوطاً -عليه السلام-، وأهله، وهم مؤمنون، فبشّروه وزوجته بدايةً أنّ الله سيرزقهم إسحاقَ -عليه السلام-، ومن بعد إسحق يعقوبَ -عليه السلام-، فسكن قلبه، واطمأنَّ لهم، ثمّ عاد يجادلهم في عذاب قوم لوط، فرَدّوا عليه بأنّ هذا أمر الله -تعالى-، فقُضِي الأمر، وانتهى الجدال.",
    "part3":"قصة إبراهيم والطيور الأربعة \n ورد في القرآن الكريم الكثير ممّا يدلّ على قدرة الله -عزّ وجلّ- على البعث، ومنها ما ورد في قصّة إبراهيم -عليه السلام-؛ فقد طلب من الله -سبحانه- أن يُرِيَه كيفيّة إحياء الموتى، فعلى الرغم من أنّه كان مُؤمناً بذلك تمام الإيمان، إلّا أنّه أراد أن يطمئنّ قلبه بالأدلّة اليقينيّة، قال -تعالى- في كتابه الكريم: (وَإِذْ قَالَ إِبْرَاهِيمُ رَبِّ أَرِنِي كَيْفَ تُحْيِي الْمَوْتَىٰ قَالَ أَوَلَمْ تُؤْمِن قَالَ بَلَىٰ وَلَـٰكِن لِّيَطْمَئِنَّ قَلْبِي)،[١٠] فأمره الله -تعالى- أن يأخذ أربعة طيور، ويمزّقها، ويخلط أجزاءها معاً، ثمّ يجل كلّ جزء من هذه الأجزاء على جبل، وأمره بعد ذلك أن يدعوها إليه، ففَعَل -عليه السلام- ما أمره الله به، فجاءته الطيور وقد عادت إلى ما كانت عليه من الصورة، والحركة، والحياة، قال -تعالى-: (قَالَ فَخُذْ أَرْبَعَةً مِّنَ الطَّيْرِ فَصُرْهُنَّ إِلَيْكَ ثُمَّ اجْعَلْ عَلَىٰ كُلِّ جَبَلٍ مِّنْهُنَّ جُزْءًا ثُمَّ ادْعُهُنَّ يَأْتِينَكَ سَعْيًا وَاعْلَمْ أَنَّ اللَّـهَ عَزِيزٌ حَكِيمٌ) \n هجرة إبراهيم عليه السلام \n ذكر الله -سبحانه- هجرة إبراهيم في ثلاثة مواضع من القرآن؛ حيث قال على لسان إبراهيم: (وأَعْتَزِلُكُمْ وَمَا تَدْعُونَ مِن دُونِ اللَّهِ)،[١٢] وقال: (وَقَالَ إِنِّي مُهَاجِرٌ إِلَىٰ رَبِّي)،[١٣] وقال: (وَنَجَّيْنَاهُ وَلُوطًا إِلَى الْأَرْضِ الَّتِي بَارَكْنَا فِيهَا لِلْعَالَمِينَ)،[١٤] وفي ما يأتي بيان الهجرات الثلاث. \n هجرة إبراهيم إلى الشام \n خرج إبراهيم -عليه السلام- بنفسه، وزوجته سارة، وابن أخيه لوط -عليه السلام- إلى بلاد الشام، وقِيل إنه نزل حرّانَ فارّاً بدينه يدعو إلى الله، ويعبده، فأقام فيها مدّة، إلّا أنّ هذه البلاد تعرّضت للقحط، والجوع، فارتحل -عليه السلام- وأهله إلى مصر.",
    "part4":"هجرة إبراهيم إلى مصر \n خرج إبراهيم -عليه السلام- من أرض الشام إلى مصر برفقة زوجته سارة، وحين علم ملك مصر آنذاك بقدوم إبراهيم ومعه امرأة حَسنة جميلة، بعثَ في طلبها؛ ليتزوّجها، وكان هذا الملك يأخذ نساء الرجال غصباً، فأخبره إبراهيم بأنّها أخته، فحاول الملك أن يلمس سارة، فلم يستطع؛ إذ تحجّرت يداه، فطلب منها أن تدعوَ الله أن يعيدهما إلى ما كانتا عليه، ففعلت، وكرّر فعلته مرّة أخرى، فلمّا تحجّرت يداه مرّة أخرى، طلب منها أن تدعو له، فدعَت له، فأُطلِقت يداه مرّة أخرى،[١٦] 30 ثمّ أعطى لها هاجرَ؛ لتخدمَها. \n هجرة إبراهيم إلى مكّة \n أهدَت سارة زوجها إبراهيم -عليه السلام- هاجر الجارية؛ ليتزوّجها، فحملَت منه، وأنجبَت نبيّ الله إسماعيل -عليه السلام-، ولأنّ سارة كانت عاقراً فقد غارت من هاجر، فأخذ إبراهيم هاجر وابنها، وخرج بهم إلى الشام، ثمّ إلى مكّة المُكرَّمة وتركهم هناك، ثمّ عاد، وحين نفد ما كان عندهم من الماء والطعام، صار طفلها يتلوّى من شدّة العطش، وطفقت هاجر تسعى بين جبليَن، وهما ما يُعرَفان بالصفا، والمروة، وتدعو الله، فأتاها جبريل بعد أن أنهَت سبعة أشواط عند موضع زمزم، وفجّرَ لها بأمر الله ماء زمزم، فجعلت تحوطه بيدها، ومرّت السنين وإسماعيل وهاجر في مكّة، ولمّا كبر إسماعيل -عليه السلام-، وبلغ أَشدّه، رأى إبراهيم -عليه السلام- في المنام أنّه يذبحه، فامتثل أمرَ الله، وأخبر ابنَه برؤياه، فامتثل الآخر لأمر الله، وحين وضعه على الأرض، وأمسك السكّين؛ ليذبحَ ابنه، أنزل الله ذِبحاً عظيماً؛ فداءً له؛ إذ لم يكنِ القصد إزهاق روح إسماعيل، بل كان ابتلاءً من الله لهما؛ ليرى إخلاصهما، واستسلامهما لأوامره \n بناء إبراهيم الكعبةَ مع ابنه إسماعيل \n بيّن الله -تعالى- لإبراهيم وإسماعيل أساسات البيت الحرام التي كانت قد دُفِنت في الأرض منذ وقت طويل،[١٩] ثمّ أمرهما ببناء الكعبة المُشرَّفة؛ فكان إسماعيل يجمع الحجارة، ويأتي بها إلى أبيه الذي كان يرفع البناء، فلمّا ارتفع البناء وضعَ إبراهيم حجراً ووقف عليه، وقد عُرِفَ هذا المكان ب(مقام إبراهيم)، وتجدر الإشارة إلى أنّهما -عليهما السلام- كانا يبنيان الكعبة، ويدعوان الله -تعالى- ويقولان: (رَبَّنَا تَقَبَّلْ مِنَّا ۖ إِنَّكَ أَنتَ السَّمِيعُ الْعَلِيمُ)،[٢٠][١٨] وقد طهّرا البيت ممّا لا يليق به من النجاسات، والقذارات؛ امتثالاً لأمر الله؛ ليكون مكاناً مناسباً للصلاة، والعبادة، ودعَوا الله أن يجعل من ذريّتهما أمّة مسلمة مُوحِّدة لله لا تُشرك به شيئاً، فاستجاب -سبحانه- لهما، وجعل في ذُرّية العرب من نَسل إسماعيل أمّة مُوحِّدة، كما بعث من ذُرّيته محمد -صلّى الله عليه وسلّم-، حيث ورد في قوله -تعالى-: (رَبَّنَا وَاجْعَلْنَا مُسْلِمَيْنِ لَكَ وَمِن ذُرِّيَّتِنَا أُمَّةً مُّسْلِمَةً لَّكَ وَأَرِنَا مَنَاسِكَنَا وَتُبْ عَلَيْنَا إِنَّكَ أَنتَ التَّوَّابُ الرَّحِيمُ*رَبَّنَا وَابْعَثْ فِيهِمْ رَسُولًا مِّنْهُمْ يَتْلُو عَلَيْهِمْ آيَاتِكَ وَيُعَلِّمُهُمُ الْكِتَابَ وَالْحِكْمَةَ وَيُزَكِّيهِمْ إِنَّكَ أَنتَ الْعَزِيزُ الْحَكِيمُ).",

  },
  {
    "color": Colors.indigo.withOpacity(0.7),
    "nabi" :"لوط عليه السلام",
    "part1":"قوم لوط \n أرسل الله النبيّين مُبشرين ومُنذرين، وبعث معهم الرّسالات والمعجزات التي تؤيّد صدق أقوالهم واتّصالهم بربّ العالمين ووحيه، لكنّ أنبياء الله قُوبلوا بالكفر والجحود من أقوامهم، وذلك للعديد من الأسباب؛ منها: أنّهم اعتادوا الإشراك بالله تعالى، وعبادة الأوثان أو غيرها، فثقل عليهم التوحيد، والسبب الآخر أنّ مصالح بعض الأقوام تتعارض مع الاستقامة والدين؛ كالمصالح المادية وغير ذلك من الأهواء التي يفضّلونها على طاعة الله ورضوانه، ومن بين الأنبياء الذين جاهدوا في سبيل الله محاولين أخذ أقوامهم إلى رضا الله وجنانه نبيّ الله لوط عليه السلام. سكن قوم لوط منطقة سدوم في قرى الأردن، التي قيل إنّها في مكان البحر الميّت الآن، وقد أرسل لهم الله -تعالى- رسالة التوحيد مع نبيّهم لوط عليه السلام، وهو ابن أخ إبراهيم الخليل عليهما السلام، فأرشدهم إلى التوحيد ودعاهم إلى طاعة الله ورضوانه، لكنّ أمر الله -تعالى- شُقّ عليهم، إذْ كان من صفاتهم السيّئة أنّ الرجال منهم يأتون الرجال على غير ما فطرهم الله تعالى، وكان من شريعة لوط -عليه السلام- ترك تلك الفاحشة والتوبة منها، لكنّ قوم لوطٍ كرهوا ذلك وهدّدوا لوطاً بإخراجه من قريتهم إنْ أصرّ عليهم، واستمرّ لوط على دعوته وجهاده، واستمرّ قومه على كفرهم وفسقهم حتى أذن الله -تعالى- بعذابهم، فهلكوا، وكان من بينهم زوجة لوط -عليه السلام- التي لم تتبع أمر الله -تعالى- فكانت من الهالكين.",
    "part2":"قصة لوط عليه السلام \n ورد في كُتب التاريخ أنّ نسب لوط -عليه السلام- هو: لوط بن هارون بن تارح وتارح هو آزر، ولوط -عليه السلام- هو ابن أخ إبراهيم عليه السلام، وذُكِر اسم لوط أكثر من خمسٍ وعشرين مرّةٍ في القرآن الكريم، كما ذُكرت تفاصيل مواقفه مع قومه مراراً،[٢] وقصة لوط بدأت حينما أرسله الله -تعالى- إلى قومه ليعلّمهم توحيد الله وترك الفاحشة التي كانت ظاهرة في قومه ومنتشرة كثيراً، لكنّ قوم لوط لم يستجيبوا لأمره ولم ينتهوا عن فعلهم القبيح الذي كانوا يأتونه، حيث هدّدوه بالإخراج من قريتهم، ولم يكن مسوّغ ذلك إلّا طهارته، ونقائه، وتوحيده، وصرّحوا له بذلك، حيث قال الله تعالى: (أَخْرِجُوا آَلَ لُوطٍ مِنْ قَرْيَتِكُمْ إِنَّهُمْ أُنَاسٌ يَتَطَهَّرُونَ)،[٣] وفي ذلك تمادٍ واضح وفسق وتكبّر، إذْ لم يكتفوا بتبجّحهم بالفاحشة، بل إنّهم كرهوا من يدعوهم إلى الطهر وأعمال الفطرة، ثمّ تحدّوا نبيهم لوطاً -عليه السلام- أن يحلّ بهم العذاب الذي توعّدهم به في حال كفرهم واستمرار ذنوبهم، قال الله تعالى: (ائْتِنَا بِعَذَابِ اللَّهِ إِنْ كُنْتَ مِنَ الصَّادِقِينَ)،[٤] وحينئذٍ دعا لوط -عليه السلام- الله -تعالى- أن ينصره وينصر دعوته على الكافرين.",
    "part3":"ضيوف إبراهيم وقوم لوط \n بعد أن دعا لوط -عليه السلام- بالنصرة من الله تعالى؛ أرسل الله ملائكته؛ جبريل وإسرافيل ووميكائيل عليهم السلام، ليُوقعوا العذاب على الكافرين، حيث مرّوا الملائكة أولاً على قرية إبراهيم عليه السلام قبل أن يذهبوا إلى لوط، حيث بشّروا إبراهيم بولده إسحاق وولد ولده يعقوب عليهم السلام، وأخبروا إبراهيم أنّهم أتوا ليوقعوا العذاب في قرى قوم لوط، فخاف إبراهيم واهتمّ لذلك الخبر، وجادل الملائكة خشيةً على ابن أخيه لوط، فطمأنته الملائكة أنّ الله سينجي لوطاً عليه السلام، وسيهلك باقي القوم، ومن بينهم زوجة لوط؛ لأنّها لم تتّبع رسالة زوجها التي أرسله بها الله تعالى.[٦] توجّهت الملائكة بعد ذهبت إلى إبراهيم إلى قرى قوم لوط، واستأذنوا لوطاً ليدخلوا بيته، ففرح لوط في ضيوفه وأدخلهم، لكنّه خشي أن يفضحه قومه إذا رأوا الرجال، وخاصّةً أنّ الملائكة كانوا على هيئة رجالٍ في منتهى الجمال، وحصل ما خشيه لوط؛ إذ أخبرتهم زوجة لوط بوجود رجال عند زوجها، فلمّا سمع القوم الخبر ذهبوا مُسرعين يفاوضون لوطاً ليدخلوا على ضيوفه، فحاول لوط إقناعهم وثنيهم عن ذلك، إلّا أنّهم رفضوا الاستماع له، حيث قال الله تعالى: (وَجاءَهُ قَومُهُ يُهرَعونَ إِلَيهِ وَمِن قَبلُ كانوا يَعمَلونَ السَّيِّئَاتِ قالَ يا قَومِ هـؤُلاءِ بَناتي هُنَّ أَطهَرُ لَكُم فَاتَّقُوا اللَّهَ وَلا تُخزونِ في ضَيفي أَلَيسَ مِنكُم رَجُلٌ رَشيدٌ*قالوا لَقَد عَلِمتَ ما لَنا في بَناتِكَ مِن حَقٍّ وَإِنَّكَ لَتَعلَمُ ما نُريدُ)،[٧] فلمّا رأت الملائكة الكرب الذي حلّ بلوط -عليه السلام- وهو يحاول إقناع قومه، أخبروه بأنّهم ملائكة، ولن يستطيع أحد إيذائهم.",
    "part4":"عذاب قوم لوط \n بعد أن أخبرت الملائكة لوطاً -عليه السلام- أنّهم ملائكة مُرسلون من ربّ العالمين، وأنّهم أُرسلوا ليهلكوا القوم الكافرين، وطلبوا منه أن يخرج مع أهله من القرية ليلاً؛ لأنّ العذاب سيحلّ على قومه صباحاً، وطلبوا منه وممّن معه ألّا يلتفتوا إلى خلفهم لينظروا إلى عذاب الكافرين، فتجهّز لوط ومَن آمن معه وخرجوا في طريقهم، ورُوي أنّ جبريل -عليه السلام- قَلَبَ قرى قوم لوط بريشةٍ من جناحه، وقيل: إنّ قرى قوم لوط كانت أربع أو خمس قرى، حيث قدّر ساكنيها بأربعمئةِ ألفٍ، حيث سمع أهل السماء نباح كلابهم وأصواتهم عند حلول العذاب بهم، فصار عاليها سافلها، وأُرسل عليهم صيحةً ومطراً من الحجارة تتبع بعضها بعضاً، وقيل: إنّ كلّ حجر مكتوب عليه اسم الرجل الذي سيقتله، وكانت زوجة لوط قد خرجت معه أيضاً، إلّا أنّها عندما بدأ العذاب يحلّ بالكافرين سمعت أصواتهم وصراخهم فالتفتت تصرخ واقوماه، قال الله -تعالى- عن عذابهم: (وَكَذلِكَ أَخذُ رَبِّكَ إِذا أَخَذَ القُرى وَهِيَ ظالِمَةٌ إِنَّ أَخذَهُ أَليمٌ شَديدٌ).",

  },
  {
    "nabi" :"شعيب عليه السلام",
    "color": Colors.deepPurpleAccent.withOpacity(0.7),
    "part1":"نبي الله شُعيب \n هو نبيّ الله شعيب بن ميكيل بن يشجر بن مدين، من نسل إبراهيم عليه السلام، وقيل هو ابن بنت نبيّ الله لوط، وقيل غير ذلك، وهو من الأنبياء العرب كما ورد عن رسول الله صلّى الله عليه وسلّم، اشتُهر بالفصاحة والبلاغة، وقد كلّفه الله -تعالى- بحمل الرسالة إلى قومه، فدعاهم إلى الإيمان، والتوحيد، وأمّا قبيلته فهي مدين، وهم قوم عرب سكنوا بلاد الحجاز، ممّا يلي جهة الشام، قريباً من خليج العقبة، قريباً من أرض معان، وهي كذلك قريبة من أرض قوم لوط عليه السلام، حيث ذُكر ذلك في القرآن الكريم بقول الله تعالى: (وَمَا قَوْمُ لُوطٍ مِّنكُم بِبَعِيدٍ).[١][٢] كان قوم شعيب -عليه السلام- على دين إبراهيم عليه السلام، موحّدون، يعبدون الله تعالى، لكنّهم ما لبثوا أن غيّروا دينهم، وانحرفوا عن طريق التوحيد، فقد كانوا أصحاب تجارةٍ عظيمةٍ، وأموالٍ كثيرةٍ، يتنقّلون بقوافلهم التجارية بين اليمن والشام، وبين العراق ومصر، فانشغلوا بذلك عن دينهم، وعبادة ربّهم، وسيطر حبّ المال والربح على تفكيرهم وأولويّاتهم، وبلغ بهم ذلك إلى أن يطفّفوا المكيال، ويغشّوا بيعهم؛ طمعاً في تحقيق المزيد من الأرباح والأموال، فأكلوا الحرام وهم يعلمون، ثمّ فسدت أخلاقهم أكثر فصاروا يقطعون الطرق على تجارة غيرهم، يسرقونها، ويخيفون أصحابها، ثمّ زادوا على ذلك أن زاغوا عن عبادة ربّهم إلى عبادة شجر الأيك، فكانوا أصحاب الأيكة كما قال فيهم الله تعالى، فكان هذا حالهم حين بُعث فيهم نبيّ الله شعيب عليه السلام.",
    "part2":"عذاب قوم شُعيب \n جاء نبيّ الله شُعيب -عليه السلام- قومه بالتوحيد، وأمرهم بالأخلاق الحسنة، وعدم تطفيف الميزان، وأعلمهم حُرمة ذلك، وعظمه عند ربّ العالمين، فكفر قومه بقوله، وكذّبوه، واستهزؤوا به وبصلاته، فلم يطُل إنذار الله -تعالى- لهم، حتى أدركهم عذابه، وتحقّق وعيده، حيث أرسل عليهم الله -تعالى- ألواناً متعدّدةً من العذاب؛ جزاء كفرهم وسوء أفعالهم، فأسكن الهواء عليهم سبعة أيّام، فشعروا بالحرّ الشديد الذي لم ينفع معه ظلّ ولا ماء، فخرجوا من ديارهم باتجاه البريّة؛ باحثين عن ظلّ وراحة، فأرسل الله عليهم غيمةً عظيمةً، فسُعدوا بها، فتنادوا يستظلّون بظلّها، فلمّا أقبلوا جميعاً في مكانٍ واحدٍ أذن الله -تعالى- للظُّلل أن ترميهم بالشرار والنار، ثمّ جاءتهم رجفة عظيمة زلزلت الأرض من تحت أقدامهم، وألقت بجثثهم على الأرض ساكنةً لا حِراك لها، وزامن ذلك إرسال صيحة من السماء أسكتت أصواتهم، فكان هذا هلاكهم، ولقد مرّ بهم نبيّهم شعيب -عليه السلام- بعد ذلك، فعاتبهم، وقال لهم: (وَقالَ يا قَومِ لَقَد أَبلَغتُكُم رِسالَةَ رَبّي وَنَصَحتُ لَكُم وَلـكِن لا تُحِبّونَ النّاصِحينَ).",
    "part3":"دعوة شُعيب لقومه \n بدأ شُعيب -عليه السلام- دعوة قومه؛ بتوجيههم إلى توحيد الله تعالى، وترك ما يشركون، فإنّ أوّل ما يُدعى إليه الكافر هو توحيد الله تعالى، وعبادته، حيث قال الله تعالى: (وَإِلَى مَدْيَنَ أَخَاهُمْ شُعَيْبًا قَالَ يَا قَوْمِ اعْبُدُوا اللَّهَ مَا لَكُمْ مِنْ إِلَهٍ غَيْرُهُ)،[٥] فإنْ آمن المرء وصحّت عقيدته؛ سهُلت عليه أوامر المعبود وشرائعه، لكنّ قوم شعيب -عليه السلام- لم يتّبعوا نبيّهم، ولم يوافقوه على دعوته، بل كفروا، وأنكروا ما جاء به، فانتقل إلى ما دون ذلك أن يوجّههم إلى خير الأخلاق ورفيعها، فلا يصحّ أن يطفّفوا الميزان، فيغشّوا الناس ويسترزقوا جرّاء ذلك، قال الله تعالى: (وَيَا قَوْمِ أَوْفُوا الْمِكْيَالَ وَالْمِيزَانَ بِالْقِسْطِ)،[٦] وذكّرهم بأنّ الحلال القليل خيرٌ من الحرام الكثير، فهذه أرزاق الله -تعالى- لا تزال تأتيهم، وتتنزّل عليهم فليكتفوا بذلك، ولا يجرّهم الطمع إلى عاقبةٍ سيّئة، قال الله سُبحانه: (بَقِيَّتُ اللَّهِ خَيْرٌ لَكُمْ إِنْ كُنْتُمْ مُؤْمِنِينَ وَمَا أَنَا عَلَيْكُمْ بِحَفِيظٍ)،[٧] فحذّرهم أنّه ناصح لهم، لكنّه لن يستطيع أن يكشف عنهم العذاب إذا حلّ بهم.[٨] بعد كلّ الأساليب اللينة الناصحة التي انتهجها شعيب -عليه السلام- لنُصح قومه وإرشادهم، لم يبدر منهم إلّا الكفر والعِناد، واتّهامه بالتدخّل في شؤونهم الشخصيّة، حيث زعموا أنّ هذه أموالهم الخاصّة، وليس لأحدٍ الحقّ في التدخّل بكيفيّة إنمائها، والعمل بها، متناسين أنّها رزق الله -تعالى- لهم، وردّوا على نبيّهم متهكّمين ساخرين، وقال الله -عزّ وجلّ- في ذلك: (أَصَلَاتُكَ تَأْمُرُكَ أَنْ نَتْرُكَ مَا يَعْبُدُ آبَاؤُنَا أَوْ أَنْ نَفْعَلَ فِي أَمْوَالِنَا مَا نَشَاءُ إِنَّكَ لَأَنْتَ الْحَلِيمُ الرَّشِيدُ)،[٩] لكنّ شعيباً -عليه السلام- قابلهم باللين مجدّداً، وذكّرهم بأنّه نبيّ من الله سبحانه، قد اختصّه الله بالرسالة والوحي، وأنّه إن أمرهم بشيء كان هو أوّل من طبّق هذا وأتاه، قال الله تعالى: (وَمَا أُرِيدُ أَنْ أُخَالِفَكُمْ إِلَى مَا أَنْهَاكُمْ عَنْهُ).[١٠][٨] ولم يكتفِ شعيب -عليه السلام- بهذا الحدّ، فقد كان مخلصاً لدعوة قومه، راغباً إيّاهم أن يتّبعوه فيكونوا من المكرمين الناجين، فعاد وذكّرهم بإهلاك الأقوام من قبلهم، كيف كانوا وكيف صاروا، قال الله -تعالى- في ذلك: (وَيَا قَوْمِ لَا يَجْرِمَنَّكُمْ شِقَاقِي أَنْ يُصِيبَكُمْ مِثْلُ مَا أَصَابَ قَوْمَ نُوحٍ أَو قَومَ هودٍ أَو قَومَ صالِحٍ وَما قَومُ لوطٍ مِنكُم بِبَعيدٍ)،[١] فخوّفهم حال من قبلهم؛ لعلّهم يرجعون إلى دينهم وتوحيدهم، لكنّ التمادي بالباطل كان صفة لديهم، فجاؤوا بحُجّةٍ جديدةٍ هذه المرّة، فردّوا على نبيّهم، حيثث قال الله: (قَالُوا يَا شُعَيْبُ مَا نَفْقَهُ كَثِيرًا مِمَّا تَقُولُ وَإِنَّا لَنَرَاكَ فِينَا ضَعِيفًا وَلَوْلَا رَهْطُكَ لَرَجَمْنَاكَ وَمَا أَنْتَ عَلَيْنَا بِعَزِيزٍ)،[١١] فكان خطابه وردّه لهم كما كلّ مرّةٍ فيه من اللين، والحِكمة، والحُجّة الشيء الظاهر، لكنّهم قوم مرائين، ابتغوا الجدال لا الوصول إلى الحقيقة، فعندما طال كفرهم وتكذيبهم توجّه إليهم نبيّهم بقوله: (وَيَا قَوْمِ اعْمَلُوا عَلَى مَكَانَتِكُمْ إِنِّي عَامِلٌ سَوْفَ تَعْلَمُونَ مَنْ يَأْتِيهِ عَذَابٌ يُخْزِيهِ وَمَنْ هُوَ كَاذِبٌ وَارْتَقِبُوا إِنِّي مَعَكُمْ رَقِيبٌ)،[١٢] وبعدها لم يطل تكذيبهم حتى لحقهم من عذاب الله ما لحقهم.",
    "part4":"وفاة شُعيب عليه السلام \n مات نبيّ الله شعيب -عليه السلام- بعد حينٍ من إهلاك الكافرين، وقد جاءت منيّته في الأردن، ودُفن فيها، وقبره موجود في وادي شعيب، وهو مقام معروف ومشهور يؤتى إليه، وقيل: إنّه مات في مكّة، ومن نجا معه من المؤمنين، وقبورهم غربيّ الكعبة؛ بين دار الندوة ودار بني سهم",
  },
  {
    "nabi" :"اسماعيل عليه السلام",
    "color": Colors.deepPurple.withOpacity(0.7),
    "part1":"قصة سيدنا اسماعيل \n كانت السيدة سارة زوجة سيدنا إبراهيم عليه السلام عاقرا و ﻻ تستطيع الإنجاب و كان سيدنا إبراهيم يريد أن يكون لديه ذرية صالحة لعبادة الله، اقترحت السيدة سارة أن يتزوج إبراهيم عليه السلام من هاجر حتى ينجب منها و كانت هاجر خادمة السيدة سارة.و تزوج إسماعيل من هاجر و أنجب منها إسماعيل عليه السلام، ثم أمر الله سيدنا إبراهيم أن يأخذ زوجته هاجر و أبنه إسماعيل و يذهب بهم إلى مكة ثم ذهب بهم إلى موضع بناء الكعبة كان المكان فارغ تمام ﻻ يوجد به أي بشر و أمر الله إبراهيم أن يتركهم هناك و يعود إلى الشام.",
    "part2":" بئر زمزم \n ترك إبراهيم زوجته وولده وترك معهم بعض الشراب والطعام وأتجه نحو الشام، ودعي ربه أن يرزقهم بقيت هاجر مع طفلها ترضعه ولما نفذ الطعام والشراب ظل الطفل يبكي من شدة العطش تركته هاجر وذهبت تبحث عن الماء وظلت تمشى حتى وصلت إلى جبل الصفا وصعدت عليه.وظلت تنظر في كل أتجاه لعلها تجد بئر ماء أو طعام لكنها لم تجد شيئا نزلت هاجر من على جبل الصفا وصعدت على جبل المروة، وأخذت تنظر حولها بحثا عن ماء أو شراب أو أي بشر يساعدها هي وطفلها ولكنها لم تجد شيئا. وظلت هاجر تنتقل بين جبل الصفا وجبل المروة سبع مرات، تعبت هاجر ثم ذهبت لطفلها وحدث وقتها معجزة جاء جبريل وضرب الأرض وخرج منها ماء بئر زمزم ظلت هاجر تشكر الله على نعمته وأخذت تسقى طفلها.",
    "part3":"رؤية ذبح إسماعيل \n كان هناك قبيلة يمنية أسمها جرهم تسير في ذلك المكان رأت القبيلة طائر من بعيد يحوم حول البئر فعرفت القبيلة أن هناك ماء في ذلك المكان فذهبوا لمكان البئر، ووجدوا هاجر وطفلها يجلسان بجوار البئر وتعجبوا لوجود هاجر في ذلك المكان وحدها هي وطفلها قصت عليهم هاجر ما حدث وطلبوا أنها أن يقيموا بجوار البئر.ووافقت هاجر على طلبهم ومرت سنين وكبر إسماعيل وظلت هاجر تربيه تربية حسنة وتعلم إسماعيل اللغة العربية من قبيلة جرهم، وكان سيدنا إبراهيم يذهب ليرى هاجر وإسماعيل كل فترة ويطمئن عليهم وذات ليلة رأى إبراهيم في المنام إنه يذبح ابنه علم إبراهيم أن ذلك أمر من الله ويجب أن ينفذه قال إبراهيم لأبنه لقد رأيت في المنام أني أذبحك وذلك أمر من الله.قال إسماعيل يا أبي أفعل ما تؤمر وستجدني إن شاء الله من الصابرين، أخذ إبراهيم ابنه إسماعيل وألقاه على وجهه حتى ﻻ يرى وجهه وهو يذبحه، ثم وضع السكين على رقبته فسمع إبراهيم نداء الله يقول لقد صدقت الرؤية وكذلك نجزي المحسنين وجاء جبريل بكبش ليذبحه إبراهيم مكان إسماعيل.",
    "part4":"",

  },
  {
    "nabi" :"اسحاق عليه السلام",
    "color": Color(0xff453658),
    "part1":"نسب سيدنا اسحاق \n هو سيدنا إسحاق بن سيدنا إبراهيم عليهما الصلاة والسلام، وهو الولد الثاني لإبراهيم الذي بشرته به الملائكة ، فقد أكد المؤرخون على أن عمر سيدنا ابراهيم عليه السلام  عندما بشرته الملائكة بابنه اسحاق مائة وعشرين سنة وكان عمر سارة تسعين سنة . و قد ذُكر سيدنا اسحاق في القرآن الصفات الحميدة وجعله نبيًا ورسولًا ، و قد كرمه الله تعالى هو و ذريته ، و قد مدح رسول الله صلى الله عليه وسلم نبي الله إسحاق وأثنى عليه عندما قال : “إنَّ الكريم ابن الكريم ابن الكريم ابن الكريم يوسف بن يعقوب بن إسحاق بن إبراهيم",
    "part2":"رسالة سيدنا اسحاق \n دعا سيدنا اسحاق عليه السلام إلى عبادة الله الواحد الأحد ، و قد أوحى له الله تعالى بشريعة مبنية على الدين الإسلامي الحنيف ، و قد أرسله الله تعالى للكنعانيين ، و هم قوم كانوا يسكنون في بلاد الشام ، و المناطق الواقعة حول فلسطين في الوقت الحالي . و قد أشار المؤرخون إلى أن سيدنا ابراهيم عليه السلام قد أوصى سيدنا اسحاق بألا يتخذ زوجة إلا من أهل ابيه ، و بالفعل ، تزوج سيدنا اسحاق من رفقة بنت ابن عمه ، و من بين المعجزات التي حدثت لسيدنا اسحاق ، أن زوجته كانت عاقرًا ، فدعا الله لها فحملت فولدت غلامين توأمين أحدهما اسمه العيص ، و الثاني يعقوب و هو نبي الله إسرائيل .",
    "part3":"وفاة سيدنا اسحاق \n في الكثير من الروايات أشار العلماء إلى أن سيدنا اسحاق عليه السلام قد عاش قرابة مائة و ثمانين سنة ، حتى توفاه الله في قرية حبرون ، و هي قرية في فلسطين ، و هي ما يُطلق عليها مدينة الخليل في وقتنا الحالي ، و هي أيضًا المدينة التي كان يسكن فيها سيدنا ابراهيم عليه السلام . و بعد وفاة سيدنا اسحاق ؛ قام ابناه العيص و يعقوب عليه السلام بدفنه في المغارة التي دفن فيها أبوه إبراهيم عليهما السلام ، و قد ذُكر سيدنا اسحاق في التوراه بعد تحريفها بشكل مهين لا يجوز نسبتها إلى نبي من أنبياء الله ولا عبرة بروايتها في بعض الكتب فليس كل ما يروى صحيحًا ، فقد كانوا يقولون أن عيصًا كان أحب لأبيه من يعقوب و أن يعقوب كان أحب إلى أمه .  و قد ذكر في القرآن الكريم بكل تشريف ، كما في قوله تعالى : ” هَلْ أَتَاكَ حَدِيثُ ضَيْفِ إِبْرَاهِيمَ الْمُكْرَمِينَ * إِذْ دَخَلُوا عَلَيْهِ فَقَالُوا سَلَاماً قَالَ سَلَامٌ قَوْمٌ مُّنكَرُونَ * فَرَاغَ إِلَى أَهْلِهِ فَجَاء بِعِجْلٍ سَمِينٍ * فَقَرَّبَهُ إِلَيْهِمْ قَالَ أَلَا تَأْكُلُونَ * فَأَوْجَسَ مِنْهُمْ خِيفَةً قَالُوا لَا تَخَفْ وَبَشَّرُوهُ بِغُلَامٍ عَلِيمٍ * فَأَقْبَلَتِ امْرَأَتُهُ فِي صَرَّةٍ فَصَكَّتْ وَجْهَهَا وَقَالَتْ عَجُوزٌ عَقِيمٌ * قَالُوا كَذَلِكَ قَالَ رَبُّكِ إِنَّهُ هُوَ الْحَكِيمُ الْعَلِيمُ” ، سورة الذاريات .",
    "part4":"",

  },
  {
    "color": Colors.indigo.withOpacity(0.7),
    "nabi" :"يعقوب عليه السلام",
    "part1":"هو يعقوب بن إسحاق بن إبراهيم، وأمّه هي رفقة بنت بتوئيل بن ناصور بن آزر، أيّ بنت ابن عمه، وهو المسمّى بإسرائيل؛ لانتساب بني إسرائيل إليه، وقد ورد ذلك في القرآن الكريم بقول الله تعالى: (كُلُّ الطَّعَامِ كَانَ حِلًّا لِّبَنِي إِسْرَائِيلَ إِلاَّ مَا حَرَّمَ إِسْرَائِيلُ عَلَى نَفْسِهِ مِن قَبْلِ أَن تُنَزَّلَ التَّوْرَاةُ قُلْ فَأْتُواْ بِالتَّوْرَاةِ فَاتْلُوهَا إِن كُنتُمْ صَادِقِينَ)،[١] وقد امتدحه الله -سبحانه- في القرآن الكريم فقال فيه: (وَبَشَّرْنَاهُ بِإِسْحَاقَ نَبِيًّا مِّن الصَّالِحِينَ*وَبَارَكْنَا عَلَيْهِ وَعَلَى إِسْحَاقَ وَمِن ذُرِّيَّتِهِمَا مُحْسِنٌ وَظَالِمٌ لِّنَفْسِهِ مُبِينٌ)،[٢] وكذلك امتدحه رسول الله -صلّى الله عليه وسلّم- بقوله: (الكريمُ، ابنُ الكريمِ، ابنِ الكريمِ، ابنِ الكريمِ، يوسفُ بنُ يعقوبَ بنِ إسحاقَ بنِ إبراهيمَ عليهم السَّلامُ).[٣][٤] ورد أنّ يعقوب -عليه السلام- شبّ وكبُر مع والده إسحاق -عليه السلام- في فلسطين، أرض الكنعانيين، وقد أمرته أمّه رفقة أن يسافر إلى أرض حرّان، حيث خاله لابان؛ ليقيم عنده بعد أن خافت عليه من أخيه العيص، الذي حصل بينه وبين أخيه خلاف، فتوعّده وهدّده، وبالفعل انطلق يعقوب إلى حيث أمرته والدته، فمكث عند خاله وتزوّج إحدى ابنتيه، ثمّ بعد وفاتها تزوّج أختها، فقد ثبت أنّه لم يجمع بين الأختين بالرغم من أنّ ذلك كان جائزاً في شريعتهم، وذُكر أنّ زوجته تسمّى راحيل هي التي أنجبت ولديه يوسف -عليه السلام- وبنيامين.",
    "part2":"اتّفق المفسّرون على أنّ يعقوب -عليه السلام- هو إسرائيل الذي ذُكر في القرآن الكريم، وبنو إسرائيل في زمن يعقوب -عليه السلام- جاء من نسلهم بني إسرائيل، وهم ذاتهم الموجودين في هذا الزمان، فهم من نسل أبناء يعقوب -عليه السلام- الاثني عشر، ولذلك فإنّ الله -تعالى- حين خاطب اليهود في زمن رسول الله -صلّى الله عليه وسلّم- ذكّرهم بما كان يفعل آباؤهم من قبل؛ لأنّهم من نفس النسل، حيث قال الله تعالى: (وَإِذْ أَخَذْنَا مِيثَاقَكُمْ وَرَفَعْنَا فَوْقَكُمُ الطُّورَ خُذُوا مَا آتَيْنَاكُمْ بِقُوَّةٍ وَاذْكُرُوا مَا فِيهِ لَعَلَّكُمْ تَتَّقُونَ*ثُمَّ تَوَلَّيْتُمْ مِنْ بَعْدِ ذَلِكَ فَلَوْلَا فَضْلُ اللَّهِ عَلَيْكُمْ وَرَحْمَتُهُ لَكُنْتُمْ مِنَ الْخَاسِرِينَ وَلَقَدْ عَلِمْتُمُ الَّذِينَ اعْتَدَوْا مِنْكُمْ فِي السَّبْتِ فَقُلْنَا لَهُمْ كُونُوا قِرَدَةً خَاسِئِينَ) \n\n كان يوسف -عليه السلام- ابن يعقوب -عليه السلام- أحبّ أولاده إليه، وأعلاهم منزلةً في قلبه، فأراد الله -تعالى- أن يبتلي صبره بفراق ولده مدّةً طويلةً من الزمن، حيث كان إخوة يوسف الاثنا عشر يشعرون بالغيرة من أخيهم، ويرون أنّه قد شغل قلب أباهم عنهم، فأرادوا أن يتخلّصوا منه؛ حتى يصفى لهم أبيهم، فدبّروا لذلك مكيدةً وحيلةً، فأخذوا يوسف -عليه السلام- بحجّة التنزّه واللعب، ثمّ ألقوه في بئرٍ عميقةٍ، وأخذوا قميصه بعد أن لوّثوه بدمٍ كذب؛ حتى يقتنع والدهم بصدق روايتهم، وعندما أصبح يوسف -عليه السلام- عزيز مصر، وجاء إخوته يستطعمونه عرفهم يوسف، فأراد أن يأتي بوالده وشقيقه إليه، فأحجم عن إعطائهم نصيبهم من الطعام حتى يأتوا بأخيهم الأخير، فلمّا حضر الإخوة ببنيامين شقيق يوسف، أبقاه يوسف -عليه السلام- عنده بالحيلة، ففقد الأب ولديه الاثنين، إلّا أنّ غياب بنيامين لم يطُل؛ لأنّ يوسف أخبر إخوته بحقيقة أمره، إلّا أنّ غياب يوسف -عليه السلام- نفسه عن أبيه بسبب كلّ الظروف ظلّ ما يقارب أربعين سنة، وقيل في روايةٍ أخرى: ثمانين سنة، وقيل غير ذلك، وكان الأب يعقوب -عليه السلام- في كلّ السنوات صابراً محتسباً، فلم يفقد الأمل بعودة ولده، ولم يقنط من رحمة الله تعالى",
    "part3":"ظهرت صفات النبيّ يعقوب -عليه السلام- جليّةً في سورة يوسف، وذلك في العديد من المواقف التي كان فيها معلّماً لأبنائه، ومن تلك المواقف:[٩] حسن توكّل يعقوب -عليه السّلام- على الله تعالى، فبالرّغم من انّه أرشد أبناءه للأخذ بالأسباب في دخول المدينة إلّا أنّه توكّل على الله وحده في تفريج كربه، قال الله تعالى: (إِنِ الْحُكْمُ إِلَّا لِلَّهِ عَلَيْهِ تَوَكَّلْتُ وَعَلَيْهِ فَلْيَتَوَكَّلِ الْمُتَوَكِّلُونَ).[١٠] الإقبال والاعتماد على الله -تعالى- بقضاء الحوائج، وبثّ الحزن له وحده، حيث قال الله تعالى: (قَالَ إِنَّمَا أَشْكُو بَثِّي وَحُزْنِي إِلَى اللَّهِ وَأَعْلَمُ مِنَ اللَّهِ مَا لَا تَعْلَمُونَ).[١١] حسن الظن بالله تعالى، حيث قال الله عزّ وجلّ: (وَلا تَيأَسوا مِن رَوحِ اللَّهِ إِنَّهُ لا يَيأَسُ مِن رَوحِ اللَّهِ إِلَّا القَومُ الكافِرونَ).",
    "part4":"توفي نبيّ الله يعقوب -عليه السلام- وقد زاد عمره عن المئة عام، وكان ذلك بعد لقاء ابنه يوسف -عليه السلام- بسبع عشرة سنة، وكانت وصيّته أن يُدفن عند والده إسحاق وجدّه إبراهيم عليهما السلام.",

  },
  {
    "nabi" :"يوسف عليه السلام",
    "color": Colors.deepPurpleAccent.withOpacity(0.7),
    "part1":"سيدنا يوسف عليه السلام هو ابنا لسيدنا يعقوب بن إبراهيم عليهما السلام وقد كان له من الاخوة احدى عشر أخ وجميعهم ذكور، وقد كان مايميز يوسف عليه السلام جمال الخلق والشكل وكان والده يحبه حبا جما مما أثار غيرة اخواته منه، وذات يوم جاء يوسف عليه السلام لوالده يروي له رؤيا قد رأها أن أحد عشر كوكبا ومعهم الشمس والقمر ساجدين له، هنا خاف يعقوب عليه السلام على ولده وقال له لا تحكي لأخوتك عن تلك الرؤيا حتى لا يغاروا منك ويؤذونك.ومع مرور الوقت تزداد غيرة أخوة يوسف وحقدهم من شدة حب أبيه له فقاموا بترتيب مؤامرة للتخلص منه فطلبوا من أبيهم أن يأخذوا يوسف في رحلة للصيد فقلق والدهم على يوسف وقال لهم أنه يخاف على يوسف في أن ينشغلوا بالصيد فيأكله الذئب هنا تجمعوا قائلين كيف يأكله الذئب ونحن بهذا العدد فنحن سوف نحميه، هنا وافق الأب وتركه يذهب معهم وهم قد اتفقوا على قتله وإلقائه بعيدا.",
    "part2":"ولكن عند فكرتهم في القتل اقترح أحد الأخوة بالقاءه في البئر اما مات أو أخذه أحد وبالفعل ألقوه في البئر وأخذوا قميصه ووضعوه في دماء شاه وساروا باكيين لأبيهم مدعيين أن الذئب قد أكل أخيهم ولم يتبقى سوا قميصه وعليه الدماء، حزن الأب ومن داخله قد علم بمؤامرة أبنائه على اخاهم ومن شدة الحزن فقد بصره، وظل صابرا على أمل عودة يوسف.ومن رحمة الله بيوسف التقطه بعض الأشخاص بقافلة مارة على هذا البئر وأخذوه عبدا ليبيعونه في مصر، وبالفعل رغم أسر القافلة ومحاولتهم في اخفاؤه الا انهم باعوه ولكن بثمن قليل وقد ذكر هذا في القرأن الكريم وقد اشتراه عزيز مصر وتربى في بيته ولكن لم تنتهي ابتلاءات سيدنا يوسف فقد حاولت امرأة أن تغوينه وتراوده عن نفسه ولكنه امنتع عن المعصية ولكنها وشت به لدى العزيز الذي أمر بحبسه إلى أن أتى بمن يحكم بينه وبينها وقال إن كان قميصه ممزقا من الأمام فهي صادقة وإن كان ممزقا من الخلف فهو صادق هنا ظهرت براءة سيدنا يوسف.",
    "part3":"ولكن لم ينتهي الأمر فقد تحدث الجميع عن عشق امرأة العزيز لربيبها فقامت بدعوة جميع نساء القصر وقدمت لهم الفاكهة وسكاكين لتقطيع الفاكهة ثم ادخلت عليهم سيدنا يوسف فمن جماله الذي سرق عقولهم وأعينهم فقد كانوا يقطعن أيديهن من دون أن يشعروا، فقد توالت الكثير من الأحداث بحياة سيدنا يوسف سواء في محبسه أو في منزل العزيز وقد أثبت فيها جميعها أنه كان عبدا صبورا وذات خلق عظيم إلى أن أراد الله ليكون حاكما على مصر.وبعد ذلك التقى بإخوته على غير موعد ويحكون له قصتهم بدون أن يعلموا أنه أخاهم يوسف وتتوالى الكثير من الأحداث حتى يرسل لأبيه أحد ملابسه فيعرف منها أنها ليوسف ويرتد إليه بصره ويجمعه الله بعد ذلك بولده بعد كل تلك السنوات ليطمئن قلبه عليه، في قصة سيدنا يوسف عليه السلام العبرة التي يحتاج لها كل شاب مهما كانت الصعاب التي يعيشها فهذا لا يجعله يسير في الطريق الخاطئ، فقد ضرب سيدنا يوسف لكل شاب أهم درس في التغلب على أي شهوات مهما كانت ليظل في طاعة الله",
    "part4":"ولا ننسى صبر سيدنا يعقوب عليه السلام على ابتلاءه في فقدان ولده وهذا يجعلنا نتخذه قدوة في الصبر فقد يكون في ابتلاء الله لنا عظيم الرحمة ونحن لا ندري لأن رؤيتنا كبشر قصيرة جدا فلابد أن نؤمن بقضاء الله وقدره مهما كان وفي هذا نعمة وراحة مع هذا الصبر حتى نتحقق ما نتمنى وقتما يشاء الله عز وجل.",
  },
  {
    "nabi" :"ايوب عليه السلام",
    "color": Colors.deepPurple.withOpacity(0.7),
    "part1":"التعريف بأيوب عليه السلام \n ُعَدّ أيّوب -عليه السلام- نبيّاً من نسل الأنبياء؛ قال -تعالى-: (وَوَهَبْنَا لَهُ إِسْحَاقَ وَيَعْقُوبَ ۚ كُلًّا هَدَيْنَا ۚ وَنُوحًا هَدَيْنَا مِن قَبْلُ ۖ وَمِن ذُرِّيَّتِهِ دَاوُودَ وَسُلَيْمَانَ وَأَيُّوبَ وَيُوسُفَ وَمُوسَىٰ وَهَارُونَ ۚ وَكَذَٰلِكَ نَجْزِي الْمُحْسِنِينَ).[١] فهو -على المشهور- من ذُرّية إبراهيم -عليه السلام-؛ إذ استدلّ العلماء على ذلك من أنّ الضمير في الآية عائد على نبيّ الله إبراهيم، وليس نوحاً -عليه السلام-،[٢] وكانت بعثته -عليه السلام- بين موسى، ويوسف -عليهما السلام-.[٣] وصَبرُ أيّوب -عليه السلام- الذي اتّصف به على البلاء جعلَ منه قدوةً ومثالاً للصابرين،[٤] وليس في ذلك غرابة؛ فأنبياء الله -تعالى- ورُسله هم أشدّ الناس بلاءً؛ إذ بيّنَ رسول الله -صلّى الله عليه وسلّم- ذلك في الحديث الذي رواه سعد بن أبي وقاص -رضي الله عنه- أنّه قال: (قلتُ يا رسولَ اللهِ أيُّ النَّاسِ أشدُّ بلاءً قالَ الأَنبياءُ ثمَّ الأَمثلُ فالأَمثلُ)،[٥] كما أنّهم أكثر الناس صبراً، وثباتاً في الابتلاءات، والوقوف في وجهها، ومعرفةً لحقيقة أنّها نِعمَة من نِعَم الله؛ لأنّها سببٌ لرَفع درجاتهم عند الله -تعالى",
    "part2":"قصّة أيّوب عليه السلام \n بدأت رحلة أيّوب -عليه السلام- مع البلاء بعد أن سُلِب ما كان عنده من الخير باختلاف صنوفه؛ حيث كان -عليه السلام- غنيّاً بالأموال، والأنعام، والأراضي، وكان له بنون كُثُر، فما كان من أيّوب حين نزل به البلاء إلّا أن احتسب أجره عند الله، وصبر على ما ابتلاه، وقد رافقه مرضه، وقلّت يده زمناً طويلاً، ولم يبقَ معه في هذه المحنة إلّا زوجته التي راعته، واعتنت به، وكانت له خير رفيق إلى أن فرّجَ الله عنه كربه بعد أن توجّه إليه بالدعاء لكشف ما به من ضرّ،[٢] وقد وردت قصّة ابتلاء نبيّ الله أيّوب -عليه السلام- في موضعَين في القرآن الكريم؛ أحدهما في سورة الأنبياء؛ قال -تعالى-: (وَأَيُّوبَ إِذْ نَادَىٰ رَبَّهُ أَنِّي مَسَّنِيَ الضُّرُّ وَأَنتَ أَرْحَمُ الرَّاحِمِينَ*فَاسْتَجَبْنَا لَهُ فَكَشَفْنَا مَا بِهِ مِن ضُرٍّ ۖ وَآتَيْنَاهُ أَهْلَهُ وَمِثْلَهُم مَّعَهُمْ رَحْمَةً مِّنْ عِندِنَا وَذِكْرَىٰ لِلْعَابِدِينَ)[٧]، والآخر في سورة ص؛ قال -تعالى-: (وَاذْكُرْ عَبْدَنَا أَيُّوبَ إِذْ نَادَىٰ رَبَّهُ أَنِّي مَسَّنِيَ الشَّيْطَانُ بِنُصْبٍ وَعَذَابٍ* ارْكُضْ بِرِجْلِكَ ۖ هَٰذَا مُغْتَسَلٌ بَارِدٌ وَشَرَابٌ*وَوَهَبْنَا لَهُ أَهْلَهُ وَمِثْلَهُم مَّعَهُمْ رَحْمَةً مِّنَّا وَذِكْرَىٰ لِأُولِي الْأَلْبَابِ* وَخُذْ بِيَدِكَ ضِغْثًا فَاضْرِب بِّهِ وَلَا تَحْنَثْ ۗ إِنَّا وَجَدْنَاهُ صَابِرًا ۚ نِّعْمَ الْعَبْدُ ۖ إِنَّهُ أَوَّابٌ)[٨]، وتُبيّن هذه الآيات أنّ أيّوب -عليه السلام- صبَرَ على مرضه زمناً طويلاً، فتفضَّل الله عليه، واستجاب له دُعاءه، وأزال عنه مرضه، وردّ إليه أهله،[٩] كما أنّها دلّت على أنّ صبره -عليه السلام- استحقّ ثناء الله -سبحانه-؛ فقد وصفه بأنّه صابر، وأوّاب",
    "part3":"مدّة صبر أيّوب عليه السلام \n ورد عن ابن حجر العسقلانيّ أنّ أصحّ ما جاء في قصَّة أيّوب -عليه السلام- ما أخرجه ابن أبي حَاتم عَن أَنس أنّه -عليه السلام- ظلّ مُبتلىً مدّة ثلاث عشرة سنة، جاء في الحديث: (أنَّ أيوبَ عليهِ السلامُ ابتُليَ فلبثَ في بلائهِ ثلاثَ عشرةَ سنةً)،[١٣][١٤] وجاء في رواية أخرى عند صاحب المستدرك، وغيره، أنّ بلاءه استمرّ ثماني عشرة سنة، ورد في الحديث: (إنَّ نَبيَّ اللهِ أيُّوبَ عليه السَّلامُ لبِثَ به بَلاؤُهُ ثَمانَ عَشْرةَ سَنَةً)",
    "part4":"وفاة النبيّ أيّوب ومكان قبره \n تُوفِّي النبيّ أيّوب -عليه السلام- وله من العمر ما يزيد عن التسعين عاماً،[١٧] إلّا أنّ المكان الذي دُفِن فيه غير معلوم؛ فقد ورد عن شيخ الإسلام ابن تيمية أنّ قبر النبيّ محمد -صلّى الله عليه وسلّم- هو القبر الوحيد الذي اتُّفِق على أنَّه قبر نبيّ، أمّا فيما يتعلّق بالبئر الذي يُقال له بئر أيّوب والذي يظنّ الناس أنّه البئر الذي اغتسل فيه -عليه السلام- فلا دليل على صحّته، ولا يُعلَم مكانه.",

  },
  {
    "nabi" :"ذو الكفل عليه السلام",
    "color": Color(0xff453658),
    "part1":"ورد ذكر النبي ذي الكفل عليه السلام في قوله تعالى: وَإِسْمَاعِيلَ وَإِدْرِيسَ وَذَا الْكِفْلِ كُلٌّ مِّنَ الصَّابِرِينَ (85) وَأَدْخَلْنَاهُمْ فِي رَحْمَتِنَا إِنَّهُم مِّنَ الصَّالِحِينَ (85). وهو من أنبياء بني إسرائيل، وسمي بذي الكفل لأنه تكفل للنبي الذي كان في زمانه أن يخلفه في قومه إذا مات، وأن يتكفل له في ثلاث، وهي أن يقوم الليل، ويصوم النهار، ولا يغضب في القضاء، وكان يصلي كل يوم مائة صلاة، ويقضي بين قومه بالعدل.",
    "part2":"يقال أن ذو الكفل هو ابن أيوب عليه السلام، واسمه الأصلي بشر، وقد بعثه الله بعد النبي أيوب وسماه ذو الكفل، لأنه قام بتكفل بعض الطاعات، لكن بعض العلماء اختلفوا فيما بينهم على نبوته، فقالوا بل مجرد رجل صالح من بني إسرائيل، ولكن ابن كثير رجّح نبوته لأن الله تعالى ذكره مع الأنبياء كما جاء في الآية الكريمة السابقة. يجب أن نلفت النظر لأمر مهم هنا، وهو أن ذا الكفل ليس نفسه الكفل المذكور في الحديث النبوي الشريف، والذي ذكر على أنه كان من بني إسرائيل أيضاً، ولكن شتان ما بينه وبين ذو الكفل الذي نتكلم عنه، إذ كان لا يتورع من ذنب أعماله، فقد عرف عنه أنه كان يمارس الفاحشة والزنا، ومات وهو على معصية لله. تشابهت الأسماء ولكن الاختلاف ما بينهما كالاختلاف ما بين السماء والأرض.",
    "part3":"أراد إبليس أن يوقع ذو الكفل في الخطأ، فجعل إبليس يقول للشياطين: عليكم بذي الكفل، أوقعوه في الزلل، ولكنهم عن عجزوا ذلك، فقال دعوني وإياه، فأتاه إبليس في صورة شيخ كبير وفقير، وأتاه حين أخذ مضجعه للقيلولة حتى ينام، فإنه لم يكن ينام الليل وهو يعبد الله، وكان يقضي في الناس حتى وقت الظهر، وبعد ذلك يعود وقت القيلولة للبيت حتى ينام، ثم يعود ليقضي بين الناس إلى الليل، وهكذا كانت حياته، فأراد إبليس أن يثير غضب ذي الكفل، وبذلك يوقعه في الخطأ، لذلك طرق بابه في ساعة القيلولة التي تمثل ساعة الراحة لذو الكفل، فتح ذو الكفل الباب وسأل من أنت، قال إبليس: أنا عجوز طاعن في السن، وأتيتك في حاجة، فقام ذو الكفل ففتح الباب، فبدأ الشيخ يحدّثه عن خصومة بينه وبين قومه، وكيف ظلموه، وأخذ يماطل في الحديث حتى حان موعد مجلس ذو الكفل بين الناس، وفاتت ذو الكفل القيلولة ولم ينم، فقال له ذو الكفل: عندما أذهب لمجلس القضاء، فأتني وأنا آخذ لك حققك خرج الشيخ وخرج ذو الكفل لمجلسه دون أن ينام، لكن الشيخ لم يحضر للمجلس، وانفض المجلس دون أن يحضر، وعقد المجلس في اليوم التالي، لكن الشيخ لم يحضر أيضاً، ولما رجع ذو الكفل لمنزله وقت القيلولة لينام، أتاه الشيخ فدقّ الباب، فقال ذو الكفل: من هذا، فقال إبليس: الشيخ الكبير المظلوم، ففتح له وقال: ألم أقل لك إذا قعدت في مجلس القضاء فأتني، فقال إبليس: إنّهم أخبث قوم، إذا عرفوا أنك قاعد في مجلسك قالوا لي نحن نعطيك حقك، وإذا قمت من مجلسك جحدوني، فقال ذو الكفل فانطلق هذه الساعة فإذا ذهبت مجلس القضاء فأتني",
    "part4":"مرة أخرى فاتت القيلولة ذو الكفل، وذهب لمجلسه وانتظر الشيخ فلم يره، وشقّ عليه النعاس، فقال لبعض أهله: لا تدعنَّ أحداً يقرب هذا الباب حتى أنام، فإني قد شق عليّ النعاس، أخذ ذو الكفل مضجعه لينام، فقدم الشيخ، فمنعه الرجل من الدخول، فقال إبليس: قد أتيته أمس، فذكرت له أمري، وإني أريده الساعة، فقالوا له: لا والله لقد أمرَنا أن لا ندع أحداً يقربه، فلما رأى عناد ذلك الرجل وتصميمه، نظر متفحصاً البيت، فرأى ثقباً في البيت ودخل منه، فإذا هو في البيت، وإذا هو يدق الباب من الداخل، فاستيقظ ذو الكفل فقال للرجل الواقف في الخارج: أيها الرجل ألم آمرك ألا يدخل علي أحد، فقال: والله لم ندع أحداً يقترب، فانظر من أين دخل فقام ذو الكفل إلى الباب فإذا هو مغلق كما أغلقه، وجال ذو الكفل عليه ببصره في البيت، فلم يكن هناك أي منفذ يستطيع الشيخ أن يدخل منه إلى البيت، فعرف حينها أنّ هذا الشيخ ما هو إلا إبليس، فقال: ما أنت إلا عدو الله ، فقال إبليس: نعم، قال ذو الكفل: ولماذا فعلت كل هذا، قال إبليس:  سلطت عليك الشياطين لتوقعك في الزلل فلم تقدر، فأردت أن أثير غضبك وأجعل صبرك ينفذ فتقع في الخطأ. وهكذا لم يستطع إبليس تغيير شيء من صفات ذو الكفل الذي ظل صابراً حليماً لا يغضب، فسماه الله ذو الكفل لأنه تكفل بأمر فأوفى به. يقال أن ذو الكفل مات وهو في سن الخامسة والسبعين من عمره، كما ويقال أن قبره يتواجد في قرية كفل حارس في مدينة نابلس في فلسطين.",

  },
  {
    "color": Colors.indigo.withOpacity(0.7),
    "nabi" :"يونس عليه السلام",
    "part1":"قيل في نسب يونس عليه السلام: إنّه يونس بن متّى، ثمّ يتصل نسبه بنسل بنيامين شقيق يوسف عليه السلام، بُعث يونس -عليه السلام- إلى نينوى، في العراق، إلى قومٍ انتشر الشرك بينهم؛ فكانوا يعبدون الأصنام، فأوحى إليهم يونس وأرشدهم إلى عبادة الله وحده لا شريك له، إلا أنّهم كذّبوه، وكفروا برسالته، وأصرّوا على عبادة أصنامهم وأوثانهم، وكان من بينها صنم أكبر يُدعى: عشتار، وقد قيل: إنّ دعوة يونس -عليه السلام- لقومه استمرت ثلاثاً وثلاثين سنة، إلّا أنّه لم يؤمن معه سوى رجلين، ولذلك شعر يونس -عليه السلام- باليأس من قومه، فتركهم وخرج من بلدتهم.",
    "part2":"خرج يونس -عليه السلام- من نينوى، وظنّ أنّ الله -تعالى- لن يؤاخذه بهذا الخروج؛ لأنّه قدّم كلّ ما عليه في سبيل دعوة قومه، ولم يستجب أحد، وحين خرج بدأ يحلّ على قومه بوادر العذاب الذي توعّدهم فيه، فهلّت السُّحب السوداء، وغشيهم دخانها، واسودّت سطوحهم، فأيقن القوم أنّ عذاب الله -تعالى- آتٍ لا مفرّ منه، فخافوا ووجِلوا، وبحثوا عن يونس عليه السلام؛ ليهديهم طريقة التوبة والإنابة فلم يجدوه، فأتوا رجلاً شيخاً فسألوه عمّا يجب فعله، فأرشدهم إلى طريق التوبة إلى الله تعالى، فجمعوا كبيرهم وصغيرهم، وذكرهم وأنثاهم، وحيواناتهم جميعاً، ثمّ جعلوا على رؤوسهم الرماد، ولبسوا المسوح من اللباس؛ تواضعاً لله سبحانه، ثمّ أقبلوا عليه في هذا الحال في مشهدٍ عظيمٍ، ضارعين له أن يصرف عنهم العذاب، ويتوب عليهم، فتاب الله -تعالى- عليهم، وقبل إيمانهم بعد كلّ هذا الكفر والعِناد، ولم يشهد يونس -عليه السلام- هذا الحال منهم.",
    "part3":"لمّا خرج يونس -عليه السلام- من نينوى، أقبل على قومٍ وركب معهم سفينتهم، فلمّا أن وصلت بهم جميعاً إلى عُرض البحر، تمايلت السفينة واضطربت واهتزّت، فلم يجدوا سبيلاً للخلاص إلى أن يلقوا بأحدهم في البحر؛ تخفيفاً للحِمل، فاقترعوا على من يُلقي بنفسه في البحر، فخرج سهم يونس عليه السلام، فلمّا التمسوا فيه الخير والصلاح، لم يحبّذوا أن يُلقي بنفسه في البحر، فأعادوا القرعة ثلاث مرّات، وكان يخرج سهم يونس -عليه السلام- في كلّ مرّة، فلم يجد يونس -عليه السلام- إلّا أن يلقي نفسه في البحر، وظنّ أنّ الله -تعالى- سيُنجيه من الغرق، وبالفعل فقد أقبل إليه حوت أرسله الله -تعالى- فالتقمه.[٢] ولمّا صار يونس -عليه السلام- في بطن الحوت، ظنّ أنّه مات، لكنّه حرّك يديه، وساقيه، فتحرّك، فسجد لله -تعالى- شاكراً له بأن حفظه، ونجّاه، فلم تُكسر له يد، ولا رجل، ولم يصبه مكروه، وبقي في بطن الحوت ثلاثة أيّام، وسمع فيها أصواتاً غريبةً لم يفهمها، فأوحى الله -تعالى- له أنّها تسبيح مخلوقات البحر، فأقبل هو أيضاً يسبّح الله تعالى، قائلاً: (لا إله إلّا أنت، سُبحانك إنّي كنت من الظّالمين)، ثمّ بعد ذلك أمر الله -تعالى- الحوت فقذف به على اليابسة، وأنبتت عليه شجرة يقطين؛ يستظلّ بها، ويأكل من ثمرها، حتى نجا.",
    "part4":"عاد يونس -عليه السلام- بعد ذلك إلى نينوى حيث قومه، فوجدهم مؤمنين بالله -تعالى- موحّدين، فمكث معهم حيناً من الدهر، وهم على حال الصلاح والتقى، حيث قال الله تعالى: (وَأَرْسَلْنَاهُ إِلَى مِائَةِ أَلْفٍ أَوْ يَزِيدُونَ*فَآمَنُوا فَمَتَّعْنَاهُمْ إِلَى حِينٍ)،[٣] ثمّ حين عادوا إلى ضلالهم وكفرهم مجدّداً نزل فيهم عذاب الله -تعالى- فأخذهم جميعاً، ودمّر مدينتهم، فأصبحوا عبرةً لمن خلفهم، وقيل بعد ذلك في وفاة يونس -عليه السلام- أنّه دُفن قبل ساحل صيدا.",

  },
  {
    "nabi" :"موسي عليه السلام",
    "color": Colors.deepPurpleAccent.withOpacity(0.7),
    "part1":"  موسى هو نبيّ من أنبياء بني إسرائيل أُرسل إلى فرعون وقومه، ويرجع نسبه إلى يعقوب بن إسحاق بن إبراهيم عليهم السلام، وُلد موسى -عليه السلام- في وقتٍ تمادى فيه فرعون بظلمه وفساده وبالأخص ظلمه لبني إسرائيل، وقد زاد ظلمه عندما أخبره كاهن عن ولادة مولود في بني إسرائيل يُنهي ملك فرعون، ممّا أدّى إلى غضب فرعون وذبح أطفال بني إسرائيل واستحياء نسائهم، وفي ظل تلك المعانة جاء المخاض لأم موسى، فكتمت أمر ولادته خوفاً عليه من القتل، فألهمها الله أن تضع الرضيع في صندوق وتُلقيه في النهر عسى أن يقع في أيدٍ أمينة، فانتهى به المطاف إلى قصر فرعون، وما أن رأته زوجة فرعون حتى جعل الله محبته في قلبها، وقالت لا تقتلوه نريد أن نأخذه ولداً لنا، وأردت أنّ تُرضعه فأحضرت له المُرضعات، ولكنّ الله حرم عليه المراضع فلم يقبل بأي واحدةٍ منهنّ، حتى جاءت أخته فقالت لهم: (أنا أدلّكم على من يُرضعه لكم)، وطلبت من أمّه أن تأتي لترضعه، فردّه الله إلى أمّه وقرّت عينها به.\n نشأ موسى -عليه السلام- في قصر فرعون حتى بلغ أشدّه، وفي أحد الأيام وبينما هو يمشي في السوق، إذ بمشاجرة تقع بين رجل من بني إسرائيل ورجل من قوم فرعون، فاستغاثه الذي من بني اسرائيل، فأجابه موسى فضرب الفرعونيّ ضربة فقتله، ثمّ توارى موسى -عليه السلام- عن الأنظار وندم واستغفر على ما فعله، وفي تلك الأثناء بدأ البحث عن قاتل الفرعونيّ، فخاف موسى عليه السلام، وبعد بضعة أيّام جاء رجل من آل فرعون مسرعاً إلى موسى وأخبره أنّ فرعون وملأه يتآمرون لقتله، فما لبث أن خرج مسرعاً هارباً منهم حتى وصل إلى مدين، فجلس تحت شجرة ينظر إلى بئر قريب فرأى أنّ الرّعاة يسقون، وعلى مقربة من البئر تنتظر فتاتان حتى يفرغ الرعاة، فقام وسقى لهما ثمّ عاد وجلس تحت الشجرة، وبينما هو على تلك الحال جاءته إحداهما ويبدو عليها الحياء فقالت له إنّ أباها يدعوه، فأجاب موسى -عليه السلام- الدعوة، فلمّا جلس إلى أبيها الشيخ الكبير عرض عليه أن يستأجره ثمانية سنوات مقابل أن يزوّجه إحدى ابنتيه، فوافق موسى -عليه السلام- وتزوّج، فقضى عشر سنين عنده ثمّ مضى.",
    "part2":"بينما كان موسى -عليه السلام- في الصحراء رأى ناراً فتوجّه نحوها ليأتي ببعضها، فناداه الله -تعالى- ليكلّمه، قال الله تعالى: (فَلَمّا أَتاها نودِيَ يا موسى*إِنّي أَنا رَبُّكَ فَاخلَع نَعلَيكَ إِنَّكَ بِالوادِ المُقَدَّسِ طُوًى*وَأَنَا اختَرتُكَ فَاستَمِع لِما يوحى)،[٥] ثم سأله الله عن الذي بيده، فأجاب بأمان وأُنس بالله -عزّ وجلّ- بأنّها عصاته ثمّ أضاف بأنّه يتوكأ عليها ويهش بها على غنمه، فأمره الله بإلقائها فتحوّلت العصا إلى أفعى، ثمّ أمره أن يأخذها فإذا هي عصا من جديد، وأمره الله -تعالى- أيضاً أن يضمّ يده إلى إبطه ثمّ يُخرجها لتخرج بيضاء من غير برص ولا بهاق، ثمّ أمره بالذهاب الى الطاغية فرعون ودعوته، وعرض المعجزات عليه، وقبل أن يذهب موسى -عليه السلام- طلب من الله أن يُرسل معه أخاه هارون ليُسانده في مواجهة فرعون.",
    "part3":"بعد أن كلّف الله -تعالى- موسى -عليه السلام- بالرسالة وأيّدهُ بالمعجزات وبأخيه هارون، ذهب إلى فرعون ودعاه للإيمان بالله وإخلاص العبادة له، فما كان من فرعون إلّا أنّ كذّبهم واتّهمهم بالسّحر، ثمّ دعاهم إلى المبارزة على أعين الناس يوم العيد، فوافق موسى عليه السلام، وبدأ فرعون بجمع قوّته وكيده فأرسل إلى السّحرة في جميع أنحاء مصر ليأتوه ويشاركوا في معركته، فما لبثوا حتى جاؤوه وقالوا له نُريد أجراً إن انتصرنا على موسى وهارون، فوعدهم بالمال والجاه إذا انتصروا، ثمّ جاء اليوم المُنتظر، فوقف موسى -عليه السلام- وسط الجموع الغفيرة ثمّ طلب من فرعون حجّته، فألقى السحرة حبالهم، وعصيهم وفعلوا سحراً عظيماً أرهب الحاضرين، ولكن سرعان ما تلاشى سحرهم وبطل كيدهم لمّا ألقى موسى -عليه السلام- عصاه التي تحوّلت إلى أفعى عظيمة تبتلع سحرهم بأمر الله تعالى، وعندها عَلِم السحرة أنّ ذلك ليس بسحر وإنّما هو الحقّ من عند الله -تعالى- فخرّوا سُجّداً وآمنوا بالله، فغضب فرعون لِما أصابه من الهزيمة ولم تبقى له حُجّة بعد إسلام السّحرة، فلجأ إلى القوّة والتهديد بقتل السّحرة الذين ضربوا أروع الأمثلة في التضحية، والصبر في سبيل الحقّ.",
    "part4":"صبر موسى -عليه السلام- مع من آمن معه على بطش وعتو فرعون وظلمه، وتوجّه إلى ربه بالدعاء الصادق، قال الله -تعالى- على لسان نبيه: (وَقالَ موسى رَبَّنا إِنَّكَ آتَيتَ فِرعَونَ وَمَلَأَهُ زينَةً وَأَموالًا فِي الحَياةِ الدُّنيا رَبَّنا لِيُضِلّوا عَن سَبيلِكَ رَبَّنَا اطمِس عَلى أَموالِهِم وَاشدُد عَلى قُلوبِهِم فَلا يُؤمِنوا حَتّى يَرَوُا العَذابَ الأَليمَ)،[٨] فاستجاب الله -سبحانه- لدعاء نبيه، وأوحى إليه بالخروج مع من آمن معه من أرض مصر، ولحق فرعون بهم مع جنوده، وأدركهم حين شروق الشمس، وتواجه الفريقان، فأوحى الله لنبيه أن يضرب البحر بعصاه ليتحوّل إلى يابس، فتجاوزه موسى ومن معه، وأراد فرعون أن يلحق بهم، إلّا أنّ الله -تعالى- أغرقه مع جنوده، قال تعالى: (وَأَنجَيْنَا مُوسَى وَمَن مَّعَهُ أَجْمَعِينَ*ثُمَّ أَغْرَقْنَا الْآخَرِينَ*إِنَّ فِي ذَلِكَ لَآيَةً وَمَا كَانَ أَكْثَرُهُم مُّؤْمِنِينَ*وَإِنَّ رَبَّكَ لَهُوَ الْعَزِيزُ الرَّحِيمُ)،[٩] وأراد فرعون الإيمان حين أدركه الغرق، وندم على ما بدر منه، إلّا أنّ توبته لم تُنجيه، قال الله سبحانه: (قالَ آمَنتُ أَنَّهُ لا إِلـهَ إِلَّا الَّذي آمَنَت بِهِ بَنو إِسرائيلَ وَأَنا مِنَ المُسلِمينَ*آلآنَ وَقَد عَصَيتَ قَبلُ وَكُنتَ مِنَ المُفسِدينَ)",
  },
  {
    "nabi" :"يوشع بن نون عليه السلام",
    "color": Colors.deepPurple.withOpacity(0.7),
    "part1":"هو يوشع بن نون بن إفرائيم بن يوسف بن يعقوب بن إسحاق بن إبراهيم -عليهم السلام- وهناك من أهل الكتاب من يدعونه بيوشع بن عم هود. وقد ورد ذكره في كتاب الله تعالى ولكن دون تصريح باسمه الحقيقي، وذلك في قصة موسى -عليه السلام- مع الخضر. قال تعالى: (وَإِذْ قَالَ مُوسَى لِفَتَاهُ). يعتبر يوشع بن نون من الشخصيّات المتّفق عليها بين أهل الكتاب أنفسهم، وبينهم وبين المسلمين، فبينما يقال له عند المسلمين يوشع بن نون، يقال له عند الآخرين يشوع بن نون، وهو نبي كريم من أنبياء الله -عز وجل-، وقد ورد ذكره في العهد القديم، في السفر الذي يحمل اسمه وهو سفر يشوع. أدى نبي الله يوشع -عليه السلام- دوراً تاريخيّاً كبيراً؛ كونه تولّى زمام أمور بني إسرائيل بعد انتقال رسول الله موسى -عليه السلام- إلى جوار ربه الأعلى. وفيما يلي بعض محطات حياته -عليه السلام",
    "part2":"ينسب ليوشع بن نون -عليه السلام- إخراج بني إسرائيل من التيه، وإدخالهم بيت المقدس بعد قتال، وحصار، وقد وقعت في هذه المعركة القصة الأشهر لهذا النبي الكريم؛ فلما كان النصر قريباً جداً منه وممن كان يقاتل معه، اقترب مغيب شمس يوم الجمعة، فإذا ما غربت الشمس دخل يوم السبت، ويوم السبت هو اليوم الذي لا يعمل فيه اليهود، وهو اليوم الذي حرم الله تعالى عليهم فيه الصيد، ولما خاف يوشع بن نون من دخول السبت، ومن خسارة المعركة بعد اقتراب النصر، دعا الله تعالى بألا تغيب الشمس حتى يتحقق له ولمن معه النصر، وهذا ما قد كان بفضلٍ من الله تعالى، فتأخر مغيب الشمس -بإذن الله-، وانتصر هو ومن معه.",
    "part3":"استطاع يوشع بن نون -عليه السلام- أن يخوض العديد من المعارك الهامة، حيث تم وصف هذه المعارك بصورة كلية، وبعد هذه المعارك عمل يوشع بن نون -عليه السلام- على إدارة شؤون الإسرائيليين، وكان دائماً يحثهم على طاعة الله تعالى، وعلى أهمية أن يتذكروا فضله عليهم، وكان -عليه السلام- دائم التحذير لهم من خطورة الانقياد وراء الشهوات، والغواية، واتباع خطوات الشيطان. وقد توفي نبي الله يوشع -عليه السلام- بعد أن كبر في السن، حيث دفن في أرض كنعان، واليوم يقع قبره في مدينة السلط الأردنية، وتحديداً في منطقة النبي يوشع المشهورة، حيث يبعد قبره عن مدينة عمان العاصمة قرابة خمسة وعشرين كيلومتراً تقريباً، وقد أقيم عليه مسجد يحتوي على كافة المرافق التي تلزم المصلين هناك.",
    "part4":"",

  },
  {
    "nabi" :"الياس عليه السلام",
    "color": Color(0xff453658),
    "part1":"أول ناسك ومتوحد ذاق لذة اللقاء والعيش مع الله عز وجل، ذكر اسمه فى القرآن الكريم مرتين فى سورتى الأنعام:  وَزَكَرِيَّا وَيَحْيَى وَعِيسَى وَإِلْيَاسَ كُلٌّ مِنَ الصَّالِحِينَ، وسورة الصافات وَإِنَّ إِلْيَاسَ لَمِنْ الْمُرْسَلِينَ. إِذْ قَالَ لِقَوْمِهِ أَلا تَتَّقُونَ. أَتَدْعُونَ بَعْلا وَتَذَرُونَ أَحْسَنَ الْخَالِقِينهو النبى إلياس بن ياسين من ذرية هارون شقيق موسى عليه السلام، ويعرف في كتب الإسرائيليين باسم (إيليا)، وقد بعثه الله ليدعو بنى إسرائيل لنبذ عبادة الأصنام والاستمساك بعبادة الله وحده، ولكنهم رفضوا أن يستجيبوا له.",
    "part2":" ولم يرد بالقرآن الكريم قصة سيدنا إلياس عليه السلام كاملة، ولكن تعددت الروايات حول قصته، ومن ضمن تلك الروايات أنه دعا ربه على قومهبعد رفضهم رسالته قائلًا: اللهم إن بني إسرائيل قد أبو إلا الكفر بك والعبادة لغيرك، فغير ما بهم من نعمتك، فأوحي الله إليه أنا جعلنا أمر أرزاقهم بيدك فأنت الذي تأمر في ذلك.فأمر ملك المدينة بقتله لما كان يدعوهم إلى ترك عبادة الأوثان، فجاء إليه ابن عمه اليسع وقال له ماذا ستفعل رد نبي الله عليه السلام قائلا: سأخرج من هنا لأختبئ فى مغارة فى جبل قاسيون لعل الله يهديهم ويرشدهم إلى سواء السبيل وخرجا سويا متجهين إلى الجبل.فهربا إلى الجبل على أمل أن يهتدى",
    "part3":"",
    "part4":"",

  },
  {
    "color": Colors.indigo.withOpacity(0.7),
    "nabi" :"اليسع عليه السلام",
    "part1":"هو واحدٌ من الأنبياء المرسلين من الله تعالى إلى بني إسرائيل فهو من ذرية إبراهيم -عليه السلام- واسمه أسباط بن عدي بن شوتلم بن أفراثيم بن يوسف بن يعقوب بن إسحاق بن إبراهيم -عليهم السلام-، وقد بُعث بعد ابن عمه إلياس -عليه السلام- في بعلبك وما حولها لدعوة الناس إلى وحدانية الله ونبذ كافة مظاهر الشِّرك والبُعد عن الله وأُرسل مؤيدًا بعدة معجزاتٍ كإحياء الموتى وإبراء الأكمه والأبرص وتجفيف نهر الأردن كي يسير عليه كما ذكرت ذلك كُتب بني إسرائيل، وهذا المقال يُسلط الضوء على قصة اليسع -عليه السلام",
    "part2":"جاء ذِكره -عليه السلام- ضِمن مجموعة من الرُّسل إذ لم يذكر القرآن الكريم وكتب التفسير الكثير عن حياته -عليه السلام- سوى أنّه كُلف من الله تعالى بتبليغ الدعوة إليه بعد إنتقال نبي الله إلياس -عليه السلام- إلى الرفيق الأعلى في مدينة بانياس من مدن الجمهورية السورية حاليًا، فشرع في الدعوة إلى الله بكل إخلاصٍ وأمانةٍ سائرًا علة نهج من سبقه من الأنبياء خاصةً سلفه إلياس -عليه السلام-، وفي الزمن الذي بُعث فيه اليسع -عليه السلام- كانت قد كثُرت الذنوب والخطايا وازداد عدد الملوك والطغاة والجبابرة الذين أمعنوا في الأنبياء والمؤمنين تقتيلًا وتشريدًا وتنكيلًا فدعاهم -عليه السلام- إلى الرجوع عن غيِّهم لكنهم أصروا واستكبروا استكبارًا ورفضوا الانصياع للحق فاستمر نبيهم في دعوتهم إلى أن توفاه الله فسلَّط الله على بني إسرائيل من سامهم سوء العذاب كما جاء في القرآن الكريم.",
    "part3":"",
    "part4":"",

  },
  {
    "nabi" :"داود عليه السلام",
    "color": Colors.deepPurpleAccent.withOpacity(0.7),
    "part1":"هو داود بن إيشا بن عويد بن باعز بن سلمون بن نحشون بن عمي نادب بن رام بن حصرون بن فارص بن يهوذا بن يعقوب بن اسحق بن ابراهيم، كان عليه السلام نقي القلب طاهر، قصير الجسد قليل الشعر،[١]جمع الله تعالى له خير الدنيا والآخرة وهما النبوّة والملك، كان الملك فيما سبق في سبط والنبوّة في سبط آخر، حيث مال بنو إسرائيل له وملّكوه عليهم بعدما خرج في جيش طالوت مواجهاً جيش جالوت فقتله بعد مبارزته وهذا الغالب، وقيل أن شمويل ولّاه قبل الواقعة، وقد كان عليه السلام صانعاً للدروع، فيأكل من عمل يده،[٢]وقد منّ الله عليه بصفات جعلت منه قائداً ناجحاً، حيث أعطاه الملك والحكمة في الحقوق وعدل قضاء الله ونور البصيرة، إضافة إلى العلم الشرعي الذي تبلور بعد أن أنزل الله عليه كتابه الزبور، والعلم المادي كصناعة الدروع.",
    "part2":"لقد ذكر الرسول ما تميّز به أخيه نبي الله داوود في تأدية العبادات، التي لها ميزات وخصائص جعلت منه أعبد الناس، كما وصفه الرسول الذي اعتاد على مدح وذكر ما يتفوّق به أنبياء الله، فقد كان صيام داوود أحب الصيام إلى الله، حيث يصوم نصف الدهر فيفطر يوم ويصوم يوم،[٤]أمّا قيام الليل فكان ينام نصف الليل الأوّل ثم يستيقظ قيقوم من النصف الثاني من الليل بما قدره الثلث، ثم ينام ما بقي من الليل حتى طلوع الفجر، وهذا ما كان يفعله رسول الله محمد، حيث قال في طريقة تعبّد داود: (أَحَبُّ الصلاةِ إلى اللهِ صلاةُ داودَ عليهِ السلامُ، وأَحَبُّ الصيامِ إلى اللهِ صيامُ داودَ، وكان ينامُ نصفَ الليلِ ويقومُ ثُلُثَهُ، وينامُ سُدُسَهُ، ويصومُ يومًا ويُفْطِرُ يومًا).",
    "part3":"أورد علماء السير والأخبار أن آدم عليه السلام عندما أراه الله ذرّيته، طلب منه أن يزيد داوود سنين في عمره بعدما علم أنه سيُقبض وهو بعمر الستين، فمنحه الله أربعين زيادة وأنقصها من عمر آدم، وعليه فإن عمر داوود هو مئة عام وهو الغالب، فيما قال أهل الكتاب أن عمره سبع وسبعون، وقد حكم في ملكه أربعين عاماً، أمّا وفاته فقد ورد أنه كان شديد الغيرة على أهل بيته، حيث كان يُغلق الباب خلفه إذا ما خرج ولا يُفتح إلّا عندما يكون متواجداً، فعاد يوم إلى بيته فرأى رجلاً فسأله عن نفسه، فرد عليه بأنّه الذي لا يهاب الملوك ولا يمنعه حجاب، فعلم أنه ملك الموت ورّحب به وبأمر الله قُبضت روحه.",
    "part4":"",
  },
  {
    "nabi" :"سليمان عليه السلام",
    "color": Colors.deepPurple.withOpacity(0.7),
    "part1":"لقد ورد ذكر قصّة سيّدنا سليمان عليه السّلام في القرآن الكريم في عدّة سور، ومنها سورة الأنبياء، وص، والنّمل، وسليمان عليه السّلام هو واحد من أعظم الأنبياء الذين تحدّث عنهم القرآن الكريم، وقد كان ملكاً ونبيّاً عظيماً، وابن ملك ونبيّ عظيم، وهو داوود عليه السّلام، قال الله سبحانه وتعالى: وَوَرِثَ سُلَيْمَانُ دَاوُدَ  النمل/16. وقال ابن كثير: ورثه في النبّوة والملك دون المال، لأنّ مال الأنبياء لا يورّث وما تركوه صدقة، وقد خصّه الله تعالى بأشياء قصّها علينا القرآن الكريم، منها أنّ الله تعالى علمه منطق الطير... وملكه على الإنس والجنّ والطير... قال الله تعالى: وَحُشِرَ لِسُلَيْمَانَ جُنُودُهُ مِنَ الْجِنِّ وَالْأِنْسِ وَالطَّيْرِ فَهُمْ يُوزَعُونَ  . قال الله سبحانه وتعالى: فَسَخَّرْنَا لَهُ الرِّيحَ تَجْرِي بِأَمْرِهِ رُخَاءً حَيْثُ أَصَابَ* وَالشَّيَاطِينَ كُلَّ بَنَّاءٍ وَغَوَّاصٍ* وَآخَرِينَ مُقَرَّنِينَ فِي الْأَصْفَادِ* هَذَا عَطَاؤُنَا فَامْنُنْ أَوْ أَمْسِكْ بِغَيْرِ حِسَابٍ* وَإِنَّ لَهُ عِنْدَنَا لَزُلْفَى وَحُسْنَ مَآبٍ ، ص، وقد عاش سليمان عليه السّلام قرابة الاثنين وخمسين عاماً، وكان ملكه أربعين عاماً، وقد نقله ابن كثير في قصص الأنبياء عن الزّهري وغيره، وقال ابن جرير كان عمره نيفاً وخمسين سنةً.",
    "part2":"لقد قصّ الله سبحانه وتعالى خبر وفاة سليمان عليه السّلام في القرآن الكريم، وكيف أنّ موته قد خفي على الجنّ، وذلك حتّى يعلم النّاس أنّ الجنّ غير مطلعين على أمور الغيب، ولم تذكر المدّة التي بقي فيها الجنّ يعملون دون أن يعلموا أنّ الله سبحانه وتعالى قد قبض روح سليمان عليه السّلام.",
    "part3":"",
    "part4":"",

  },
  {
    "nabi" :"زكريا عليه السلام",
    "color": Color(0xff453658),
    "part1":"سيدنا زكريا عليه السلام هو أحد الأنبياء والمرسلين الذي بعثهم الله عز وجل على عباده حتى يخرجوهم من ظلمات المعاصي والشرك الى نور الطاعة والتوحيد ، وينتهي نسب سيدنا زكريا عليه السلام الى يعقوب بن اسحاق عليه أفضل الصلوات وأتم التسليم وقد عرف من خلال كتاب الله تبارك وتعالى ان عهد سيدنا زكريا عليه السلام كان قريبا جدا من عهد سيدنا عيسى عليه السلام ،",
    "part2":"بدأت قصة سيدنا زكريا عليه السلام عندما تقدم في السن وملأ الشيب شعره وكذلك زوجه ولم تكن قد ولدت له ولدا تقر به عينه ويرثه بعد مماته وقد كان أقرابئه من بني عمومته أشرار فجار لم يكونو ليلتزموا في الشريعة الا من خلال وازع ورادع يردعهم ولو خلوا بينهم وبين نفوسهم التي تحمل الشر الكبير فانهم سوف يقومون بمحو الشريعة ونشر الفساد والفتن ويقومون بتغير معالم الكتاب",
    "part3":"وقد نزل كتاب الله تبارك وتعالى معبرا عن حال زكريا عليه السلام وذلك بقوله على لسان زكريا عليه أفضل الصلوات واتم التسليم : ( قال ربي اني وهن العظم مني واشتعل الرأس شيبا ولم أكن بدعائك ربي شقيا * واني خفت الموالي من ورائي فهب لي من لدنك وليا * يرثني ويرث من آل يعقوب واجعله ربي رضيا ) وقد قيل أن زكريا عليه السلام كان خائفا من قومه أن يغيروا ويبدلوا من بعده فيقومون بانتهاك محارم الله عز وجل ولذلك حرص على الدعاء والتوسل الى الله تبارك وتعالى من أجل أن يرزقه الله بغلام يحمل راية النبوة والتوحيد من بعده",
    "part4":"بقيت هذه الخاطرة تسيطر على تفكير زكريا عليه السلام وتأرقه بشدة ليلا ونهارا الى أن قام ذات يوم بالذهاب الى معبد كي يتعبد ويتقرب فيه الى الله عز وجل فيه ، فعندما قام بالدخول على مريم عليها السلام وجدها في ذلك الوقت رابضة في محرابها ، وغارقة في تفكيرها ووجد عندها مالم يعتد على رأيته حيث أنه كان قد رأى عنده من فاكهة الصيف بينما كان ذلك الوقت وقت الشتاء فقام زكريا عليه السلام بسؤالها فورا من أين لك ذلك عندما أجابت أنه من عند الله فتوجه سيدنا زكريا عليه السلام الى ربه مصليا وداعيا وراجيا له عندما غاص عليه السلام في هذا التأمل وهذه الحالة التي لم يدركها جيدا قبل ذلك فخشع قلبه وانطلق لسانه قائلا : ( رب هب لي من لدنك ذرية طيبة انك سميع الدعاء ) فكان من الله تبارك وتعالى وبعد أن رأى خشوعه وتوجهه الصادق نحوه أن بعث له الملائكة مبشرين له أن الله تبارك وتعالى سيرزقه بغلام لم يجعل له من قبل سميا ، وكان أن رزقه الله تارك وتعالى يحي عليه السلام وأورثه النبوة من بعد أباه",

  },
  {
    "color": Colors.indigo.withOpacity(0.7),
    "nabi" :"يحي عليه السلام",
    "part1":"كانت دعوة يحيى عليه السلام في زمن دعوة عيسى عليه السلام بالاضافة إلى والده الرسول الكريم زكريا عليه السلام ، وكان ليحيى عليه السلام مزايا اختصّ بها كما ورد في كتاب الله عز وجل كإختصاصه بالاسم من عند الله عز وجلّ وانفراده كأول اسم ، وكذلك وصفه بالسيّد وأنه حصورٌ عفيف وأنه زكاة من الله وحنانا وكان تقيّا وكان بارّا ولم يكن جبّارا عصيّا آتاه الله الحكمة والنبوّة وأن الله سلّم عليه عند ولادته وموته وحين بعثه.",
    "part2":"والراجح لدى أهل التاريخ أنّ دعوة يحيى عليه السلام كانت في منطقة الشام والأردن حيث تم تعميد النبي يحيى عليه السلام في منطقة نهر الاردن حيث تسمّى اليوم بالمغطس ( منطقة في وادي نهرالاردنّ) بالقرب من دعوة سيدنا عيسى عليه السلام حيث لقّب سيدنا يحيى عليه السلام بالمعمدان ( يوحنّا المعمدان ) .",
    "part3":"أمّا قصة وفاة سيدنا يحيى عليه السلام فقد تضاربت فيها الأقوال والروايات ولكن الإجماع فيها على أنه قُتِل عليه السلام ولم يمت موتاً طبيعيأ ، وقد قتله الملك هيرودس –أحد ملوك ذلك الزمان – وقصّة القتل أنّ ذلك الملك أراد الزواج من إحدى محارمه وهو أمر محرّم عليه زواجها وكان النبيّ يحيى عليه السلام مخوّفا لهم من الفعل الشنيع والمنكر الفظيع الذي ينوي الملك فعله وتنوي تلك الفتاة الاقبال عليه ، وكان بينها وبين الملك حبّا ورغبة في الزواج وكان يحيى عليه السلام كعادة الانبياء الكرام آمرين بالمعروفين ناهين عن المنكر حتى لو بُذلت الأرواح والمُهَج في سبيل ذلك ، فما كان من تلك الفتاة إلّا أن طلبت من الملك أن يقتل لها يحيى عليه السلام برهاناً على صدق المحبّة ومقربة لها فما كان منه الأ أن ارسل اليه من قتله وقطع رأسه الشريف وأتاها به في طست ووضعه بين يديها عليهم اللعنة والغضب ولا حول ولا قوة الا بالله.",
    "part4":"ومن الشواهد الحاضرة على مكان مقتل النبي يحيى عليه السلام القلعة التي تقبع في منطقة مكاور ( في الأردن – جنوبي مدينة مادبا التاريخية) حيث فيها من الشواهد التاريخية ما يؤكّد حدوث هذه الجريمة التي لم يشهد التاريخ مثلها .",

  },
  {
    "nabi" :"عيسي عليه السلام",
    "color": Colors.deepPurpleAccent.withOpacity(0.7),
    "part1":"عيسى عليه السلام معجزة بحد ذاته، منذ أن حملت به والدته البتول مريم إلى ولادته إلى حياته كاملة، فقد جاء الملك جبريل إلى السيدة مريم وهي تتعبد، حيث بشرها بأنّها ستلد ابناً له قدسية، وأنه سيكون رسولاً من رسل الله ونبياً من أنبيائه دون أن يكون له والد، وهذه هي المعجزة بحدّ ذاتها، فعيسى لم يولد كما ولد باقي الناس، بل كانت ولادته استثنائية، وكان حمل والدته به أيضاً استثنائياً. عندما حان موعد الولادة انتبذت مريم عليها السلام مكاناً قصياً، ووضعت حملها عند جذع نخلة، وفجر الله تعالى من تحتها الماء حتى تشرب منه، وهزت جذع النخلة فتساقطت عليها حبات الرطب، وقد ولد رسول الله عيسى عليه السلام في المكان الذي يعرف اليوم باسم بيت لحم وهو جزء من الأرض المقدسة (فلسطين)",
    "part2":"حملت السيدة العذراء ابنها المقدس وعادت به إلى قومها، فتعجب الناس من هذا الابن، وبدأوا باتهامها بأنها لمست رجلاً غريباً عنها، إلا أن الله تعالى أنطق رسوله وهو في المهد وتكلم بكلام عجيب فأسكت كل من سمع صوته، قال تعالى: (قَالَ إِنِّي عَبْدُ اللَّهِ آَتَانِيَ الْكِتَابَ وَجَعَلَنِي نَبِيًّا، وَجَعَلَنِي مُبَارَكًا أَيْنَ مَا كُنْتُ وَأَوْصَانِي بِالصَّلَاةِ وَالزَّكَاةِ مَا دُمْتُ حَيًّا، وَبَرًّا بِوَالِدَتِي وَلَمْ يَجْعَلْنِي جَبَّارًا شَقِيًّا، وَالسَّلَامُ عَلَيَّ يَوْمَ وُلِدْتُ وَيَوْمَ أَمُوتُ وَيَوْمَ أُبْعَثُ حَيًّا).",
    "part3":"عندما كبر المسيح أرسله بالرسالة، وأنزل عليه كتابه الإنجيل وبدأ رسول الله المسيح بالسير في الأرض ودعوة الناس، وقد آمن له ولدعوته الكريمة الحواريون الذين تربوا على يديه الشريفتين، وتعلموا منه، وسمعوا كلامه الحكيم، وقد أيده الله تعالى بمعجوات عديدة منها إحياء الموتى، وشفاء الأبرص، ويصنع الطير من الطين فيصير حقيقياً، وغير ذلك وكل هذه المعجزات كانت تحدث بإذن من الله تعالى.",
    "part4":"في نهاية رحلته عليه السلام تآمر اليهود عليه خشية أن يفتتن الناس ويتبعوه بسبب معجزاته، ويمكن القول أنّ نهاية المسيح هي موضع الاختلاف بين الروايتين المسيحية والإسلامية، وقد أشار القرآن الكريم إلى النهاية بقوله تعالى: (وَقَولِهِم إِنا قَتَلنَا المَسِيحَ عِيسَى ابنَ مَريَمَ رَسُولَ اللهِ وَمَا قَتَلُوهُ وَمَا صَلَبُوهُ وَلَـكِن شُبّهَ لَهُم وَإِن الذِينَ اختَلَفُوا فِيهِ لَفِي شَك منهُ مَا لَهُم بِهِ مِن عِلمٍ إِلا اتبَاعَ الظن وَمَا قَتَلُوهُ يَقِيناً، بَل رفَعَهُ اللهُ إِلَيهِ وَكَانَ اللهُ عَزِيزاً حَكِيماً).",
  },
  {
    "nabi" :"محمد صلي الله عليه وسلم",
    "color": Colors.deepPurple.withOpacity(0.7),
    "part1":"هو أبو القاسم، محمد بن عبد الله بن عبد المطلب بن هاشم بن عبد مناف بن قصي بن كلاب بن مّرة بن كعب بن لؤي بن غالب بن فهر، القرشيّ؛ أمه آمنة بنت وهب.[١] و أسماء الرسول الكريم وألقابه كثيرةٌ جداً، فمنهم من أوصلها إلى مئتين أو أكثر، وما ورد في القرآن منها: الشاهد، والمبشّر، والنذير، والمبين، والداعي إلى الله، والسراج المنير، والمذكّر، والرحمة، والنعمة، والهادي، والشهيد، والمزمل، والأمين، والمدثر، ومنها ما ورد في السنة مثل: أحمد، ومحمد، ومن الأسماء المشهورة: المختار، والمصطفى، والشفيع، والمشفّع، والصّادق.",
    "part2":"إنّ نبي الله محمد -صلى الله عليه وسلم- قد ضرب لنا أروع الأمثلة في صلة الرحم، فهو أكمل البشر، وكان شديد الحرص على هداية أقاربه ودخولهم في الإسلام،[٣] وفيما يأتي أسماء أقاربه وعائلته:[٤][١] زوجاته: خديجة بنت خويلد، سودة بنت زمعة، عائشة بنت أبي بكر الصديق، حفصة بنت عمر بن الخطاب، زينب بنت خزيمة، أم سلمة هند بنت أبي أمية، زينب بنت جحش، جويرية بنت الحارث، أم حبيبة رملة بنت أبي سفيان، صفية بنت حيي بن أخطب، ميمونة بنت الحارث الهلالية. أبناؤه: القاسم، عبد الله، إبراهيم، وبناته: زينب، ورقية، وأم كلثوم، وفاطمة. أعمامه وعمّاته: أبو طالب، والزبير، وعبد الكعبة، وأم حكيم البيضاء، وصفية، وعاتكة، وبرّة، وأروى، وأميمة. أخواله وخالاته: لم يكن لآمنة أخ، إلا ما سمّته بنو زهرة عبد يغوث بن وهب، وله خالتين فاختة، والفريعة",
    "part3":"المعجزة هي الأمر الخارق للعادة، يجريه الله على يد نبيّه، ومن معجزات سيدنا محمد: القرآن الكريم، ورحلة الإسراء والمعراج، وانشقاق القمر، ونبع الماء من بين أصابعه، وبركة الطعام والشراب بين يديه وكثرته، والقدرة على رؤية أصحابه من وراء ظهره، وشكوى البعير له، وإخبار الذئب بنبوّة سيدنا محمد، وحنين الجذع شوقاً له، وتسليم الحجر عليه، وكلام الشاة المسمومة له، والريق المعالج، وإخباره لأحداثٍ في المستقبل ووقوعها؛ مثل ظهور الإسلام وانتشاره، وحديثه عن استشهاد بعض الصحابة في حياتهم، أو بعد موته، وإخباره عن فتوحات بلاد فارس، ومصر، واليمن، والشام، والعراق، وإخباره عن حدود دولة الإسلام، واجتماع الأمم على قتال المسلمين.",
    "part4":"يجب على كل مسلمٍ معرفة النبي، ومعرفةُ صفاته الخَلقيّة والخُلقيّة، وفيما يأتي بعض هذه الصفات:[٧] صفاته الخَلقيّة: كان -عليه الصلاة والسلام- ليس بالطويل، ولا بالقصير، أمّا وجهه فكان أبيضاً مشرّباً بالحمرة، حسن الوجه، عظيم الفك، طويل شق العين، وكانت لحيته كثّة، يعفيها ويسرِّحها، وكان يكتحل، وهو ضخم القدمين، رجلاً مربوعاً، بعيد ما بين المنكبين، وكان عظيم شعر الجمّة إلى شحمتيّ أذنيه، وكان قليل الشيب برأسه ولحيته. صفاته الخُلقيّة: فقد كان أحسن الناس خُلقاً، وأكثر الناس طاعةً لله، وكان أكرمهم، وأشجعهم، وأصبرهم، وأخشعهم، يأكل من الطعام ما تيسّر من المباح، يقبل الهدية، ولا يقبل الصدقة، يخصف نعله، يرقع ثوبه، ويحلب شاته، ويخدم أهله، يحب المساكين، ويشهد جنائزهم، ويعود مرضاهم، لا يحقر فقيراً، ولا يهاب ملكاً، يركب ما تيسّر، خاتمه فضة يلبسه في خنصره الأيمن، وكان يعصب بطنه بالحجر من شدّة الجوع، يتجمّل بالأعياد، ويحب النظافة والسواك، كان إذا كره شيئاً عُرفَ من وجهه، وهو سيد المتوكّلين والقائمين، كثير الذكر، دائم الفكر، طويل الصلاة، قصير الخطبة، يحبّ الطيب، ويكره الروائح الكريهة، بسّاماً، ضحوكاً في بعض الأوقات، يقبل العذر، يتكلم بجوامع الكلم، وقد جمع الله له مكارم الأخلاق، ومحاسن الأفعال كلها.",
  },
];
var KholafaList=[
  {
    "khalifa":"ابو بكر الصديق",
    "color":Colors.deepPurpleAccent.withOpacity(0.7),
    "part1":"هو عبد الله بن أبي قُحافة عثمان بن كعب التيميّ القرشيّ، وأمّه هي سلمى بنت صخر بن عامر التيميّ، وُلِد قبل الهجرة بواحد وخمسين عاماً، وكان سيّداً من سادات قريش ومن أعرف النّاس بأنسابها، عُرف برجاحة العقل والحكمة حتى إنّه حرّم شرب الخمر على نفسه، كما رفض عبادة الأصنام في الجاهليّة، إذْ كان حنيفاً على ملّة إبراهيم عليه السّلام، وعَمِل في بيع الثياب، وتزوّج في بداية شبابه بقُتيلة بنت عبد العزّى، ثمّ تزوج من أمّ رومان بنت عامر بن عُويمر.[١] كان أبو بكر -رضي الله عنه- أوّل من صدّق الرّسول -صلّى الله عليه وسلّم- وآمن به من الرّجال، فكان من أحبّ النّاس إلى الرّسول -صلّى الله عليه وسلّم- فقال فيه: (إنَّ مِن أمَنِّ الناسِ علَيَّ في صُحْبَتِهِ ومالِهِ أبا بكرٍ، ولو كنتُ مُتَّخِذاً خَليلاً غيرَ رَبِّي لا تَّخَذْتُ أبا بكرٍ، ولكِنْ أُخوَّةُ الإسْلامِ ومَوَدَّتُهُ، لا يَبْقَيَنَّ في المسجِدِ بابٌ إلا سُدَّ إلا بابَ أبي بكرٍ)،[٢] تولّى أبو بكر -رضي الله عنه- الخلافة بعد رسول الله -صلّى الله عليه وسلّم- سنة إحدى عشرة للهجرة، وبقي خليفةً للمسلمين قرابة سنتين وأربعة أشهر، وتوفّي سنة 13 للهجرة، ودُفن بجوار الرّسول صلّى الله عليه وسلّم، وكان له حينها من الأولاد: عبد الله وعبد الرحمن ومحمّد وأسماء وعائشة وأمّ كلثوم",
    "part2":"كان الصّديق -رضي الله عنه- من أخصّ الخواص والأصحاب لرسول الله -صلّى الله عليه وسلّم- قبل الإسلام، وحينما عرض عليه الرّسول -صلّى الله عليه وسلّم- الرّسالة والتوحيد لم يتردّد بتصديق النبيّ -صلّى الله عليه وسلّم- والدخول في الإسلام، ولم يكتفِ بذلك بل سارع إلى نشر دعوة الإسلام بنفس اللحظة التي تلقّاها من الرّسول، فأسلم على يده ستة من العشرة المُبشّرين بالجنّة مع غيرهم من الصحابة، وكان أبو بكر -رضي الله عنه- من السّابقين لأعمال الخير بعمومها، فحين اشتدّ العذاب على المسلمين في بداية الدّعوة بسبب إسلامهم أعتق أبو بكر -رضي الله عنه- عشرين صحابيّاً، أنفق في ذلك أربعين ألف دينار.[٣][٤] كان أبو بكر في الهجرة رفيق رسول الله صلّى الله عليه وسلّم، وكان نِعْم الرّفيق إذْ إنّه حماه بكلّ ما أوتي من قوّة وانتباه، فكان يمشي تارةً خلف الرّسول وتارةً أمامه ومرّةً عن يمينه وأخرى عن شماله، ولمّا دخلا الغار زاد حرصه على النبيّ حتى لا يُصيبه شيء يؤذيه، وعندما وصل المشركون إليهم، خاف أبو بكر على الرّسول، فقال له الرّسول مطمئناً: (ما ظنُّك باثنَينِ اللهُ ثالثُهما)،[٥] وبعد ذلك أتمّ أبو بكر مهمّته في حماية الرّسول حتى بلغ معه المدينة المنوّرة، وساهم أبو بكر مع الصّحابة في إعمار الدّولة الإسلاميّة في المدينة، وشارك مع الرّسول في كلّ المشاهد التي شهدها، وكلّفه الرّسول بعدّة مهمّات، منها: إمارته لبعثة الحجّ، وإمامة المسلمين في مرض الرّسول عليه السّلام.[٤][٣] بُويع أبو بكر خليفةً لرسول الله -صلّى الله عليه وسلّم- بعد وفاته، حيث إنّه تحلّى بالحكمة والثبات على المبادئ من أوّل يوم في عهد الخلافة، فثبت يوم وفاة الرّسول -عليه السّلام- برغم الفاجعة وهول المُصاب، حيث كان الكثير من الصّحابة تخبّطوا من ذلك، كما أنّه ثبت على مبادئ الإسلام وأركانه، فكان قائداً عسكريّاً قويّاً ومُحنّكاً فدافع عن المدينة والدّولة ومقدّراتها ومكاسبها، ولم تمض أيام على وفاة الرّسول -عليه السّلام- حتى أرسل الجيوش لتثبيت جزئيّات الدّين التي أصبحت ممّا يتفاوض فيها من المرتدّين، ثمّ أُرسلت جيوش أخرى إلى أكبر إمبراطوريتان في العالم؛ الفرس والرّوم، فكان ذلك تمهيداً لسقوطهما واختفائهما.",
    "part3":"كان الصّديق -رضي الله عنه- من أخصّ الخواص والأصحاب لرسول الله -صلّى الله عليه وسلّم- قبل الإسلام، وحينما عرض عليه الرّسول -صلّى الله عليه وسلّم- الرّسالة والتوحيد لم يتردّد بتصديق النبيّ -صلّى الله عليه وسلّم- والدخول في الإسلام، ولم يكتفِ بذلك بل سارع إلى نشر دعوة الإسلام بنفس اللحظة التي تلقّاها من الرّسول، فأسلم على يده ستة من العشرة المُبشّرين بالجنّة مع غيرهم من الصحابة، وكان أبو بكر -رضي الله عنه- من السّابقين لأعمال الخير بعمومها، فحين اشتدّ العذاب على المسلمين في بداية الدّعوة بسبب إسلامهم أعتق أبو بكر -رضي الله عنه- عشرين صحابيّاً، أنفق في ذلك أربعين ألف دينار.[٣][٤] كان أبو بكر في الهجرة رفيق رسول الله صلّى الله عليه وسلّم، وكان نِعْم الرّفيق إذْ إنّه حماه بكلّ ما أوتي من قوّة وانتباه، فكان يمشي تارةً خلف الرّسول وتارةً أمامه ومرّةً عن يمينه وأخرى عن شماله، ولمّا دخلا الغار زاد حرصه على النبيّ حتى لا يُصيبه شيء يؤذيه، وعندما وصل المشركون إليهم، خاف أبو بكر على الرّسول، فقال له الرّسول مطمئناً: (ما ظنُّك باثنَينِ اللهُ ثالثُهما)،[٥] وبعد ذلك أتمّ أبو بكر مهمّته في حماية الرّسول حتى بلغ معه المدينة المنوّرة، وساهم أبو بكر مع الصّحابة في إعمار الدّولة الإسلاميّة في المدينة، وشارك مع الرّسول في كلّ المشاهد التي شهدها، وكلّفه الرّسول بعدّة مهمّات، منها: إمارته لبعثة الحجّ، وإمامة المسلمين في مرض الرّسول عليه السّلام.[٤][٣] بُويع أبو بكر خليفةً لرسول الله -صلّى الله عليه وسلّم- بعد وفاته، حيث إنّه تحلّى بالحكمة والثبات على المبادئ من أوّل يوم في عهد الخلافة، فثبت يوم وفاة الرّسول -عليه السّلام- برغم الفاجعة وهول المُصاب، حيث كان الكثير من الصّحابة تخبّطوا من ذلك، كما أنّه ثبت على مبادئ الإسلام وأركانه، فكان قائداً عسكريّاً قويّاً ومُحنّكاً فدافع عن المدينة والدّولة ومقدّراتها ومكاسبها، ولم تمض أيام على وفاة الرّسول -عليه السّلام- حتى أرسل الجيوش لتثبيت جزئيّات الدّين التي أصبحت ممّا يتفاوض فيها من المرتدّين، ثمّ أُرسلت جيوش أخرى إلى أكبر إمبراطوريتان في العالم؛ الفرس والرّوم، فكان ذلك تمهيداً لسقوطهما واختفائهما.",
    "part4":"قام أبو بكر الصّديق بالكثير من الأعمال زمن خلافته، وفيما يأتي بيان بعض إنجازاته: قام بالحرب على المرتدّين، فقد شاعت الأخبار بأنّ عدداً من القبائل ارتدّت عن الدّين بعد وفاة الرّسول صلّى الله عليه وسلّم، فكان لا بدّ من الحزم في هذه المسألة وعدم تركها تساهلاً، فجهز أبو بكر الجيوش لمقاتلة المرتدّين عن الدّين، وكانت معركة اليمامة من أهمّ المعارك التي قُتل فيها مسيلمة الكذّاب الذي ادّعى النبوّة بعد وفاة النبيّ صلّى الله عليه وسلّم.[١٠] جَمْع القرآن الكريم، إذْ لم يكن القرآن الكريم مجموعاً في مصحف واحد، بل كان متفرّقاً كلّ سورةٍ أو جزء منها في مجموعة أوراق، وبعدأن استشهد الكثير من الصّحابة وحفظة القرآن في حروب الرّدّة اقترح عمر بن الخطّاب -رضي الله عنه- على أبي بكر أن يُجمع القرآن بين لوحين حفظاً له فتردّد ثمّ انشرح صدره، وبدأ باختيار الصّحابة الذين سيوكّل لهم هذه المهمّة العظيمة، فاختار على رأسهم زيد بن ثابت رضي الله عنه.[١١] سيّر أبو بكر جيش أسامة، حيث كان الرّسول -صلّى الله عليه وسلّم- عقد لواء جيش أسامة قبل وفاته، وكان الجيش متوجّهاً لقتال الرّوم في الشّام، وبالرّغم من المصائب التي حلّت بالمسلمين من ارتداد بعض القبائل، وتجهيز عدداً كبيراً من الجيوش لمحاربة المرتدّين إلّا أنّ أبا بكر أصرّ على خروج جيش أسامة في المهمّة التي وضعها الرّسول صلّى الله عليه وسلّم، إذ لم يشأ أن يحلّ لواءً عقده الرّسول صلّى الله عليه وسلّم.[١٢] أغاث أبو بكر المحتاج وحقّق التكافل الاجتماعي بين المسلمين، فكان بيت مال المسلمين قبلةً للفقراء، ولمّا توفّي أبو بكر لم يكن في بيت المال إلّا درهم واحد.",
  },
  {
    "khalifa":"عمر بن الخطاب",
    "color":Colors.deepPurple.withOpacity(0.7),
    "part1":"هو عمر بن الخطاب بن نُفيل بن عبد العزّى بن رياح بن عبد الله بن قرط بن رزاح بن عدي بن كعب بن لؤي بن غالب بن فِهر بن مالك بن النضر بن كنانة بن خزيمة بن مُدرِكة بن إلياس بن مُضر بن نزار بن مَعَدِّ بن عدنان، أبو حفص العدوي، وأم عمر حنتمة بنت هشام بن المغيرة بن عبد الله بن عمر بن مخزوم أخت أبي جهل بن هشام،[١] وعمر -رضي الله عنه- من أشراف قريش في الجاهلية، له المكانة الرفيعة عندهم، والكلام المسموع بينهم، صاحب فراسةٍ وفطنةٍ ودهاءٍ، متميزٌ بالشجاعة والقوة والهيبة، حتى قال فيه ابن مسعود رضي الله عنهما: (ما زلنا أعزّةً منذ أسلم عمر).[٢] Volume 0%   ذُكر عن عمر -رضي الله عنه- أنّه كان طويلاً وجسيماً، حتى فاق الناس في طوله، أصلعاً شديد الصلع، أبيضاً فيه حُمرةً، وأمّا في عباداته وعلاقته بربه، فقد كان يتميّز بطول القيام والصلاة، رقيق القلب، كثير الصيام والصدقة، عظيم الخشية لله تعالى، حتى ورد عنه أنّه نظر إلى تِبنٍ فقال: (ليتني كنتُ هذه التّبنة، ليتني لم أُخلق، ليت أمي لم تلدني، ليتني لم أكن شيئاً، ليتني كنت نسياً منسيّاً)، وبالرغم مِن رقّة قلبه ولينه وخشوعه بين يدي الله -تعالى- إلا أنّه كان قوياً شديداً ينصر المسلمين ويَردّ كيد المشركين، حتى لقّبه رسول الله -صلّى الله عليه وسلّم- بالفاروق، ويُقصد أنّه يفرّق بين الحقّ والباطل، ناصرٌ لدين الله، حتى كره الشيطان لقاءه ومواجهته",
    "part2":"رُوي في قصة إسلام عمر بن الخطاب أنّه سمع عن إسلام أخته فاطمة وزوجها سعيد، فانطلق باتجاههما بُغية أذيتهما لهذا، وكان عندهما خبّاب بن الأرت يعلمهما القرآن الكريم، فلمّا طرق عمر -رضي الله عنه- الباب، اختبأ خبّاب، ودخل عمر غاضباً فضرب أخته فشجّها، ثمّ طلب إليها أن تناوله الصحيفة التي في يدها فرفضت؛ لأنّه كافرٌ نجسٌ، وهذه الصّحيفة فيها قرآنٌ مطهّرٌ، وطلبت إليه أن يغتسل قبل أن يَمسّها، ففعل، ثمّ أخذها فقرأ منها سطراً واحداً، فانشرح صدره لها، فسأل أخته عن مكان النبيّ -صلّى الله عليه وسلّم- فخرج خبّاب من مخبأه، ودلّه على مكان النبيّ عليه السلام، فانطلق إليه عمر بن الخطاب، يطرق الباب، فلمّا عرف الصحابة أنّه عمر خافوا ووَجِلوا؛ لأنّه كان شديداً عليهم، فطمأنهم النبي صلّى الله عليه وسلّم، ثمّ أذن له فدخل، فلم يكد يرى النبيّ -صلّى الله عليه وسلّم- حتى نطق الشهادتين وأعلن إسلامه.[١] كان إسلام عمر بن الخطاب انفراجاً لضيق المسلمين، وفتحاً لهم، وقد فرحوا بإسلامه فرحاً عظيماً، إذ أمِن المسلمون بعد إسلامه أنْ يُصلّوا في جوار الكعبة، وقد كانوا يخافون قبل ذلك، وقد حسن إسلام عمر رضي الله عنه، وفَاقَ مَن قبله ومَن بعده، حتى امتدحه النبيّ -عليه السلام- في أكثر من موضعٍ، إذ قال فيه مرّةً: (إنّ اللهَ جعل الحقّ على لسانِ عمر وقلبِه)،[٤] وقال عنه النبيّ -صلّى الله عليه وسلّم- كذلك: (قد كانَ يكون في الأمم قبلكم محدّثون، فإن يكن في أمتي منهم أحد فإنّ عمر بن الخطاب منهم)،[٥] وإنّ لعمر -رضي الله عنه- توافقٌ مع القرآن الكريم كذلك؛ إذ تعدّدت الكلمات التي قالها عمر، ثمّ نزل القرآن الكريم في نفس لفظه، وذلك مثل سؤاله للنبيّ -صلّى الله عليه وسلّم- أنْ يتخذ من مقام إبراهيم مصلّى، فنزلت الآية الكريمة بعد ذلك: (َاتَّخِذُوا مِنْ مَقَامِ إِبْرَاهِيمَ مُصَلًّى)،[٦] وفي موضعٍ آخرٍ حين ثارت الغيرة بين نساء النبيّ -صلّى الله عليه وسلّم- فحذّرهنّ بطريقة نزلت فيها الآية بعد ذلك، وهي الآية الكريمة: (عَسَى رَبُّهُ إِن طَلَّقَكُنَّ أَن يُبْدِلَهُ أَزْوَاجًا خَيْرًا مِّنكُنَّ مُسْلِمَاتٍ مُّؤْمِنَاتٍ قَانِتَاتٍ تَائِبَاتٍ عَابِدَاتٍ سَائِحَاتٍ ثَيِّبَاتٍ وَأَبْكَارًا).",
    "part3":"تولّى عمر خلافة المسلمين بعد أبي بكرٍ رضي الله عنهما، وذلك سنة ثلاث عشرة للهجرة، وقد ظهرت صفاته الشخصية جليةً وقت حكمه كذلك، فكان تقيّاً وَرِعاً، شديداً على الكفّار، متوسّعاً في الفتوحات، حتى فُتحت في عهده الفرس والرّوم، لكنّه وبالرغم من شدّته على الكفّار، إلّا أنّه كان رحيماً عطوفاً على المؤمنين، وقد ازداد عطفه وإشفاقه على المسلمين بعد توليه الخلافة إذ قال يوماً: (ثمّ إنّي قد وَلِيتُ أموركم أيّها الناس، فاعلموا أنّ تلك الشّدة قد أُضعِفت، ولكنّها إنّما تكون على أهل الظلم والتعدي على المسلمين، فأمّا أهل السلامة والدين والقصد، فأنا ألينُ لهم من بعضهم لبعض)، ولقد أصيب الناس بالمجاعة في عهده فغاب المطر وأجدبت الأرض، فكان عمر يأكل الخبز والزيت ويقول: (والله لا أشبع حتى يشبع أطفال المسلمين).",
    "part4":"روت أمّ المؤمنين حفصة -رضي الله عنها- أنّ أباها عمر بن الخطاب كان يسأل الله -تعالى- الشهادة في سبيله في بلد رسوله عليه السلام، ولقد أجاب الله -تعالى- دعوته؛ فقد خرج يوماً على المنبر يخاطب المؤمنين يقول لهم: (إنّي رأيتُ رؤيا كأنّ ديكاً نَقرَني نَقرتين، ولا أرى ذلكَ إلا لِحُضور أجلي)،[٩] ولقد أخبر عمر أسماء بنت عُميس برؤياه، فأوّلت ذلك بأنْ يقتله واحدٌ من العجم، فكان كذلك؛ ففي صلاة الفجر في يومٍ كان يسوّي الفاروق الصفوف ثمّ كبّر للصلاة، فما إنْ كبّر حتى صاح: (قَتلَني الكلب)، إذ تلقّى طعناتٍ من مجوسيّ يُقال له (فيروز)، ثمّ هرب هذا المجوسيّ يقتل من يمرّ عليه من الناس فقتل سبعةً آخرين، فأقبل إليه رجلٌ من المسلمين ألقى عليه بُرنساً ولفّه به، فلمّا أيقن المجوسيّ أنّه قد أُلقي القبض عليه نحر نفسه فمات من فوره، وبقي عمر -رضي الله عنه- ينزف دماً بضع ساعاتٍ، أرسل فيها إلى أمّ المؤمنين عائشة -رضي الله عنها- يستأذنها أنْ يُدفن بجوار صاحبيه رسول الله وأبي بكرٍ فأذنت له، ثمّ فارق الفاروق الحياة -رضي الله عنه- بعدها، ودُفن كما سأل الله تعالى، بمدينة صاحبه صلّى الله عليه وسلّم.",
  },
  {
    "khalifa":"عثمان بن عفان",
    "color":Color(0xff453658),
    "part1":"كان الصّحابي الجليل عثمان بن عفان رضي الله تعالى عنه من الصّحابة السّابقين إلى الإيمان بدعوة الإسلام، فقد كان رابع من أسلم من الرّجال بعد أن عرضه عليه أبو بكر الصّديق الإيمان بالرّسالة، وما إن سمع كلام رفيقه أبو بكر حتّى شرح الله صدره وسارع إلى رسول الله عليه الصّلاة والسّلام معلنًا إسلامه، وحينما علم عمّه الحكم بن أبي العاص ابن أميّة بإسلام ابن أخيه غضب غضبًا شديدًا وقام بحبس عثمان وتقييده حتّى يثنيه عن دينه، ولكن عثمان بقي ثابتًا على دينه حتّى استيأس منه عمّه وتركه بعد أن رأى صلابته في دينه. كان الصّحابيّ الجليل عثمان بن عفان من أفضل النّاس قبل الجاهليّة؛ حيث كان النّاس يحبونه ويثقون به ويستشيرونه في كلّ أمورهم، وقد كانت أخلاقه حسنة ولم يسجد لصنم طوال حياته فضلًا عن اجتنابه الموبقات ومن بينها شرب الخمر، وقد كان تاجر ماهرًا ذا عقليّةٍ تجاريّة فذّة يسافر إلى الشّام والحبشة من أجل تجارته.",
    "part2":"وفي الإسلام اكتملت أخلاق عثمان بن عفان رضي الله عنه وتزيّنت بتاج الدّين والشريعة، وقد تميّز عثمان بن عفان بخصلةٍ لم يدركه فيها أحدٌ من الصّحابة وهي الكرم والإنفاق في سبيل الله تعالى؛ ففي غزوة تبوك وتسمّى بغزوة العسرة قام عثمان بن عفان بتجهيز ثلث الجيش حتّى قال الّنبي عليه الصّلاة والسّلام عنه ما ضرّ عثمان ما فعل بعد ذلك، وعندما هاجر المسلمون إلى المدينة المنوّرة كانت هناك بئر تسمّى بئر معونة يملكها كما قيل يهودي شجع يبيع النّاس ماءها فقام عثمان بن عفّان بشرائها منه بخمسة وثلاثين ألف درهم وجعلها وقفًا للمسلمين .",
    "part3":"بعد وفاة الخليفة الثّاني عمر بن الخطّاب رضي الله عنه تولّى الخلافة من بعده عثمان بن عفان فعمل بعمل سلفه واستنّ سنّتهم وإن اختلف في بعض الأمور عنهم مثل سياسته في تعيين الولاة وسياسته في العطاء، ومن أبرز الإنجازات في خلافته استكمال الفتوحات الإسلاميّة في الأمصار؛ حيث فتحت خراسان وأرمينيّة وسجستان وأرمينية وقبرص. وأنشئ في عهده أوّل أسطول بحري إسلامي يحمي الشّواطئ الإسلاميّة من هجمات البيزنطيين، وقد جمع عثمان بن عفان القرآن الكريم على لهجة واحدة وهي لهجة قريش، كما قام بتوسعة المسجد النّبوي .",
    "part4":"قُتِل عثمان بن عفان -رضي الله عنه- ظُلماً في اليوم الثامن عشر، من ذي الحِجّة، من السنة الخامسة والثلاثين للهجرة، وقد كان مقتله على يد جماعة مارقة اختلفت أغراضهم وأهواءهم، ولكنّهم اتّفقوا على عزل الخليفة وقتله",
  },
  {
    "khalifa":"علي بن ابي طالب",
    "color":Colors.indigo.withOpacity(0.7),
    "part1":"رُوي نسب علي بن أبي طالب عن الإمام أحمد بن حنبل -رحمه الله- إذ قال بأنّه علي بن أبي طالب بن عبد مناف بن عبد المطلب بن شيبة بن هاشم بن عمرو بن عبد مناف بن المغيرة بن قصي بن زيد بن كلاب بن مرة بن كعب بن لؤي بن غالب بن فهر بن مالك بن النضر بن كنانة بن خزيمة بن مدركة بن إلياس بن مضر، وأم علي -رضي الله عنه- هي فاطمة بنت أسد بن هاشم، ورُوي أنّها أول من أنجبت هاشمياً من نساء بني هاشم،[١] ويكنّى علي -رضي الله عنه- بأبي الحسن وأبي تراب.",
    "part2":"اختلفت الروايات في تحديد تاريخ ولادة علي بن أبي طالب -رضي الله عنه-؛ فروي أنّه وُلد بخمس أو ست عشر سنة قبل البعثة النبوية كما ورد عن الحسن البصري، ورُوي أنّ ولادته كانت قبل البعثة بعشر سنوات كما ورد عن ابن إسحاق، وهو ما رجّحه الإمام ابن حجر، وهو أيضاً أحد قولي محمد بن علي الذي قال أيضاً بأنّ علي وُلد قبل البعثة بخمس سنواتٍ،[٣] وكانت نشأته في ظلّ النبي -عليه الصلاة والسلام-، ذلك بعد أن طلب النبي من عمّه أبي طالب أن يُعيل أحد أبنائه بسبب مشقة العيش في مكة حينها بسبب الجدب الذي أصابها،[٤] كما أنّ الرسول -عليه الصلاة والسلام- أراد أن يقدّم لعمّه جميلاً مقابل تربيته له بعد وفاة جده عبد المطلب، فبقي علي في كنف النبي -عليه الصلاة والسلام-، وكان أول من آمن به وصدّقه من الصبيان بعد أن رآه يصلّي مع أم المؤمنين خديجة -رضي الله عنها-؛ فحين حدّثه الرسول عن الإسلام أراد علي بن أبي طالب أن يأخذ بمشورة والده، ولكنّه -عليه الصلاة والسلام- طلب منه كتمان ذلك، فرجع علي في اليوم التالي مُخبراً النبي بإسلامه ومؤمناً برسالته كاتماً ذلك عن والده.",
    "part3":"شهد التاريخ لعلي بن أبي طالب -رضي الله عنه- بالعديد من المواقف الجليلة العظيمة، يُذكر منها بياته في فراش النبي -عليه الصلاة والسلام- حين أراد النبي الهجرة من مكة في الليلة التي أجمعت فيها قريش على قتله، وبذلك لفت علي الأنظار عن النبي، فضرب علي أروع مثالٍ للمسلم المجاهد الصادق في إيمانه ورسالته، كما أمره الرسول أن يؤدي الأمانات إلى أصحابها، ففعل، ولحق بالرسول -عليه السلام- بعد ثلاث ليال، وتحمّل مشقّة طريق الهجرة دون أي وسيلةٍ للنقل، وما ذلك إلّا ابتغاء نيل رضا الله سبحانه، كما ضرب علي -رضي الله عنه- أروع الأمثلة في غزوات المسلمين، فشارك فيها جميعاً باستثناء غزوة تبوك؛ إذ استخلفه الرسول -عليه السلام- على المسلمين في المدينة المنورة، كما كان حاملاً للواء في عددٍ منها أيضاً.",
    "part4":"اتّصف علي بن أبي طالب -رضي الله عنه- بالعديد من الصفات والمناقب الحسنة؛ فعُرف بزهده وورعه، وعرّف الزهد بأنّه قصر الأمل وعدم التعلّق بالحياة الدنيا، وشكر الله -تعالى- على نعمه، مع التوّرع عن الوقوع في المحارم، كما أنّ علي كان شديد التواضع، ومن المواقف التي تدلّ على ذلك أنّه كان يحمل متاعه بنفسه ولا يقبل مساعدة أحدٍ رغم أنه كان أميراً للمؤمنين، كبيراً في السن، وعُرف عنه الكرم والجود والعطاء، فكان مهتماً بأمور وشؤون الناس، ورعاية مشاعرهم وأحاسيسهم، مكرماً ضيوفه، فرحاً بقدومهم، ومن صفات علي -رضي الله عنه- الجليلة؛ حياؤه الشديد من الله تعالى، وقال في ذلك: إنّي لأستحي من الله أن يكون ذنبٌ أعظم من عفوي، أو جهلٌ أعظم من حلمي، أو عورةٌ لا يواريها ستري، أو خلةٌ لا يسدّها جودي، إذ إنّ حياء العبد من الله -تعالى- يتطلّب من العبد أن يعفو قدر المستطاع، إلّا في حدٍ من حدود الله، بالإضافة إلى العلم وستر عيوب الناس، والكرم، وُعرف علي بشكره وحمده لله -سبحانه- على كلّ الأمور مهما اختلفت أهميتها، بالإضافة إلى دعائه لله -سبحانه-، إذ كان ملازماً للنبي -عليه الصلاة والسلام- فأخذ عنه كيفية الاستغاثة بالله واللجوء إليه والطلب منه، وكان حريصاً على التقرّب من الله -سبحانه- بتلك الكيفية.",
  },
  {
    "khalifa":"عمر بن الخطاب",
    "color":Colors.indigo.withOpacity(0.7),
    "part1":"هو عمر بن الخطاب بن نُفيل بن عبد العزّى بن رياح بن عبد الله بن قرط بن رزاح بن عدي بن كعب بن لؤي بن غالب بن فِهر بن مالك بن النضر بن كنانة بن خزيمة بن مُدرِكة بن إلياس بن مُضر بن نزار بن مَعَدِّ بن عدنان، أبو حفص العدوي، وأم عمر حنتمة بنت هشام بن المغيرة بن عبد الله بن عمر بن مخزوم أخت أبي جهل بن هشام،[١] وعمر -رضي الله عنه- من أشراف قريش في الجاهلية، له المكانة الرفيعة عندهم، والكلام المسموع بينهم، صاحب فراسةٍ وفطنةٍ ودهاءٍ، متميزٌ بالشجاعة والقوة والهيبة، حتى قال فيه ابن مسعود رضي الله عنهما: (ما زلنا أعزّةً منذ أسلم عمر).[٢] ذُكر عن عمر -رضي الله عنه- أنّه كان طويلاً وجسيماً، حتى فاق الناس في طوله، أصلعاً شديد الصلع، أبيضاً فيه حُمرةً، وأمّا في عباداته وعلاقته بربه، فقد كان يتميّز بطول القيام والصلاة، رقيق القلب، كثير الصيام والصدقة، عظيم الخشية لله تعالى، حتى ورد عنه أنّه نظر إلى تِبنٍ فقال: (ليتني كنتُ هذه التّبنة، ليتني لم أُخلق، ليت أمي لم تلدني، ليتني لم أكن شيئاً، ليتني كنت نسياً منسيّاً)، وبالرغم مِن رقّة قلبه ولينه وخشوعه بين يدي الله -تعالى- إلا أنّه كان قوياً شديداً ينصر المسلمين ويَردّ كيد المشركين، حتى لقّبه رسول الله -صلّى الله عليه وسلّم- بالفاروق، ويُقصد أنّه يفرّق بين الحقّ والباطل، ناصرٌ لدين الله، حتى كره الشيطان لقاءه ومواجهته.",
    "part2":"رُوي في قصة إسلام عمر بن الخطاب أنّه سمع عن إسلام أخته فاطمة وزوجها سعيد، فانطلق باتجاههما بُغية أذيتهما لهذا، وكان عندهما خبّاب بن الأرت يعلمهما القرآن الكريم، فلمّا طرق عمر -رضي الله عنه- الباب، اختبأ خبّاب، ودخل عمر غاضباً فضرب أخته فشجّها، ثمّ طلب إليها أن تناوله الصحيفة التي في يدها فرفضت؛ لأنّه كافرٌ نجسٌ، وهذه الصّحيفة فيها قرآنٌ مطهّرٌ، وطلبت إليه أن يغتسل قبل أن يَمسّها، ففعل، ثمّ أخذها فقرأ منها سطراً واحداً، فانشرح صدره لها، فسأل أخته عن مكان النبيّ -صلّى الله عليه وسلّم- فخرج خبّاب من مخبأه، ودلّه على مكان النبيّ عليه السلام، فانطلق إليه عمر بن الخطاب، يطرق الباب، فلمّا عرف الصحابة أنّه عمر خافوا ووَجِلوا؛ لأنّه كان شديداً عليهم، فطمأنهم النبي صلّى الله عليه وسلّم، ثمّ أذن له فدخل، فلم يكد يرى النبيّ -صلّى الله عليه وسلّم- حتى نطق الشهادتين وأعلن إسلامه.[١] كان إسلام عمر بن الخطاب انفراجاً لضيق المسلمين، وفتحاً لهم، وقد فرحوا بإسلامه فرحاً عظيماً، إذ أمِن المسلمون بعد إسلامه أنْ يُصلّوا في جوار الكعبة، وقد كانوا يخافون قبل ذلك، وقد حسن إسلام عمر رضي الله عنه، وفَاقَ مَن قبله ومَن بعده، حتى امتدحه النبيّ -عليه السلام- في أكثر من موضعٍ، إذ قال فيه مرّةً: (إنّ اللهَ جعل الحقّ على لسانِ عمر وقلبِه)،[٤] وقال عنه النبيّ -صلّى الله عليه وسلّم- كذلك: (قد كانَ يكون في الأمم قبلكم محدّثون، فإن يكن في أمتي منهم أحد فإنّ عمر بن الخطاب منهم)،[٥] وإنّ لعمر -رضي الله عنه- توافقٌ مع القرآن الكريم كذلك؛ إذ تعدّدت الكلمات التي قالها عمر، ثمّ نزل القرآن الكريم في نفس لفظه، وذلك مثل سؤاله للنبيّ -صلّى الله عليه وسلّم- أنْ يتخذ من مقام إبراهيم مصلّى، فنزلت الآية الكريمة بعد ذلك: (َاتَّخِذُوا مِنْ مَقَامِ إِبْرَاهِيمَ مُصَلًّى)،[٦] وفي موضعٍ آخرٍ حين ثارت الغيرة بين نساء النبيّ -صلّى الله عليه وسلّم- فحذّرهنّ بطريقة نزلت فيها الآية بعد ذلك، وهي الآية الكريمة: (عَسَى رَبُّهُ إِن طَلَّقَكُنَّ أَن يُبْدِلَهُ أَزْوَاجًا خَيْرًا مِّنكُنَّ مُسْلِمَاتٍ مُّؤْمِنَاتٍ قَانِتَاتٍ تَائِبَاتٍ عَابِدَاتٍ سَائِحَاتٍ ثَيِّبَاتٍ وَأَبْكَارًا).",
    "part3":"تولّى عمر خلافة المسلمين بعد أبي بكرٍ رضي الله عنهما، وذلك سنة ثلاث عشرة للهجرة، وقد ظهرت صفاته الشخصية جليةً وقت حكمه كذلك، فكان تقيّاً وَرِعاً، شديداً على الكفّار، متوسّعاً في الفتوحات، حتى فُتحت في عهده الفرس والرّوم، لكنّه وبالرغم من شدّته على الكفّار، إلّا أنّه كان رحيماً عطوفاً على المؤمنين، وقد ازداد عطفه وإشفاقه على المسلمين بعد توليه الخلافة إذ قال يوماً: (ثمّ إنّي قد وَلِيتُ أموركم أيّها الناس، فاعلموا أنّ تلك الشّدة قد أُضعِفت، ولكنّها إنّما تكون على أهل الظلم والتعدي على المسلمين، فأمّا أهل السلامة والدين والقصد، فأنا ألينُ لهم من بعضهم لبعض)، ولقد أصيب الناس بالمجاعة في عهده فغاب المطر وأجدبت الأرض، فكان عمر يأكل الخبز والزيت ويقول: (والله لا أشبع حتى يشبع أطفال المسلمين).",
    "part4":"روت أمّ المؤمنين حفصة -رضي الله عنها- أنّ أباها عمر بن الخطاب كان يسأل الله -تعالى- الشهادة في سبيله في بلد رسوله عليه السلام، ولقد أجاب الله -تعالى- دعوته؛ فقد خرج يوماً على المنبر يخاطب المؤمنين يقول لهم: (إنّي رأيتُ رؤيا كأنّ ديكاً نَقرَني نَقرتين، ولا أرى ذلكَ إلا لِحُضور أجلي)،[٩] ولقد أخبر عمر أسماء بنت عُميس برؤياه، فأوّلت ذلك بأنْ يقتله واحدٌ من العجم، فكان كذلك؛ ففي صلاة الفجر في يومٍ كان يسوّي الفاروق الصفوف ثمّ كبّر للصلاة، فما إنْ كبّر حتى صاح: (قَتلَني الكلب)، إذ تلقّى طعناتٍ من مجوسيّ يُقال له (فيروز)، ثمّ هرب هذا المجوسيّ يقتل من يمرّ عليه من الناس فقتل سبعةً آخرين، فأقبل إليه رجلٌ من المسلمين ألقى عليه بُرنساً ولفّه به، فلمّا أيقن المجوسيّ أنّه قد أُلقي القبض عليه نحر نفسه فمات من فوره، وبقي عمر -رضي الله عنه- ينزف دماً بضع ساعاتٍ، أرسل فيها إلى أمّ المؤمنين عائشة -رضي الله عنها- يستأذنها أنْ يُدفن بجوار صاحبيه رسول الله وأبي بكرٍ فأذنت له، ثمّ فارق الفاروق الحياة -رضي الله عنه- بعدها، ودُفن كما سأل الله تعالى، بمدينة صاحبه صلّى الله عليه وسلّم.",
  },
  {
    "khalifa":"حمزة بن عبد المطلب",
    "color":Colors.indigo.withOpacity(0.7),
    "part1":"هو حمزة بن عبدالمطلب بن هاشم بن عبد مناف بن قصي،[١] عُرِف بلقب (أسد الله)، واشتُهِر به، كما ثبت بقول الرسول -عليه الصلاة والسلام-: (سيدُ الشهداءِ حمزةُ بنُ عبدِ المطلبِ)،[٢][٣] ولقّب كذلك \"بِسيّد الشهداء\"،[٤] وكان له العديد من الأولاد، منهم: يعلى وعامر من زوجته بنت الملة بن مالك بن عبادة، وعُمارة من زوجته خولة الأنصارية، ورُزِق من البنات بأمامة من زوجته سلمى بنت عميس أخت أسماء الخثعمية،[١] وقد كُنِّي حمزة بن عبدالمطلب -رضي الله عنه- ب(أبي عمارة)",
    "part2":"أسلم حمزة -رضي الله عنه- بعد أن عَلِم أنّ أبا جهلٍ قد سبّ محمداً -صلّى الله عليه وسلّم-، وشتمه، وآذاه، فغضب حمزة لِما سمعه، وكان قد خرج من أجل الصيد، فرجع للكعبة عند نادي قريش، وكان أبو جهل جالساً بين قومه ورجاله، فرفع حمزة -رضي الله عنه- القوس الذي بيده، وضرب به على رأس أبي جهلٍ، إلّا أنّ أبا جهل منع رجال قريش من مساعدته، وأخبرهم أنّه سبّ محمداً -صلّى الله عليه وسلّم-، فأعلن حمزة -رضي الله عنه- إسلامه أمام الجميع دون خوفٍ، أو تردُّدٍ،[٦] كان لإسلام حمزة الأثر الشديد على قريش؛ إذ ظهر أمرُ النبيّ -صلّى الله عليه وسلّم-، وانتشرت رسالته بين الناس بشكلٍ أكبرٍ، ممّا كان سبباً في عرض قادات قريش المنصب، والمُلك، والمال على النبيّ، فرفض، وتمسّك بالدعوة إلى توحيد الله.[٧] وليس من الصحّة القول بأنّ إسلام حمزة بن عبدالمطلب -رضي الله عنه- كان صدفةً؛ بل سُنّةٌ من سُنَن الله -عزّ وجلّ-، وسببٌ في نصر دعوة محمدٍ بتدبيرٍ من الله -تعالى-.[٨] حمايةً وعزّاً للنبي ورسالته وأتباعها.",
    "part3":"كان أوّل لواءٍ عقده النبيّ لحمزة -رضي الله عنه- في المدينة المُنوّرة؛ فقد اختاره النبيّ -صلّى الله عليه وسلّم- من بين الصحابة؛ لمبارزة الفرسان في غزوة بدر؛ حيث تقدّم من المشركين عتبة بن ربيعة، مع أخيه، وابنه لبدء الهجوم في المعركة، وطلبوا أن يخرج إليهم ثلاثة من الصحابة؛ ليبارزوهم، فلمّا خرجوا إليه سألهم: من أنتم؟ فأجابوه، فقال لهم: \"لا حاجة لنا فيكم، إنّما أردنا بني عمنا\"، فقال النبيّ -عليه الصلاة والسلام-: (قُم يا حَمزةُ، قُم يا عليُّ، قم يا عُبَيْدةُ)،[١٠] فخرج حمزة -رضي الله عنه- لمواجهة عتبة، وبارزه حتى قتله،[١١][١٢] وعُرِف -رضي الله عنه- بقوّته، وشجاعته، وأبلى بلاءً حسناً في قتاله، وكان يُعرَف بالحرب بعلامةٍ؛ وهي ريشة نعامةٍ،[١٣] أمّا المشركون فقد كانوا يتساءلون يوماً: \"من هذا الذي كان مُعلماً بريشة في صدره؟ قالوا: إنّه حمزة فقالوا: هذا الذي فعل بنا الأفاعيل\".",
    "part4":"كان حمزة -رضي الله عنه- يقاتل بكلّ قوةٍ في غزوة أحد، وقد تعثّر أثناء قتاله، وسقط على ظهره، فأُزِيل الدرع الذي كان على بطنه، فرماه وحشيّ الحبشيّ بحِربةٍ*، ممّا أدّى إلى استشهاده -رضي الله عنه-، وكان ذلك يوم السبت، الخامس عشر من شهر شوّال من السنة الثالثة للهجرة، وكان عمره حينها تسعاً وخمسين سنةً،[١٨][١٩] وقِيل إنّه كان أربعاً وخمسين سنةً، ويُشار إلى أنّه -رضي الله عنه- لُقِّب بسيّد الشهداء،[٢٠] أمّا في ما يتعلّق بالمكان الذي دُفِن فيه -رضي الله عنه-، فقد كان في المدينة المُنوّرة -رحمه الله-،",
  },
  {
    "khalifa":"عمرو بن العاص",
    "color":Colors.indigo.withOpacity(0.7),
    "part1":"ولد عمرو بن العاص بن وائل السّهمي في مكّة سنة 592 ميلادية، وكحال كثيرٍ من الغلمان نشأ عمرو بن العاص في ظلّ أفكار الشّرك والضّلالة، فقد كان أبوه من أشدّ رجالات قريش على النّبي -عليه الصّلاة والسّلام- والمسلمين، وقد كانت بداية إسلام عمرو بن العاص في السّنة الثّامنة للهجرة، عندما قام بالقدوم مع خالد بن الوليد إلى المدينة المنوّرة ليشهر إسلامه أمام النّبي -عليه الصّلاة والسّلام- ولتبدأ رحلة عطاء عمرو بن العاص في الإسلام .",
    "part2":"وقد كانت أوّل مهمّة لعمرو بن العاص -رضي الله عنه- حينما جمعت قبائل قضاعة جيشها للهجوم إلى المدينة المنوّرة، فانتدب النّبي -عليه الصّلاة والسّلام- عمراً ليقود سريّة مكوّنة من ثلائمائة رجل حتّى تتوجّه إليهم وتردعهم، وقد رابطت تلك السّرية ثمّ جاءها مدد من المهاجرين والأنصار حتّى رد الله قضاعة، فهربوا مولّين الأدبار. وقد كان لعمرو -رضي الله عنه- حيلة في هذه المعركة، حيث لم يأمر المسلمين باللّحاق بجيش قضاعة؛ خوفاً من أن يعطف عليهم الكفار، كما أنّه نهى المسلمين عن أن يوقدوا نارًا حتّى يدفؤوا بها، وكانت حجّته في ذلك خوفه من أن ينكشف عدد المسلمين فتقل هيبتهم في نفوس أعدائهم . وفي خلافة أبي بكر الصديق وعمر بن الخطّاب -رضي الله عنهما- تولّى عمرو بن العاص -رضي الله عنه- قيادة جيوش المسلمين في فتوحات الشّام، وقد كان مسؤولًا عن قيادة جيش من سبعة آلاف مقاتل مسلم، حيثُ توجّه إلى سواحل الشّام وفلسطين، وبعد أن انتصر خالد بن الوليد -رضي الله عنه- في معاركه ضد الفرس في العراق، توجّه إلى الشّام ليوحّد جيوش المسلمين ولتتواجه مع الرّوم في معركة اليرموك الشّهيرة، التي انتصر فيها المسلمون، وكانت مقدّمةً لفتح جميع بلاد الشّام . وقد كان لعمرو بن العاص -رضي الله عنه- الدّور الأكبر في فتح مصر؛ إذ أقنع الخليفة عمر -رضي الله عنه- بأن تتوجّه جيوش المسلمين لفتحها، فسار إليها من فلسطين واستطاع فتحها، ثمّ صار والي عليها ثمّ عزل عنها في عهد عثمان -رضي الله عنه- ليعود إلى ولايتها في عهد معاوية بن أبي سفيان .",
    "part3":"وقد توفّي عمرو بن العاص -رضي الله عنه- في مصر سنة 682 ميلادية، بعد حياةٍ حافلةٍ بالعطاء والإنجازات .",
    "part4":"",
  },
  {
    "khalifa":"خالد بن الوليد",
    "color":Colors.indigo.withOpacity(0.7),
    "part1":"سيف الله المسلول؛ هو الصحابي الجليل خالد بن الوليد بن المغيرة بن عبد الله بن مخزوم بن يقظة بن مُرّة بن كعب بن لؤي بن غالب، ويكنّى بأبي سليمان، وأمّه لبابة بنت الحارث، أخت أم المؤمنين ميمونة بنت الحارث، مدحه رسول الله- صلّى الله عليه وسلم- قائلاً عنه: (نعمَ عبدُ اللهِ خالدُ بنُ الوليدِ سيفٌ من سيوفِ اللهِ)،[١] وكان إسلامه قبل فتح مكة،[٢] وكان والده سيداً في قريش، ولُقّب بريحانة قريش، يلتقي نسبه بالرسول -عليه الصلاة والسلام- بمُرّة بن كعب، وقد كان -رضي الله عنه- حريصاً على تربية أبنائه على الفروسية، والحرب، واستخدام الأسلحة، كما كان شديد العداء لرسالة الإسلام وللرسول قبل إسلامه. \n\n تمتّع خالد بن الوليد -رضي الله عنه- بقوةٍ في جسمه، إلّا أنّه لم يتم الوقوف على نصٍّ يبيّن ذلك إلاّ قوله عن نفسه: (قَدِ انْقَطَعَتْ في يَدِي يَومَ مُؤْتَةَ تِسْعَةُ أسْيَافٍ فَما بَقِيَ في يَدِي إلَّا صَفِيحَةٌ يَمَانِيَةٌ)،[٤] وقد ورد ما يبيّن التشابه في البنية الجسدية لخالد مع عمر بن الخطاب -رضي الله عنهما- بدليل خلط بعض الناس بينهما.",
    "part2":"اعتنق خالد بن الوليد الإسلام بعد أن جاوز الأربعين سنةً من عمره، وكان ذلك بعد أن أرسل له أخوه رسالةً خاطبه فيها قائلاً: \"سألني رسول الله عنك، فقال أين خالد؟ فقلت: يأتي به الله، فقال: ما مِثلُه جَهِلَ الإسلامَ، ولو كان يجعل نِكايتَهُ مع المسلمين على المشركين كان خيرًا له، ولَقَدَّمْناهُ على غَيرِه، فاستدرك يا أخي ما فاتك منه فقد فاتتك مواطن صالحة\"، فخرج خالد على فرسه متّجهاً إلى المدينة، وسار معه عمرو بن العاص وعثمان بن طلحة بن أبي طلحة، ووصلوا إلى الرسول، وكان ذلك في اليوم الأول من شهر صفر في السنة الثامنة للهجرة، فلما دخلوا على رسول الله سلّموا عليه، وردّ عليهم الرسول -عليه الصلاة والسلام- باستبشارٍ، وطلب منه خالد أن يستغفر له، ففعل.",
    "part3":"وقعت غزوة مؤتة بعد مقتل الصحابي الحارث بن عمير الأزدي الذي بعثه الرسول -صلّى الله عليه وسلّم- إلى هِرَقل ليدعوه إلى الإسلام وتوحيد الله تعالى؛ فقتلوه، وبعدها سيّر الرسول جيشاً من المدينة نحو بلاد الشام بقيادة زيد بن حارثة مع ثلاثة آلاف مقاتل، وعيّن الرسول جعفر بن أبي طالب بعد زيد ثمّ عبد الله بن رواحة، وكان خالد -رضي الله عنه- أحد جنود المعركة، ووصلوا إلى معان وأقاموا فيها ليلتين ووصلتهم الأخبار بكثرة عدد الروم، واستُشهد القادة الثلاثة في المعركة، وسُلّمت الراية لخالد بن الوليد، فأخذ على عاتقه إخراج المسلمين من القتال بأقل الخسائر الممكنة، فأعاد ترتيب الجيش بخطةٍ تُوهم العدو بوصول مددٍ للمسلمين، فجعل الميمنة ميسرة والميسرة ميمنة، واستبدل مقدّمة الجيش بالمؤخّرة، كما كان -رضي الله عنه- مندفعاً للقتال والجهاد ممّا كان سبباً في إثارة الحميّة في صفوف المسلمين، وشنّ هجماتٍ سريعةٍ متواليةٍ على العدو، واستطاع خالد أن يخرج القوة الأكبر للمسلمين ثمّ المؤخرة دون قدرة العدو على مطاردة المسلمين؛ اعتقاداً منهم بوصول إمداداتٍ إليهم، ولم تلحق بهم الكثير من الخسائر مقابل خسائر الروم، وكان الرسول في المدينة يروي أخبار المعركة للمسلمين، إلى أن قال -عليه الصلاة والسلام-: (ثمَّ أخذ الرَّايةَ سيفٌ من سيوفِ اللهِ خالدُ بنُ الوليدِ ففتح اللهُ عليه)،[١٠] وبذلك لُقّب خالد بن الوليد بسيف الله.\n\n وقع فتح مكة في السنة الثامنة من الهجرة، وذلك بعد أن نقض المشركون صلح الحديبية، فتجهّز النبي والمسلمون لدخول مكة، وتجهّز الجيش بأربع مجموعاتٍ، وجعل النبي -عليه السلام- خالد بن الوليد أميراً على الميمنة ليدخل مكة من الجنوب باتجاه الشمال، وأوصى النبي -عليه الصلاة والسلام- بعدم قتل أي أحدٍ إلّا من قاتل، إلّا أنّ عكرمة بن أبي جهل وصفوان بن أمية وسهيل بن عمرو تجمّعوا مع مجموعةٍ من المشركين لاعتراض خالد بن الوليد ومن معه من المسلمين، فوقع القتال بين الفريقين ونجم عنه قتل ثلاثة عشر رجلاً من المشركين واستشهاد ثلاثةٍ من المسلمين، وتجمعت كلّ قوات المسلمين في مكة، وأخذوا يطوفون حول البيت مكبّرين، ثمّ بعث رسول الله خالد بن الوليد مع ثلاثين فارساً بمهمة هدم صنم العزى الذي كان أعظم صنم عند قريش وبني كنانة، فنفّذ خالد المهمة \n\n ",
    "part4":"مات خالد بن الوليد بحمص، في خلافة عمر بن الخطاب -رضي الله عنه- سنة إحدى وعشرين للهجرة،[١٨] وقيل إنّ وفاته كانت في المدينة المنورة،[١٩] وقد مات وهو في سن الخامسة والخمسين من عمره، ولم يترك خلفه إلّا فرسه وسلاحه وكان قد أوقفهما للجهاد في سبيل الله،[٢٠] وحين احتضرته الوفاة بكى وقال: لقيت كذا وكذا زحفاً، وما في جسدي شبر إلّا وفيه ضربة بسيفٍ، أو رمية بسهمٍ، وها أنا أموت على فراشي حتف أنفي، كما يموت العير، فلا نامت أعين الجبناء",
  },
  {
    "khalifa":"بلال بن رباح",
    "color":Colors.indigo.withOpacity(0.7),
    "part1":"هو الصحابيّ الجليل بلال بن رباح الحبشيّ التيميّ القرشيّ بالولاء، كان يُكنّى بأبي عبد الله أو أبي عبد الرحمن، كان من السابقين إلى الإسلام، لكنّه كان في بداية إسلامه مولىً عند أميّة بن خلف الذي كره له أن يعلن إسلامه فكان شديد التعذيب له، حتى كان يخرجه في حرّ الصحراء وقت الظهيرة، ويطرحه أرضاً ويضع صخرةً على صدره، وبقي بلال ثابتاً على دينه يعاني قسوة سيّده حتى اشتراه أبو بكرٍ -رضي الله عنه- وأعتقه لوجه الله",
    "part2":"آتياً بعض الصفات التي اتّصف بها بلال -رضي الله عنه- وأكّدتّها مواقفه مع النبيّ والصحابة الكرام:[٢] المبادرة والسبق، فكان سابع من أعلن إسلامه مع النبيّ عليه السلام. الصبر على التعذيب، والثبات في سبيل الله. رواية بلال -رضي الله عنه- لشيءٍ من أحاديث النبيّ -عليه السلام-، حتى نقل عنه أكثر من عشرين بينهم صحابة وتابعون. التواضع؛ فكان دائماً ما يُذكّر نفسه أنّه كان عبداً يوماً ما. جهاده؛ إذ إنّه شَهِد كُلّ الغزوات مع النبيّ -عليه السلام- ولم يتخلّف عن أيٍ منها.[٣] جمال صوته الذي جعله مؤذن النبيّ في المدينة.",
    "part3":"بقي بلال -رضي الله عنه- مُؤذّن النبيّ -عليه السلام- طوال حياته، حتى أذّن على سطح الكعبة يوم فتح مكّة، ولمّا توفّي النبيّ أذّن بلال ولم يُدفن النبيّ بعد، وما إن وصل قول: (أشهد أن محمّداً رسول الله) حتى بكى بكاءً شديداً وأبكى الناس معه، ثمّ ترك الأذان بعد ذلك، ولم يُؤذّن حتى يوم فتح بيت المقدس في عهد عمر بن الخطّاب فطلب إليه عمر أن يُؤذّن، فأذّن ولم يُرَ باكياً مثل ذلك اليوم قطّ عندما ذكر رسول الله.",
    "part4":"بعدما تُوفي رسول الله صلى الله عليه وسلم رفض بلال بن رباح بأن يؤذن لأحد من بعده، وفعلاً لم يؤذن إلا مرة واحدة فقط بعد أن ناشدوه الصحابة بفعل ذلك، فأذن إلى أن وصل إلى قوله: (أشهد أن محمداً رسول الله)، فبدأ بالبكاء، ولم يقدر أن يُكمل الأذان، وذهب بلال إلى أبي بكر الصديق كي يسمح له بأن يُشارك في الفتوحات الإسلامية، غير أنّ أبي بكر رفض ذلك بسبب كبر سنّه، وبقي عند أبي بكر إلى أن وافته المنية، وبعد ذلك ذهب إلى عمر بن الخطاب ليُشارك بالفتوحات، فرفض عمر، وألح بلال عليه، ثمّ سمح له بذلك",
  },
  {
    "khalifa":"عبد الرحمن بن عوف",
    "color":Colors.indigo.withOpacity(0.7),
    "part1":"صحابي جليل، أحد العشرة المبشّرين في الجنة، اسمه عبد الرحمن بن عوف بن عبد الحارث بن زهر القرشي، ولد بعد عام الفيل بعشر سنوات، أمّه الشفاء القرشية. كان اسمه عبد الكعبة فغيّره النبي - صلى الله عليه وسلم - إلى عبد الرحمن، يكنّى أبا محمد، عُرف برجاحة عقله، وكياسة رأيه، حتى قال عنه عمر بن الخطاب - رضي الله عنه - : ( عبد الرحمن سيدٌ من سادات المسلمين). \n\n ",
    "part2":"كان من السبّاقين إلى الإسلام؛ حيث كان ثامن رجل يدخل الإسلام، أسلم قبل بداية مرحلة الدعوة السريّة في دار الأرقم بن أبي الأرقم، على يد أبي بكر الصديق - رضي الله عنه - وكان عمره حينها ثلاثين عاماً، انطلق برفقة أبي بكر الصدّيق هو ونفرٌ من الصحابة هم: عثمان بن عفّان، والزبير بن العوّام، وسعد بن أبي وقاص، وطلحة بن عبيد الله إلى رسول الله، فعرض عليهم الإسلام، وقرأ عليهم القرآن فاطمأنّت قلوبهم وأعلنوا إسلامهم.",
    "part3":"هاجر إلى الحبشة، ثمّ إلى المدينة المنوّرة ولقد آخى رسول الله بينه وبين سعد بن الربيع وكان صِفر اليدين فعرض عليه سعد أن يقاسمه ماله ومتاعه فرفض ذلك وقال مقولته المعروفة : ( دُلَّني على السوق) فتاجر وجمع ثروةً طائلة . غزا الغزوات كلّها فشهد بدراً الكبرى وأصيب في أُحُد بعدة جراح، إحداها سبّبت له العرج، وكان ممّن ثبتوا في غزوة أُحُد، وبني قينقاع وبني النضير، وبني قريظة، وغزوة الأحزاب، كذلك شهد صلح الحديبية وفتح مكة وغزوة حُنين وتبوك. ممّا يُذكر أنّ الرسول -صلى الله عليه وسلم- صلّى خلفه في غزوة تبوك، فكان أحد الرجلَين اللَّذين صلّى خلفهما حبيب الله محمد، وهما: عبد الرحمن بن عوف، وأبو بكر الصديق.",
    "part4":"توفّي في المدينة المنوّرة سنة إحدى وثلاثين للهجرة، عن عمرٍ يناهز خمسٍ وسبعين سنة، حمله سعد بن أبي وقاص وصلّى عليه عثمان بن عفان رضي الله عنهما، فقال علي بن أبي طالب -رضي الله عنه - :اذهب ابن عوف، فقد أدركت صفوها، وسبقت زيفها)، دفن في البقيع، وكان قد جاء في وصيّته قوله: (يا أصحاب محمد صلى الله عليه وسلم كل من بقي من أهل بدر له أربعمائة دينار).",
  },
];


var DeadDoaaList = [
{
"zekr": "اللَّهُمَّ، اغْفِرْ له وَارْحَمْهُ، وَاعْفُ عنْه وَعَافِهِ، وَأَكْرِمْ نُزُلَهُ، وَوَسِّعْ مُدْخَلَهُ، وَاغْسِلْهُ بمَاءٍ وَثَلْجٍ وَبَرَدٍ، وَنَقِّهِ مِنَ الخَطَايَا كما يُنَقَّى الثَّوْبُ الأبْيَضُ مِنَ الدَّنَسِ، وَأَبْدِلْهُ دَارًا خَيْرًا مِن دَارِهِ، وَأَهْلًا خَيْرًا مِن أَهْلِهِ، وَزَوْجًا خَيْرًا مِن زَوْجِهِ، وَقِهِ فِتْنَةَ القَبْرِ وَعَذَابَ النَّار",
"repeat": 1,
"bless": ""
},
{
"zekr": "اللَّهمَّ اغْفِرْ لحيِّنا وميِّتِنا وشاهدنا وغائِبنا وصَغيرنا وَكبيرنا وذَكرِنا وأُنثانا اللَّهمَّ مَنْ أحييتَه مِنَّا فأحيِه علَى الإسلامِ ومن تَوَفَّيتَه مِنَّا فتَوفَّهُ علَى الإيمانِ اللَّهمَّ لا تحرمنا أجرَه ولا تُضلَّنا بعدَه",
"repeat": 1,
"bless": "من قالها موقنا بها حين يمسى ومات من ليلته دخل الجنة وكذلك حين يصبح."
},
{
"zekr": "استغفِروا لأخيكُم ، وسَلوا لَهُ التَّثبيتَ ، فإنَّهُ الآنَ يُسأَلُ",
"repeat": 3,
"bless": "من قالها حين يصبح وحين يمسى كان حقا على الله أن يرضيه يوم القيامة."
},
{
"zekr": "اللَّهمَّ إنَّ فلانَ بنَ فلانٍ في ذِمَّتِك وحبلِ جِوارِك فَقِهِ من فتنةِ القبرِ وعذابِ النَّارِ وأنتَ أهلُ الوفاءِ والحقِّ فاغفر لَه وارحمهُ إنَّكَ أنتَ الغفورُ الرَّحيمُ",
"repeat": 4,
"bless": "من قالها أعتقه الله من النار."
},
{
"zekr": "اللهم أنت ربها، وأنت خلقتها، وأنت هديتها للإسلام، وأنت قبضت روحها، وأنت أعلم بسرها وعلانيتها، جئنا شفعاء فاغفر له",
"repeat": 1,
"bless": "من قالها حين يصبح أدى شكر يومه."
},
{
"zekr": "اللهمّ أبدله داراً خيراً من داره، وأهلاً خيراً من أهله، وأدخله الجنّة، وأعذه من عذاب القبر، ومن عذاب النّار.",
"repeat": 7,
"bless": "من قالها كفاه الله ما أهمه من أمر الدنيا والأخرة."
},
{
"zekr": "اللهمّ اجزه عن الإحسان إحساناً، وعن الإساءة عفواً وغفراناً.",
"repeat": 3,
"bless": "لم يضره من الله شيء."
},
{
"zekr": "اللهمّ آنسه في وحدته، وفي وحشته، وفي غربته.",
"repeat": 1,
"bless": ""
},
{
"zekr": "اللهمّ اجعل قبره روضةً من رياض الجنّة، ولا تجعله حفرةً من حفر النّار.",
"repeat": 1,
"bless": ""
},
{
"zekr": "اللهمّ أنزله منازل الصدّيقين، والشّهداء، والصّالحين، وحسُن أولئك رفيقاً.",
"repeat": 3,
"bless": ""
},
{
"zekr": "اللهمّ إنّه عبدك وابن عبدك، خرج من الدّنيا، وسعتها، ومحبوبها، وأحبّائه فيها، إلى ظلمة القبر، وما هو لاقيه.",
"repeat": 3,
"bless": ""
},
{
"zekr": "اللهمّ إنّا نتوسّل بك إليك، ونقسم بك عليك أن ترحمه ولا تعذّبه، وأن تثبّته عند السّؤال.",
"repeat": 3,
"bless": ""
},
{
"zekr": "اللهمّ يمّن كتابه، ويسّر حسابه، وثقّل بالحسنات ميزانه، وثبّت على الصّراط أقدامه، وأسكنه في أعلى الجنّات، بجوار حبيبك ومصطفاك صلّى الله عليه وسلّم.",
"repeat": 1,
"bless": ""
},
{
"zekr": "اللهمّ إنّه صبر على البلاء فلم يجزع، فامنحه درجة الصّابرين، الذين يوفّون أجورهم بغير حساب، فإنّك القائل إنّما يوفّى الصّابرون أجرهم بغير حساب",
"repeat": 3,
"bless": ""
},
{
"zekr": "اللهمّ إنّه كان لكتابك تالياً وسامعاً، فشفّع فيه القرآن، وارحمه من النّيران، واجعله يا رحمن يرتقي في الجنّة إلى آخر آية قرأها أو سمعها، وآخر حرفٍ تلاه.",
"repeat": 1,
"bless": ""
},
{
"zekr": "اللهمّ ارحمه فإنّه كان مسلماً، واغفر له فإنّه كان مؤمناً، وأدخله الجنّة فإنّه كان بنبيّك مصدّقاً، وسامحه فإنّه كان لكتابك مرتّلاً.",
"repeat": 1,
"bless": ""
},
{
"zekr": "اللهمّ اغفر لحيّنا وميّتنا، وشاهدنا وغائبنا، وصغيرنا وكبيرنا، وذَكرنَا وأنثانا.",
"repeat": 1,
"bless": ""
},
{
"zekr": "اللهمّ من أحييته منّا فأحيه على الإسلام، ومن توفّيته منّا فتوفّه على الإيمان",
"repeat": 1,
"bless": "من قالها موقنا بها حين يمسى ومات من ليلته دخل الجنة وكذلك حين يصبح."
},
{
"zekr": "اللهمّ ارحمنا إذا أتانا اليقين، وعرق منّا الجبين، وكثر الأنين والحنين.",
"repeat": 3,
"bless": "من قالها حين يصبح وحين يمسى كان حقا على الله أن يرضيه يوم القيامة."
},
{
"zekr": "اللهمّ ارحمنا إذا يئس منّا الطّبيب، وبكى علينا الحبيب،",
"repeat": 4,
"bless": "من قالها أعتقه الله من النار."
},
{
"zekr": "اللهمّ ارحمنا إذا اشتدّت الكربات، وتوالت الحسرات، وأطبقت الرّوعات، وفاضت العبرات، وتكشّفت العورات، وتعطّلت القوى والقدرات.",
"repeat": 1,
"bless": "من قالها حين يصبح أدى شكر يومه."
},
{
"zekr": "اللّهم ارحمنا إذا حُمِلنا على الأعناقِ، وبلغتِ التراقِ، وقيل من راق، وظنّ أنّه الفراق، والتفَّتِ السَّاقُ بالسَّاقِ، إليك يا ربَّنا يومئذٍ المساق.",
"repeat": 7,
"bless": "من قالها كفاه الله ما أهمه من أمر الدنيا والأخرة."
},
{
"zekr": "اللهمّ ارحمنا إذا ورينا التّراب، وغلّقت القبور والأبواب، وانفضّ الأهل والأحباب.",
"repeat": 3,
"bless": "لم يضره من الله شيء."
},
{
"zekr": "للَّهُمَّ شفع فيها نبيّنا ومصطفاك، واحشرها تحت لوائه، واسقها من يده الشّريفة شربةً هنيئةً لا تظمأ بعدها أبداً.",
"repeat": 1,
"bless": ""
},
{
"zekr": "اللهمّ ارحمنا إذا قُمنا للسّؤال، وخاننا المقال، ولم ينفعنا جاهٌ، ولامال، ولا عيال، وليس إلّا فضل الكبير المتعالّ.",
"repeat": 1,
"bless": ""
},
{
"zekr": "اللهم اغفر لحيينا وميتنا وشاهدنا وغائبنا و كبيرنا وصغيرنا",
"repeat": 3,
"bless": ""
},
{
"zekr": "اللهم اجعل لـ موتى المسلمين في جنتك عيد أجمل،وصحبة أخلص،وجيرة أكرم. اللهم وأعد لم شملهم بأهلهم وأحبتهم في فردوسك الأعلى يا أرحم الراحمين.",
"repeat": 3,
"bless": ""
},
{
"zekr": "اللهم إنا نسألك زيادة في الأيمان .. وبركة في العمر .. وصحة في الجسد .. وسعة في الرزق .. وتوبة قبل الموت .. وشهادة عند الموت .. ومغفرة بعد الموت .. وعفواً عند الحساب … وأماناً من العذاب .. ونصيباً من الجنة .. وارزقنا النظر إلى وجهك الكريم.",
"repeat": 3,
"bless": ""
},
{
"zekr": "اللهم ارحم آبائنا وأمهاتنا واغفر لهما وتجاوز عن سيئاتهما وأدخلهم فسيح جناتك.",
"repeat": 1,
"bless": ""
},
{
"zekr": "اللهم ارحم موتانا وموتى المسلمين .. واشفي مرضانا ومرضا المسلمين .. اللهم اغفر للمسلمين والمسلمات .. والمؤمنين والمؤمنات … الأحياء منهم والأموات.",
"repeat": 3,
"bless": ""
},
{
"zekr": "اللهم من اعتز بك فلن يذل .. ومن اهتدى بك فلن يضل .. ومن استكثر بك فلن يقل .. ومن استقوى بك فلن يضعف .. ومن استغنى بك فلن يفتقر .. ومن استنصر بك فلن يخذل .. ومن استعان بك فلن يغلب .. ومن توكل عليك فلن يخيب .. ومن جعلك ملاذه فلن يضيع .. ومن اعتصم بك فقد هدي إلى صراط مستقيم .. اللهم فكن لنا وليا ونصيرا .. وكن لنا معينا ومجيرا .. إنك كنت بنا بصيرًا.",
"repeat": 1,
"bless": ""
},
{
"zekr": "اللهم أحينا في الدنيا مؤمنين طائعين .. وتوفنا مسلمين تائبين … اللهم ارحم تضرعنا بين يديك .. وقوّمنا إذا اعوججنا .. وادعنّا اذا استقمنا .. وكن لنا ولا تكن علينا.",
"repeat": 1,
"bless": ""
},
{
"zekr": "اللهم نسألك يا غفور يا رحمن يا رحيم .. أن تفتح لأدعيتنا أبواب الاجابه .. يا من اذا سأله المضطر أجاب .. يا من يقول للشيء كن فيكون … اللهم لا تردنا خائبين وآتنا افضل ما يؤتى عبادك الصالحين .. اللهم ولا تصرفنا عن بحر جودك خاسرين ولا ضالين ولا مضلين .. واغفر لنا الى يوم الدين .. برحمتك يا أرحم الرحمين.",
"repeat": 3,
"bless": ""
},
{
"zekr": "اللهم إني أسألك من خير ما سألك به محمد صلى الله عليه وسلم .. واستعيذ بك من شر ما استعاذ به محمد صلى الله عليه وسلم.",
"repeat": 10,
"bless": "من صلى على حين يصبح وحين يمسى ادركته شفاعتى يوم القيامة."
},
{
"zekr": "يارب اللهم يا عزيز يا جبار اجعل قلوبنا تخشع من تقواك واجعل عيوننا تدمع من خشياك واجعلنا يا رب من أهل التقوى وأهل المغفرة واجعلنا مع حبيبك ورسولك المصطفى في الجنة.",
"repeat": 3,
"bless": ""
}
];